{"table": "ManOnTop", "positions": [{"title": "Seesaw Sex Position", "content": "Who said seesaws were just for kids? The seesaw sex position is a creative way to achieve pure orgasm while rocking back and forth into pleasure-filled wonder. Here\u0027s how to make it happen:\n\nHim: With seesaw sex, it\u0027s up to you to drill your dick deep into your woman as you press down on her. On all fours, place your hands to either side of her head with your legs spread, yet touching at the feet. Ease your cock into her vaginal canal and start to thrust.\n\nHer: Get ready to bend and move as you lay on your back with your legs direct in the air. Your man will press against them, hard, until you\u0027re bent in two, drilling into you as you hold onto the backs of his thighs.\n\nWhy It Rocks: This relatively easy sex position is a great fix up for women looking to feel a new kind of pleasure. With the seesaw position, rock and ride, just like when you were kids, until you both hit that sweet G spot.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/seesaw-sex-position.jpg", "category": "Kneeling Or Standing, Man On Top"},{"title": "Screwdriver Sex Position", "content": "The screwdriver sex position is one of those quirky sex positions that challenges both parties to mix up a classic sex position. With the screwdriver position, get ready to bend and twist until ultimate penetration is achieved:\n\nHim: As your woman opens her lips to you, facing away, approach her from behind and place your leg leg over her upper thigh. Using your right leg for stability beneath you, hang onto her love handles while you gently plow into her.\n\nHer: Get on all fours like you\u0027re ready for doggystyle sex. Spread your legs wide, arch your back, and pop your pussy high into the air so your man can wiggle his way in.\n\nWhy It Rocks: This rear entry sex position is a twisted take on doggystyle, providing both parties with ultimate control and pleasure. With some patience, maneuver into place for total penetration.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/screwdriver-sex-position.jpg", "category": "Kneeling Or Standing, Man On Top"},{"title": "Scorpion Sex Position", "content": "The scorpion sex position is a gentle rear entry sex position that will provide you and your partner with the quintessential pleasure that is only possible from sweet and dirty backside fucking:\n\nHim: As your woman lays down on her stomach, hugging her pillow, brush yourself up against her ass. Place your hands on either side of her for stability as your thrust your cock into her warm vagina, hidden by her soft ass cheeks.\n\nHer: Lay on your stomach, with a pillow beneath you, as you stabilize your upper half with your forearms. Spread your legs slightly so your man can easily enter you with a warm welcome.\n\nWhy It Rocks: Rear entry sex is an incredibly pleasure-filled sensation for both parties, providing the woman with control over penetration. Get ready to fuck like rabbits, simply atop a pillow.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/scorpion-sex-position.jpg", "category": "Man On Top"},{"title": "Scissors Sex Position", "content": "Scissor your way into place for cock-to-vaginal penetration you\u0027ll never forget.\n\nThe scissors sex position is a unique take on a time-old lesbian way of love-making. With the scissoring sex position, connect your bodies at the middle as you do the dirty act until both parties are cumming:\n\nHim: As your woman lays on her back, snuggle your way in-between her legs with your one leg beneath her, and the other leg on top of her. Use your left arm to stabilize your torso as you wiggle your cock into her vagina.\n\nHer: Lay on your back, with your legs bent at your knees. Place your right leg on top of your man, and the left leg below him. Spread them wide to provide him with plenty of penetration room.\n\nWhy It Rocks: The sex position of scissoring provides both parties with the ability to intimately connect in the middle. Wiggle around until you get it just right – and trust us, you\u0027ll know when that happens.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/scissors-sex-position.jpg", "category": "Man On Top, New"},{"title": "Reverse Missionary Sex Position", "content": "The reverse missionary sex position is one of those creative sex positions that challenges both parties to think outside the box. So what is reverse missionary sex? Let\u0027s look at it below:\n\nHim: You\u0027re going to have to dig deep for this one, as you get on your stomach, lifting yourself up with your hands. You have to get on your woman after she\u0027s already laid down, facing away from her. With the right contortion, feeling the entry of her pussy with your cock.\n\nHer: This one is easier for you. Lay down completely with your legs together as you bend them at the knee. Be patient as your man positions himself on top of you. Help him find your vaginal entry and get ready for very interesting sex.\n\nWhy It Rocks: The reverse missionary position is a totally new take on a time old sex position classic. Definitely exercise patience in this one, because it will take some time to get it right.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/reverse-missionary-sex-position.jpg", "category": "Man On Top"},{"title": "Rear Entry Sex Position", "content": "Rear entry sex provides a kind of sexual penetration that is so euphoric feeling, you come crawling back for more. Rear entry sex position is no stranger to backside penetration, which is why you and your partner will definitely want to try it today:\n\nHim: Get ready to assume your manliness as you enter your woman from behind. Position yourself over her back with your arms used to stabilize yourself as you thrust away into her pussy. Sex from the rear feels absolutely amazing, there\u0027s no denying it.\n\nHer: Lay on your stomach, craning your knees so your legs are propped into the air. Use your arms to grab your legs, opening up your pussy to full rear entry penetration.\n\nWhy It Rocks: With a little patience, this puzzle-piece sex position from behind is a great way to achieve total pleasure in no-time. Take your time with it, because by the end, it\u0027s totally worth it.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/rear-entry-sex-position.jpg", "category": "Man On Top"},{"title": "Prone Bone Sex Position", "content": "The prone bone sex position is a great way to take your lover from behind while still making it comfortable and intimate. With prone bone sex, you can even make it your own with a little customization. Here\u0027s how to do it:\n\nHim: Wait for your woman to lay down as you spread your legs and gently sit on the back of her upper thigh. Stabilize yourself by grabbing her love handles as you spread her ass cheeks and sink your dick deeply into her warm and inviting pussy.\n\nHer: Lay down on your stomach, with your arms in front of you for stabilization. That\u0027s it! It\u0027s up to your man to position himself correctly behind you for perfect penetration.\n\nWhy It Rocks: The prone sex position is a great way to connect with just a flat surface or bed available. With prone bone sex, take your time to really position yourself correctly so that it feels amazing for all parties involved.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/prone-bone-sex-position.jpg", "category": "Kneeling Or Standing, Man On Top"},{"title": "Mercenary Sex Position", "content": "Everyone around the world has either heard of mercenary sex, or has tried it out at one time or another. Since it\u0027s easy, direct, and pleasurable for both parties, it\u0027s no wonder the mercenary sex position is the preferred position for virgins wading into the world of sexy time.\n\nHim: You\u0027re in control with this one, while you edge up to your woman, with her legs spread and in the air. Ease in-between her legs as you sink into her pussy, stabilizing the upper half of your body with your arms planted on the bed or against the wall.\n\nHer: Simply lay back and get ready to ride with the mercenary position. Spread your legs, bend them at the knee, up in the air, while your man gets settled.\n\nWhy It Rocks: It doesn\u0027t get much easier than the mercenary sex position, which is why it\u0027s a super user-friendly option for you and your partner to test out during the beginning of intercourse. It\u0027s always good to start with the basics.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/mercenary-sex-position.jpg", "category": "Man On Top"},{"title": "Legs Up Sex Position", "content": "This is another legs up sex position that provides the man with a direct angle for ultimate, creamy penetration.\n\nIf you\u0027re looking to take your sex life to the next level, the Legs Up Sex Position is a great way to make direct contact, with nothing stopping the penis from full, creamy vaginal penetration. Get yourself shifted and in legs up position for a crazy and wild night.\n\nHim: Tap into your animalistic side as your ease yourself into your woman, with your arms carefully planted on either side of your head for weight distribution. Spread your legs substantially at the knee so you are able to sink in deeply.\n\nHer: Lay on your back, put your legs in the air, and allow your man to use the pressure of your body to keep your legs pushed back into place. Hold onto his torso while he drills you so deeply, you\u0027ll be gasping for air.\n\nWhy It Rocks: If you like to bang in a sex position legs up stance, this easy sex act is one for you. Be patient while the woman\u0027s legs bend into place at the knee and remember to take in slow while everyone gets the right angle going.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/legs-up-sex-position.jpg", "category": "Kneeling Or Standing, Man On Top"},{"title": "Legs Over Shoulders Sex Position", "content": "If you like sexual penetration that is so thick and so deep you\u0027re left gasping for air, this is a sex position for you.\n\nLegs on shoulder sex sets the scene for an animalistic fucking routine that gets down and dirty where other people won\u0027t go. If you\u0027re ready for a Legs Over Shoulder Sex Position that is acrobatic, naughty, and direct, this one gets the job done.\n\nHim: Nothing feels better than direct and deep penetration, providing your cock with a total massage. Allow your woman to bend her legs up and over while you drill down, keeping her in place, as she screams for more.\n\nHer: Lay on your back, pull your legs up in the air, and place your hands on the backs of your thighs to keep your legs in place. Allow your man to ease onto you while he uses his hands to support the majority of his weight.\n\nWhy It Rocks: Legs on shoulder sex is a favorite sex position for most men out there, opening up the woman to total exposure. Remember to take it slow at first while her pussy breaks in and opens up for this kind of ramming.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/legs-over-shoulders-sex-position.jpg", "category": "Kneeling Or Standing, Man On Top"},{"title": "Lazy Dog Sex Position", "content": "If you\u0027ve had a long day and want to take it from behind, the Lazy Dog Sex Position is an easy and cum-filled experience waiting for you.\n\nWe all know how tiring our days can be, which is why the Lazy Dog Sex Position is an easy way to plow from behind and scream into the night. The lazy dog sex act is actually how it sounds, and you\u0027re going to love it once you try it.\n\nHim: What guy doesn\u0027t love doggystyle sex? Aim over your woman as she lays on her stomach and use your left hand to support her abdomen underneath you. Balancing with your right hand, plow deep into her warm and open pussy while she waits for you to make sweet love.\n\nHer: Lay flat and forward, with your arms support your head and neck upwards. That\u0027s it! The rest is up to your man, and if you love taking it from behind, this is a lazy way to easily cum without doing very much at all.\n\nWhy It Rocks: Sometimes, we all need a lazy out, even if we\u0027re feeling super horny. This is a sex position everyone can do in a bed, or even on a floor. For the ladies, you really have to do nothing, while your man lights up your world.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/lazy-dog-sex-position.jpg", "category": "Man On Top"},{"title": "Flat Iron Sex Position", "content": "The Flat Iron Sex Position is a classier doggystyle lovemaking act that leaves both parties incredibly satisfied.\n\nIf you are someone who loves sex from behind, then the Flat Iron Sex Position is a more elegant way to go about it. This is one of those new positions to try the next time you two are in the fucking mood.\n\nHim: Show off your pegging skills while you lower yourself onto your woman, supporting the majority of your weight with your hands on either side of her to the front. Enter her from the back and ease into it for ultimate pleasure.\n\nHer: Lay down on your front, submitting to your man, with your arms helplessly at either side of you. Spread your legs slightly, with a bend at the knee, so he can fondle and enter your wet and welcoming pussy.\n\nWhy It Rocks: Both men and women love sex from behind, and this position is one way to mix things up, requiring a bed or a hard surface to make it happen. For comfort, try placing a pillow between the woman and the bed so the angling isn\u0027t uncomfortable.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/flat-iron-sex-position.jpg", "category": "Man On Top"},{"title": "Eagle Sex Position", "content": "If you like deep, penetrative sex that leaves nothing to the imagination, get ready to fly like an eagle.\n\nThe Eagle Sex Position is a great way for couples to feel total, unadulterated, and pure penetration, digging deep until you both explode in a cumming scream.\n\nHim: The Eagle Position places you in a traditional military style pose, except this time, drilling down hard while you hover over your woman. Place your lady below you, with her legs pushed up and bent back. Give her some time to stretch into position as you ease your weight down, using her thighs to support you. Enter and get to work.\n\nHer: You get to lay on your back for this one. But, it does require some flexibility in the hamstrings region. Place your legs in the air and bend them back, using your man\u0027s weight to keep them back while he enters you.\n\nWhy It Rocks: This is a very easy sex position, taking the military pose to the next level, requiring just a flat service or bed to get it right. Get ready to dip deep.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/eagle-sex-position.jpg", "category": "Man On Top"},{"title": "Deck Chair Sex Position", "content": "The Deck Chair Sex Position is a must try, deep penetration position that enables the man to assume control and go in, full access. Requiring a flat surface and nothing else, it can be performed anywhere – perhaps, even outside on your deck? Let\u0027s see how:\n\nHim: Bending your women essentially in half, facing you, enter her from above, holding her tight and open with your hands while her legs wrap around your back. Be sure to keep your balance on your knees so your entire weight is not crushing her.\n\nHer: Lay on your back, legs up in the air and spread, while your man enters you. Wrap your legs around his back and allow him to position himself for ultimate, deep penetrative access. Go slow with this one while he breaks you in.\n\nWhy It Rocks: If you have the right patience to go slow with the deck chair position, this can be one of the most deeply penetrative positions out there. With a little time in the beginning, get your rhythm down and thrust away your cares and worries.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/deck-chair-sex-position.jpg", "category": "Man On Top"},{"title": "Cat Sex Position", "content": "You might be asking yourself: what is the cat position? This unique sex pose is essentially the opposite of the military sex position, placing the man\u0027s legs to the outside of the women\u0027s while he works his way into her. If you\u0027re interested in learning more about the Cat Sex Position, follow with us below:\n\nHim: The cat style position requires from flexibility on your end, as you lay on top of your woman, with your legs spread apart while hers fit snuggly between yours. This cat position requires some dexterity on your end to find the right angle to penetrate her without the convenience of her legs being spread apart.\n\nHer: What could be better than this pose? You can simply lay back and let the man to all of the work. Relax, close your eyes, and enjoy the ride, ladies!\n\nWhy It Rocks: This is an incredibly easy sex position for both parties to perform, requiring nothing but a bed or a surface. As for the ladies, you get to drift off into orgasmic heaven, never looking back!\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/cat-sex-position.jpg", "category": "Man On Top"},{"title": "Cancer Sex Position", "content": "As a classic sex position on the stomach, the Cancer Sex Position is a more intimate and deeper penetrating version of doggystyle, with a closer embrace and deeper sex than other sex positions today. If you\u0027re ready to really immerse yourself in luxurious sexual pleasure, here\u0027s how:\n\nHim: This is an incredibly easy and comfortable sex position for you, requiring you to do nothing but plow from behind, using your hands as stabilization since you will be on all fours. Place your left leg inside her two legs, and your right leg to the outside. Get your balance, and go to town.\n\nHer: If you like easy sex positions that enable you to lay down, then the Cancer Sex Position is a perfect sex position for you! Simply lay down, bend your knees, and place your calves into the air. Hold the bed in front of you, sit back, and let the love making ensue.\n\nWhy It Rocks: This is a pleasurable sex position that is easy for any kind of lover to achieve. All you need is a bed, or even a surface, and some hot, steamy passion while you ride out the night.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/cancer-sex-position.jpg", "category": "Man On Top"},{"title": "Boat Sex Position", "content": "This is a more complex sex position, requiring agility, flexibility, and patience from both partners involved in the dirty act. Although it might not look beautiful to a bystander, this classically “lazy sex position” still requires some clever movement to get it right. Here\u0027s how:\n\nHim: You\u0027re going to need a surface or blanket to grab onto as you take your woman from behind. With her legs spread, place your left leg between hers, and your right leg on the outside of her right leg. Angle yourself correctly, grab the blanket for balance, and go to town.\n\nHer: Lay down on your stomach, bend your legs at the knees, and spread them while the man angles himself into you. For the best feeling, position yourself at the edge of the bed so you can hold onto it for support while he enters you. Take this one slow, you\u0027ll want to enjoy it.\n\nWhy It Rocks: The Boat Sex Position feels amazing for both partners, as a deep sex position that with the right angle, can be otherworldly. For the best results, do it on top of a bed so you can hang in there.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/boat-sex-position.jpg", "category": "Man On Top"},{"title": "21 Sex Position", "content": "Are you ready to get down and freaky, in a classic doggystyle love-making pose? Placing both lovers in a way that direct penetration can ensue, the 21 Position will give you that addictive feeling you crave. With little strength or flexibility required, here\u0027s how to get freaky:\n\nHim: Stand up against a bed or piece of furniture (kneeling can work well, too) and grab the woman\u0027s hips in front of you as she stands on all fours. Spread her legs so you can fit in-between, slowly penetrating from behind. Take it slow until she feels comfortable and ready to go.\n\nHer: Get on the bed, on all fours, looking downwards like it\u0027s about to be doggystyle. Allow the man to grab your legs and flexibly stretch them apart so he can press up against your backside. This position will require some flexibility on your end, so feel free to take it slow until you feel comfortable. \n\nWhy It Rocks: The 21 Sex Position is one step freakier than doggystyle, fun for both you and your partner without requiring too much physical strength or stretching. All you need is a bed or a piece of furniture. Remember to take is slow and enjoy the sex position; it\u0027ll feel good for both parties.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/21-sex-position.jpg", "category": "Man On Top"},{"title": "Snow Angel Sex Position", "content": "Even in summer, you can be a snow angel! That\u0027s right, the snow angel sex position is a move anyone can add to their must-try list. I mean, maybe you shouldn\u0027t rush to it, because it is one of the more extreme sex positions, but it can get you closer to that sex god level. You don\u0027t have to be one yet to get it, but once you read about it you\u0027ll want to try it. Here\u0027s how to become a snow angel in the bedroom. \n\nHer: Lie on your back. Wrap your legs around your male partner\u0027s hips. Lean forward with your hands on his ass or lower back. Almost like you are doing an ab workout. \n\nHim: Lie on your stomach in the opposite direction of your partner. Scooch your hips back and over her hips and enter her from the opposite direction and on top. Let her wrap her legs around you and place your hands on your body. Get in sphinx pose with your forearms laying down in front of you. \n\nWhy It Rocks: The snow angel sex position is absolutely unique. You probably have never tried it before, but once you do it you\u0027ll learn that you can do more than you thought you could. Oh, and it feels great too!\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/08/snow-angel-position.jpg", "category": "Man On Top"},{"title": "Scissor Sex Position", "content": "Sex not challenging enough? Getting her close to climax not giving you the opportunity to show off anymore? Then you need to try the scissor sex position. This hard sex position is definitely going to give you a run for your money. Challenges are fun, and when you tackle them with your favorite person in the world they\u0027re even better. Aw, right? Hold off on the sentimental\u0027s until you try this move… \n\nHer: Lie on your back with your head and neck twisted to the right. Kick your leg up in the air and open yourself up. Twist your hips in the opposite direction. Stare into your lover\u0027s eyes. Hold on to his hips with your hand. \n\nHim: Your job is a bit more difficult. Spread your legs with one leg inside her two legs and insert yourself in between her legs put one arm underneath her raised leg and the hold on to her face with your other hand. \n\nWhy It Rocks: The scissor sex position spices up your sex life like nothing else can. It also tests both of your ability to be flexible.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/08/scissor-position.jpg", "category": "Man On Top"},{"title": "Missionary Sex Position", "content": "The missionary sex position is quite possibly the most popular sex position in the world. It is a man on the top move that is designed to get both partners closer to that precious O moment. But what is missionary sex position? How do you do the missionary sex position? Well, today we are going to help you out with nailing missionary style sex. And if you\u0027re wondering why it\u0027s called missionary, it has to do with the puritan notion behind this move. \n\nHer: Lie down on your back with your knees slightly bent and pulled up to your chest. Widen your hips enough for your man to fit completely between them.\n\nHim: Lie on top of your partner with your legs as wide as you can get them. Enter her from underneath and grind into her as you edge your way closer to that coveted moment. \n\nWhy It Rocks: Missionary style sex is always a good stand by for anyone who needs a few classic moves. It feels pretty good too. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/08/missionary-position.jpg", "category": "Man On Top"},{"title": "Jockey Sex Position", "content": "You don\u0027t have to weigh 130 pounds or less to be a jockey! The jockey sex position can turn your dream of being a jockey into a reality. Now, your lady friend probably wouldn\u0027t like to be called a horse, so leave that out of the equation, but don\u0027t hesitate to give her a little slap (if she likes it) on the behind to keep things going. The sex jockey position is sure to become a favorite for you both! Here\u0027s how you do it. \n\nHer: Lay down on your stomach with your body flat on the bed or another surface. Spread your arms out in front of you to cushion your head. \n\nHim: Climb on top of your lady friend like you\u0027re climbing on top of an award-winning race horse. Grab ahold of her cheeks and grind into her. Give her a smack here and there and have a good time. \n\nWhy It Rocks: It\u0027s a sex jockey position, what is not to love? Climb on top and give her an O, you\u0027ll both love this move!\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/07/jockey-sex-position.jpg", "category": "Man On Top"},{"title": "Flatiron Sex Position", "content": "Ever heard of the flatiron sex position? If you haven\u0027t then this is definitely one you\u0027ll want to add into your mix. The flatiron position is super-hot and unique. It\u0027s a great twist on your traditional doggie style sex moves. Looking for a new way to keep her attention and keep things hot? Then you will love this sexy man from behind position. \n\nHer: Lie on your stomach with a pillow underneath your hips. Spread your legs to towards the sides of your bed. Arch your lower back slightly and relax. \n\nHim: Climb on top of her from behind, entering her slowly. Keep your legs flesh together and grab ahold of her hips with one hand and brace yourself on the bed with the other. Pound it out until you both are screaming in pleasure.\n\nWhy It Rocks: The Flatiron sex position is a tantalizingly fun, energetic and super sultry. What\u0027s not to like about doggie style, after all?\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/07/flatiron-sex-position.jpg", "category": "Man On Top"},{"title": "Bumper Cars Sex Position", "content": "Beep Beep! Crash into each other with some super sweaty, sexy, and hot sex. The bumper cars sex position is hands down one of the most interesting positions you and your partner can get into. Those bumper cars at the local fair have nothing on this sex position. Try it out for a crazy sex position to try and add to your go-to moves. \n\nHer: Lie on your stomach with your legs spread out behind you. Perch yourself on your forearms like you\u0027re a sphinx. Back up to your man as he positions himself behind you. \n\nHim: Mirror your partner\u0027s moves. Lie on your stomach and spread your legs and then back up with your head looking the opposite direction. Put your legs over the back of your partner\u0027s legs. Grind it out until you both real in pleasure. \n\nWhy It Rocks: It\u0027s super unique and it is sure to get you both closer to that special point.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/07/Bumper-car-sex-position.jpg", "category": "Man On Top"},{"title": "Anvil Sex Position", "content": "Looking for an amazing G-spot position? Then the Anvil Sex Position is sure to fit your bill. Get intimate, up close in personal with your partner as you look intensely in one another\u0027s eyes. It\u0027s also one of the best positions for deep penetration! Get a taste of your favorite meal with this penetrating, pulsating, and delicious leg up sex position. Here\u0027s how to nail it. \n\nHer: Lie on your back and pull your legs all the way up to your breasts and hold your legs as he enters you from on top. Wrap your legs around his neck once he\u0027s on top. \n\nHim: Climb on top of your partner with your legs slightly spread and then penetrate your partner from above. Use your arms to support yourself on either side of your partner. \n\nWhy It Rocks: It\u0027s the best position for deep penetration! Can you say “g-spot”? You won\u0027t have to if you try this move. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/07/Anvil-sex-position.jpg", "category": "Man On Top"},{"title": "The Variant Yawning", "content": "So many sex positions are boring, overdone, and simply don\u0027t add anything new to your sex life. But the Variant Yawning position is nothing like that. Ladies love sensual sex positions, and with good reason, they give you both a more intimate sex session. And with this move you don\u0027t have to be some flexible athlete. You just have to pay attention to her cues and make her happy. So here\u0027s what you gotta do to nail it. \n\nHer: Lay on her back with a fluffy pillow cradling your head. Spread your legs and put your feet on your partner\u0027s shoulders. Grab ahold of his thighs and enjoy the ride. \n\nHim: Get on your knees in front of her while you crouch over her body. Lean forward enough so you can give her nice, sexy kisses. Spread your hips wide enough so you can thrust into her. \n\nWhy It Rocks: It isn\u0027t one of your standard male dominant sex positions. It\u0027s hot, sexy, and gets you both where you want to go.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/07/The-Variant-Yawning.jpg", "category": "Man On Top"},{"title": "The Love Train", "content": "You know how most dominant male sex positions make you think of Quakers having sex? Yeah, well this position won\u0027t. It\u0027s oh so delicious for both partners and it gives you something new to do in the bedroom. Who wouldn\u0027t want that? It isn\u0027t called the “Love Train” for nothing. And speaking of nuttin\u0027, here\u0027s what you have to do to get there… \n\nHer: Lay on your stomach, pressing your pubic bone into the surface of the bed. Stretch your hands out to the side of your body like a catus. Let him enter you from on top. \n\nHim: Lay on top of your lady sensually and as easily as possible. Don\u0027t belly flop on to her back, you could seriously injure her, ya freak. Position your hips so they align with hers and spread your legs a bit farther apart. Whisper into her ear as you slowly massage her with your male member. \n\nWhy It Rocks: It\u0027s a great twist on traditional dominant male sex positions. It gives you a chance to show her your best moves while you both enjoy the break from more acrobatic moves.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/07/The-Love-train.jpg", "category": "Man On Top"},{"title": "Second Posture of The Perfumed Garden", "content": "Have you ever had moments with your partner when you feel like time stops? If you haven\u0027t this man on top sex position is sure to get you there. The Second Posture of The Perfumed Garden sex position will get your toes to curl and your back to bend. Quite literally. Supposedly this man on top sex position is great for men with smaller than average penises, so it might be the right fit for you if you\u0027re looking for something to help get your partner to cross the bridge. Here\u0027s how you do it. \n\nHer: Lay on your back with your legs in the air. Grab onto your partner\u0027s hands and look into their eyes as they drill you into your bed. \n\nHim: Get on your knees and spread your legs as wide as you can as you enter your partner. Grab ahold of your lady\u0027s hands and use them to stabilize yourself as you thrust inside of her. \n\nWhy It Rocks: This man on top position is great for both partners because it infuses intimacy and pleasure at the same time. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/07/Second-Posture-of-The-Perfumed-Garden.jpg", "category": "Man On Top"},{"title": "The Wrap-around Butt-Grab", "content": "Want to get your ass grabbed? This position might be your favorite. If you\u0027re looking for sex positions with the man on top, then this is the one to try out. The Wrap Around Butt Grab is a great way to get a handful of flesh for both of you. This position leads with the man on top and with the woman letting her hands wander wherever they may fall. But don\u0027t be shy, this position will get you going to places you didn\u0027t know you could experience. Assume the position with these tips. \n\nHer: Lay down on your back with your feet fairly close together. Wrap your hands around your man\u0027s ass to get a handful of goodness. \n\nHim: Lay on top of her and put your legs on either side of her. Put your pelvis on top of your partner\u0027s pelvis and go to town. Use your hand to hold her head up and kiss her intimately. It will feel amazing. \n\nWhy It Rocks: This position is possibly one of the most intimate positions in our category. You get the closeness you crave without sacrificing the hotness of some of our more jackrabbit positions. It\u0027s so hot!\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The_Wrap_around_Butt_Grab-1.jpg", "category": "Man On Top"},{"title": "Arched Driver", "content": "You know those extremely flexible gymnasts who perform at the Olympics every few years? Yeah, this position is the only one we imagine they do. In our list of male dominant positions, this one takes the cake. Arched back, full access to all her best parts, and a fun take on man on top, what\u0027s not to like? Whether you\u0027re looking for a new position to try or have nothing better to do than spend a few hours in the ER post coital, you\u0027ll like this one. \n\nHim: Get on your knees, preferably on your bed or another soft surface. Thrust your pelvis forward and into your partner as her legs rest on your shoulders. \n\nHer: Become a gymnast. No really, brace your shoulders on your bed with your head cushioned by a pillow. Arch your back and thrust your hips forward into your partner\u0027s member. \n\nWhy It Rocks: If you want to add some male dominant positions to your sexual repertoire, this one\u0027s a goody. Men, you can pleasure your partner as she arches her back and ladies, you get a good once over while arched in a pretzel like shape. But hey, you burn extra calories too.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/Arched-back.jpg", "category": "Man On Top"},{"title": "Back Bend Humping Like A Dog", "content": "There\u0027s nothing like having a whole roster of sexual positions to impress your woman. Luckily, the back bend humping like a dog position is sure to please both you and your woman. And if your lady happens to be a gymnast, well, bonus points! You\u0027ll both enjoy this position. \n\nHim: Bend down on your knees on a nice soft area, like a bed or some other soft surface. Put your partner\u0027s legs up on your shoulders and lean back slightly while thrusting your hips forward. Hold on to your partner\u0027s hips and get down. \n\nHer: Place your legs on your partner\u0027s shoulders and brace your own shoulders on the bed below you. Stabilize yourself on your bed with your arms and let the motion of the ocean take you to happy town. \n\nWhy It Rocks: It\u0027s fun, unique, and one of our top sexual positions to impress your woman. Get to work on those biceps, though, you\u0027re going to need them to pull this one off. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/She_Does_A_Back_Bend_He_is_Humping_Like_A_Dog-1.jpg", "category": "Man On Top"},{"title": "Seventh Posture Of The Perfumed Garden", "content": "Looking for some new sex positions to impress your woman? If so, the Seventh Posture of the Perfumed Garden is a great one to add to your list. It\u0027s hot, it\u0027s sensual, and it sounds like something out of Ancient Greece. And, well, it kinda is. Prepare to be intimate with your partner, this position demands it. Here\u0027s how you plow your partner like a Greek God. \n\nHer: Lay down on your bed on your side, either side is your choice. Spilt your legs in half, with one of your legs resting on your partner\u0027s shoulder. Brace yourself with your arm and let him lead the way. \n\nHim: Slide in between your partner\u0027s legs. Get on your knees with your legs on either side of her legs. Grab ahold of her leg as it rests on your shoulder and use it to grind into her. \n\nWhy It Rocks: It rocks because you\u0027re up close and personal with one another. It\u0027s ideal if you\u0027re looking for new sex positions to impress your woman. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/Seventh_Posture_Of_The_Perfumed_Garden-1.jpg", "category": "Man On Top"},{"title": "The Modified Winged Eros", "content": "You don\u0027t have to look far in our selection to find the best dominant male sex positions. Every time you have sex it should be better than the last, at least that\u0027s our motto. This position is particularly hot. It\u0027s animalistic. It looks like the same exact position wild wolves would get into to get crazy. Here\u0027s how you do it to make your woman howl like a wounded animal. \n\nHer: Get on your bed on her hands and knees. Spread your legs and arch your back. Lay back and enjoy the ride. \n\nHim: Climb up behind your partner with your legs laying over top your partner\u0027s legs. Enter her from behind her. Brace yourself with your hands on either side of her body on the bed. Arch over her body with your back curving inward. \n\nWhy It Rocks: The best dominant male sex positions are the sweatiest, or at least that\u0027s what we believe. The Modified Winged Eros gets you both to that ultra-sweet spot.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The-Slightly-Modified-Winged-Eros.jpg", "category": "Man On Top"},{"title": "Traction Control", "content": "Want to try out a position that kind of looks like a workout routine? If so, then Traction Control is a good choice. Traction Control makes its way onto our list of male dominating sex positions because it\u0027s all about the man. But that doesn\u0027t mean the ladies don\u0027t get some killer oh and ah moments from “Traction Control.” It\u0027s a dual pleasure position that anyone can do. \n\nHer: Get on your knees on the bed with your hips arched upwards. Allow one leg to fall slightly off the bed, to make it easier on your man to enter you from behind. Let him grab one of your arms once he gets into position. \n\nHim: Climb up behind your lady with your knees slightly agape. Hold onto her hip with one hand and grab her hand with your other. Allow one leg to fall off the bed behind hers. Get going and take things to climax town. \n\nWhy It Rocks: Male dominating sex positions don\u0027t have to be boring. This sex position is a perfect example of that. It\u0027s sexy, animalistic, and makes great angles easy.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The-Traction-Control-Position-1.jpg", "category": "Man On Top"},{"title": "The New Mattress", "content": "Is there anything better than a brand new mattress? Maybe breaking one in. This sex positions with the man on top will definitely have you breaking in your mattress as fast as you can say, “go to the bedroom.” The good news is, you don\u0027t have to be a porn star to master this position. Just a good mattress and a partner (or blow up doll) is all you need. \n\nHer: Lay down on your back with one arm over your head and one arm grabbing onto your partner. Lift one knee up to your chest with your other leg straight. Let him work his magic and encourage him with soft moans—he\u0027ll love it!\n\nHim: Climb on top (this is a list of sex positions with the man on top, after all) with one leg straight and one knee bent—matching her bent knee. Grind into her for some fun time. \n\nWhy It Rocks: The New Mattress gives you easy access to the best parts of your partner and makes it easy to hit her g-spot. It\u0027s so hot!\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The-New-Mattress-Position-1.jpg", "category": "Man On Top"},{"title": "The Ice Sculpture aka Double SowCow", "content": "You don\u0027t have to be Scott Hamilton (Olympic Gold Medalist) to nail this man on top position. It\u0027s got all the bells and whistles you could want from a sex position. It\u0027s easy to get into this position, it is perfect for angling towards the g-spot, and it looks amazing for the man in the duo. Oh, and it\u0027s got a cute name, what\u0027s not to love? \n\nHer: Get on your hands and knees on your bed. Lift your back leg up like you\u0027re doing kicks at the gym to work out that tight ass. Grind back on your man and get busy on his member. \n\nHim: Get on your knees behind your partner and hold on to her back leg. Thrust into her body as she grinds back into you. \n\nWhy It Rocks: This man on top position lets you both get involved with sex in a whole new way. It\u0027s a great twist on the traditional doggie style position and it feels a-ma-zing!\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The-Ice-Sculpture-Position-aka-Double-SowCow-1.jpg", "category": "Man On Top"},{"title": "The Bad Doggy", "content": "Male dominant sex positions can be so boring sometimes. That\u0027s why we added this super feel-good position to our man-on-top category. This is one of those positions you do halfway through your sensual love making session and you\u0027re on the brink of exploding in all the best ways. For both of you, this position gives you the edge to reach that high point we are all after. Here\u0027s how you execute The Bad Doggy. \n\nHer: Get on your knees, kind of like a dog (as long as you feel comfortable, of course). Spread your hips wide and lean forward, bracing yourself on the edge of your couch. Keep yourself loose and open as your partner enters you from behind. \n\nHim: Bend down on to your knees behind her. Parallel her legs with your own. Use your hands to brace yourself and slightly thrust into her until you are both barking like the bad dogs you are. \n\nWhy It Rocks: Doggy style is the best. It feels the best, it looks the best, and it lets the best things happen. When it comes to male dominant sex positions, there aint nothing better.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The-Bad-Doggy-Position-1.jpg", "category": "Man On Top"},{"title": "Deep Stick", "content": "Looking for the best sex positions for deep penetration? If so, we\u0027ve got your back. The deep stick sex position is a great way to pin your partner with pleasure in all the best ways. Other sexual positions for deep penetration miss one vital component: connection. But not this one. It gets you both back in touch with one another, which makes it a great position for long-term partners. Here\u0027s how you stick the landing and get it right the first time. \n\nHer: Lay on your back with your legs up in the air as far as you can get them or on top of your man\u0027s shoulders. Rock your hips up towards the sky, rather than leaving them flat on the bed. \n\nHim: Get down on your knees in front of your female friend and spread your hips slightly wide. Lean forward over her and use your arms to get good leverage to amp up your thrust game. \n\nWhy It Rocks: This position rocks because it\u0027s a great way to get deep penetration for both partners. Deep penetration is ideal for earth shattering orgasms. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/An_Acrobatic_Anal_Sex_Position-1.jpg", "category": "Man On Top"},{"title": "First Posture of the Perfumed Garden", "content": "Looking for new sex positions to impress your woman? You\u0027re not alone, buddy. We\u0027ve covered quite a few positions of the perfumed garden, but this one might blow them all out of the water. It\u0027s super sensual and sure to please her need to get intimate with you. Oh, and it makes it very easy to get yourself to that coveted happy place too. Here\u0027s how you execute. \n\nHer: Let her lay on her back on that soft, cushiony bed you bought her. Have her bend her knees up to her chest with her legs spread. Let her wrap her arms around your neck to stabilize herself from all the motion of your ocean. \n\nHim: Squat down in front of her with your hips spread out enough between her legs to enter her. Rest your hands on either side of her body and get moving, she\u0027s going to expect some great thrusting out of this move. \n\nWhy It Rocks: It\u0027s intimate, it\u0027s hot, and it\u0027s a new sex position to impress your woman right from the start. A twist on a traditional move, it is sure to please both of you. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/First-Posture-of-the-Perfumed-Garden-1.jpg", "category": "Man On Top"},{"title": "Eleventh Posture Of The Perfumed Garden", "content": "Listen guys, it isn\u0027t easy for women to have an orgasm. Some male dominating sex positions make it even more difficult to achieve. But the Eleventh Posture of the Perfumed Garden is different. It gives you both the edge to thoroughly enjoy your experience. The grinding, turning, thrusting and panting is enough to push anyone over the edge. So give her your best, with this killer male dominant sex position. \n\nHer: Have her lay completely flat on her back with her legs slightly tucked into together. She will naturally wrap her arms around you as you begin to give her unmeasurable pleasure. \n\nHim: Climb on top of her and lay flat out on top with your hands cradling her head, kissing her ever so softly. Widen your hips slightly to make it easier to move in and out of her. \n\nWhy It Rocks: This is one of those male dominating sex positions you both will love. It makes love making so much more intimate and gives you something different from the average dude on top position. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/Eleventh-Posture-Of-The-Perfumed-Garden-Touching-Soles-1.jpg", "category": "Man On Top"},{"title": "Doggy Style", "content": "Doggy style sex positions seem to be a dime a dozen, but this doggie style sex position is sure to please every member of your screw session. Wondering how to do the doggy style sex position? If so, this move is a good place to start. So pull out your leashes and collars, this doggy style sexual position will get you both ready to fetch. \n\nHer: Get on your hands and knees, kind of like a dog but with more dignity. Spread your legs hip width across and brace yourself for impact from behind you. \n\nHim: Straddle your lady\u0027s hips with one of your legs on the outside of one of her legs. Slightly open your hips and begin to go doggy style on her from behind. Hold onto her hips to brace yourself and keep things moving in the right direction. \n\nWhy It Rocks: Doggy style sex positions are the best. They give the lady some amazing angles to work with and give the man some super hot and sexy views to work with.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/doggie-style.jpg", "category": "Man On Top"},{"title": "Lying Down Anal Sex", "content": "Finding good anal sex positions can be a pain in the you know what. But when you do find one, it\u0027s like a light at the end of the tunnel. Lucky for you, we have assembled the best anal sex positions for beginners and experienced folks alike. One of our favorite positions for beginners is the Lying Down Anal Sex move. It allows you both to relax if you haven\u0027t done anal before, and it provides pretty easy access to that region of her body. Here\u0027s the best way to do this position. \n\nHer: Lay down flat on your stomach with your legs flat on the bed. Turn your head slightly to one side. Place your hands out in front of you. \n\nHim: Lay on top of your partner with your legs straddling her on both sides. Enter her while on top and press your arms over her arms to keep her calm. Listen to her cues and enjoy the ride. \n\nWhy It Rocks: It\u0027s hot, easy to do, and helps you both relax. No pressure, all pleasure. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2014/11/A_Lying_Down_Anal_Sex_Position2-2.jpg", "category": "Anal, Man On Top"}]}