{
    "table": "Positions",
    "positions": [
        {
            "title": "Scissor",
            "translateTitlePL": "Nożyce",
            "content": "Scissor your way into place for cock-to-vaginal penetration you\u0027ll never forget.\n\nThe scissors sex position is a unique take on a time-old lesbian way of love-making. With the scissoring sex position, connect your bodies at the middle as you do the dirty act until both parties are cumming:\n\nHim: As your woman lays on her back, snuggle your way in-between her legs with your one leg beneath her, and the other leg on top of her. Use your left arm to stabilize your torso as you wiggle your cock into her vagina.\n\nHer: Lay on your back, with your legs bent at your knees. Place your right leg on top of your man, and the left leg below him. Spread them wide to provide him with plenty of penetration room.\n\nWhy It Rocks: The sex position of scissoring provides both parties with the ability to intimately connect in the middle. Wiggle around until you get it just right – and trust us, you\u0027ll know when that happens.\n",
            "translateContentPL": "Pozycja “nożyce” to wyjątkowe podejście do odwiecznego lesbijskiego sposobu uprawiania miłości. W pozycji “nożyce” połączcie swoje ciała na środku, aż obie strony dojdą.\n\nOn: Gdy Twoja kobieta leży na plecach, wsuń się między jej nogi, jedną nogę kładąc pod nią, a drugą na niej. Użyj lewego ramienia, aby ustabilizować tułów podczas wsuwania penisa do jej pochwy.\n\nOna: Połóż się na plecach, z nogami zgiętymi w kolanach. Połóż prawą nogę na swoim mężczyźnie, a lewą pod nim. Rozłóż je szeroko, aby zapewnić mu dużo miejsca na penetrację.\n\nDlaczego warto?: Pozycja “nożyce” zapewnia obu stronom możliwość intymnego połączenia się w środku. Poruszaj się, aż osiągniesz właściwy efekt - i zaufaj nam, będziesz wiedział, kiedy to się stanie.\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/224.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Prone Bone",
            "translateTitlePL": "Prone Bone",
            "content": "The prone bone sex position is a great way to take your lover from behind while still making it comfortable and intimate. With prone bone sex, you can even make it your own with a little customization. Here\u0027s how to do it:\n\nHim: Wait for your woman to lay down as you spread your legs and gently sit on the back of her upper thigh. Stabilize yourself by grabbing her love handles as you spread her ass cheeks and sink your dick deeply into her warm and inviting pussy.\n\nHer: Lay down on your stomach, with your arms in front of you for stabilization. That\u0027s it! It\u0027s up to your man to position himself correctly behind you for perfect penetration.\n\nWhy It Rocks: The prone sex position is a great way to connect with just a flat surface or bed available. With prone bone sex, take your time to really position yourself correctly so that it feels amazing for all parties involved.\n",
            "translateContentPL": "Ta pozycja to świetny sposób na penetrację partnerki od tyłu, jednocześnie zapewniając wygodę i intymność. Możesz nawet dostosować ją do własnych potrzeb. Oto jak to zrobić:\n\nOn: Poczekaj, aż Twoja kobieta się położy, a Ty rozłóż nogi i delikatnie usiądź na tylnej części jej ud. Ustabilizuj się, chwytając partnerkę, rozsuń jej pośladki i zatop penisa głęboko w jej ciepłej i zachęcającej pochwie.\n\nOna: Połóż się na brzuchu, z rękami przed sobą dla stabilizacji. To wszystko! Od Twojego mężczyzny zależy to, aby prawidłowo ustawić się za Tobą w celu idealnej penetracji.\n\nDlaczego warto?: Podczas seksu poświęćcie trochę czasu na prawidłowe ułożenie się, a oboje doznacie niesamowitej przyjemności.\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/143.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Lazy Dog",
            "translateTitlePL": "Leniwy Pies",
            "content": "If you\u0027ve had a long day and want to take it from behind, the Lazy Dog Sex Position is an easy and cum-filled experience waiting for you.\n\nWe all know how tiring our days can be, which is why the Lazy Dog Sex Position is an easy way to plow from behind and scream into the night. The lazy dog sex act is actually how it sounds, and you\u0027re going to love it once you try it.\n\nHim: What guy doesn\u0027t love doggystyle sex? Aim over your woman as she lays on her stomach and use your left hand to support her abdomen underneath you. Balancing with your right hand, plow deep into her warm and open pussy while she waits for you to make sweet love.\n\nHer: Lay flat and forward, with your arms support your head and neck upwards. That\u0027s it! The rest is up to your man, and if you love taking it from behind, this is a lazy way to easily cum without doing very much at all.\n\nWhy It Rocks: Sometimes, we all need a lazy out, even if we\u0027re feeling super horny. This is a sex position everyone can do in a bed, or even on a floor. For the ladies, you really have to do nothing, while your man lights up your world.\n",
            "translateContentPL": "Jeśli miałeś długi dzień, pozycja seksualna leniwego psa jest łatwym i pełnym przyjemności doświadczeniem, które czeka na Ciebie. Wszyscy wiemy, jak męczące mogą być nasze dni, dlatego pozycja seksualna leniwego psa jest łatwym sposobem na penetrację od tyłu. Seks na leniwego psa brzmi tak, jak brzmi i pokochasz go, gdy tylko go wypróbujesz.\n\nOn: Który facet nie uwielbia seksu na pieska? Wyceluj w swoją kobietę, gdy leży na brzuchu i użyj lewej ręki, aby podeprzeć jej brzuch. Balansując prawą ręką, zanurz się głęboko w jej ciepłej i otwartej pochwie.\n\nOna: Połóż się płasko na brzuchu, z rękami wspierającymi głowę i szyję. To wszystko! Reszta zależy od Twojego mężczyzny. Jest to leniwy sposób na łatwe dojście.\n\nDlaczego warto?: Jest to pozycja seksualna, którą każdy może wykonywać w łóżku, a nawet na podłodze. W przypadku kobiet, naprawdę nie musisz nic robić, podczas gdy Twój mężczyzna będzie rozświetlał Twój świat.\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/71.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Eagle",
            "translateTitlePL": "Orzeł",
            "content": "If you like deep, penetrative sex that leaves nothing to the imagination, get ready to fly like an eagle.\n\nThe Eagle Sex Position is a great way for couples to feel total, unadulterated, and pure penetration, digging deep until you both explode in a cumming scream.\n\nHim: The Eagle Position places you in a traditional military style pose, except this time, drilling down hard while you hover over your woman. Place your lady below you, with her legs pushed up and bent back. Give her some time to stretch into position as you ease your weight down, using her thighs to support you. Enter and get to work.\n\nHer: You get to lay on your back for this one. But, it does require some flexibility in the hamstrings region. Place your legs in the air and bend them back, using your man\u0027s weight to keep them back while he enters you.\n\nWhy It Rocks: This is a very easy sex position, taking the military pose to the next level, requiring just a flat service or bed to get it right. Get ready to dip deep.\n",
            "translateContentPL": "Jeśli lubisz głęboki, penetracyjny seks, który nie pozostawia nic dla wyobraźni, przygotuj się na latanie jak orzeł.\n\nPozycja Orła to świetny sposób dla par, aby poczuć całkowitą, niezafałszowaną i czystą penetrację.\n\nOn: Pozycja orła ustawia cię w tradycyjnej pozie wojskowej, z tym wyjątkiem, że tym razem “wwiercasz” się mocno, unosząc się nad swoją kobietą. Umieść swoją kobietę pod sobą, z nogami uniesionymi do góry i wygiętymi do tyłu. Daj jej trochę czasu na rozciągnięcie się do tej pozycji, używając jej ud do podparcia. Wejdź i zabierz się do pracy.\n\nOna: W tej pozycji możesz położyć się na plecach. Wymaga to jednak pewnej elastyczności w ścięgnach podkolanowych. Umieść nogi w powietrzu i zegnij je do tyłu, używając ciężaru swojego mężczyzny, aby je utrzymać, podczas gdy on wchodzi w Ciebie.\n\nDlaczego warto?: Jest to bardzo łatwa pozycja seksualna, przenosząca pozę wojskową na wyższy poziom, wymagająca jedynie płaskiej, twardej powierzchni lub łóżka.\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/163.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Deck Chair",
            "translateTitlePL": "Deck Chair",
            "content": "The Deck Chair Sex Position is a must try, deep penetration position that enables the man to assume control and go in, full access. Requiring a flat surface and nothing else, it can be performed anywhere – perhaps, even outside on your deck? Let\u0027s see how:\n\nHim: Bending your women essentially in half, facing you, enter her from above, holding her tight and open with your hands while her legs wrap around your back. Be sure to keep your balance on your knees so your entire weight is not crushing her.\n\nHer: Lay on your back, legs up in the air and spread, while your man enters you. Wrap your legs around his back and allow him to position himself for ultimate, deep penetrative access. Go slow with this one while he breaks you in.\n\nWhy It Rocks: If you have the right patience to go slow with the deck chair position, this can be one of the most deeply penetrative positions out there. With a little time in the beginning, get your rhythm down and thrust away your cares and worries.\n",
            "translateContentPL": "“Deck Chair” to pozycja głębokiej penetracji, która pozwala mężczyźnie przejąć kontrolę i wejść do środka, z pełnym dostępem. Wymagająca płaskiej powierzchni i niczego więcej, może być wykonywana w dowolnym miejscu - być może nawet na zewnątrz na tarasie? Zobaczmy, jak to zrobić:\n\nOn: Zginając swoją kobietę zasadniczo na pół, twarzą do siebie, wejdź w nią od góry, trzymając ją mocno, podczas gdy jej nogi owijają się wokół Twoich pleców. Upewnij się, że utrzymujesz równowagę na kolanach, aby nie przygniatać jej całym swoim ciężarem.\n\nOna: Połóż się na plecach, nogi uniesione w powietrzu i rozłożone, podczas gdy Twój mężczyzna wchodzi w Ciebie. Owiń nogi wokół jego pleców i pozwól mu ustawić się w pozycji umożliwiającej głęboką penetrację.\n\nDlaczego warto?: Jeśli masz odpowiednią cierpliwość, może to być jedna z najgłębiej penetrujących pozycji. Przy odrobinie czasu na początku, złap rytm i odrzuć swoje troski i zmartwienia.\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/328.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Cat",
            "translateTitlePL": "Kot",
            "content": "You might be asking yourself: what is the cat position? This unique sex pose is essentially the opposite of the military sex position, placing the man\u0027s legs to the outside of the women\u0027s while he works his way into her. If you\u0027re interested in learning more about the Cat Sex Position, follow with us below:\n\nHim: The cat style position requires from flexibility on your end, as you lay on top of your woman, with your legs spread apart while hers fit snuggly between yours. This cat position requires some dexterity on your end to find the right angle to penetrate her without the convenience of her legs being spread apart.\n\nHer: What could be better than this pose? You can simply lay back and let the man to all of the work. Relax, close your eyes, and enjoy the ride, ladies!\n\nWhy It Rocks: This is an incredibly easy sex position for both parties to perform, requiring nothing but a bed or a surface. As for the ladies, you get to drift off into orgasmic heaven, never looking back!\n",
            "translateContentPL": "Być może zadajesz sobie pytanie: czym jest pozycja kota? Ta wyjątkowa pozycja seksualna jest zasadniczo przeciwieństwem wojskowej pozycji seksualnej, umieszczając nogi mężczyzny na zewnątrz kobiety, podczas gdy on w nią wchodzi. Jeśli chcesz dowiedzieć się więcej o pozycji seksualnej kota, podążaj za nami poniżej:\n\nOn: Pozycja w stylu kota wymaga elastyczności z Twojej strony, ponieważ leżysz na swojej kobiecie, z rozłożonymi nogami, podczas gdy jej nogi ściśle przylegają do Twoich. Ta pozycja wymaga pewnej zręczności po Twojej stronie, aby znaleźć odpowiedni kąt do penetracji.\n\nOna: Co może być lepszego niż ta pozycja? Możesz po prostu położyć się i pozwolić mężczyźnie wykonać całą pracę. Zrelaksuj się, zamknij oczy i ciesz się penetracją!\n\nDlaczego warto?: Jest to niezwykle łatwa do wykonania pozycja seksualna dla obu stron, nie wymagająca niczego poza łóżkiem lub twardą powierzchnią. Jeśli chodzi o Panie, możesz odpłynąć w orgazmiczne niebo, nie oglądając się za siebie!\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/3.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Cancer",
            "translateTitlePL": "Rak",
            "content": "As a classic sex position on the stomach, the Cancer Sex Position is a more intimate and deeper penetrating version of doggystyle, with a closer embrace and deeper sex than other sex positions today. If you\u0027re ready to really immerse yourself in luxurious sexual pleasure, here\u0027s how:\n\nHim: This is an incredibly easy and comfortable sex position for you, requiring you to do nothing but plow from behind, using your hands as stabilization since you will be on all fours. Place your left leg inside her two legs, and your right leg to the outside. Get your balance, and go to town.\n\nHer: If you like easy sex positions that enable you to lay down, then the Cancer Sex Position is a perfect sex position for you! Simply lay down, bend your knees, and place your calves into the air. Hold the bed in front of you, sit back, and let the love making ensue.\n\nWhy It Rocks: This is a pleasurable sex position that is easy for any kind of lover to achieve. All you need is a bed, or even a surface, and some hot, steamy passion while you ride out the night.\n",
            "translateContentPL": "Jako klasyczna pozycja seksualna na brzuchu, pozycja raka jest intymną i głęboko penetrującą pozycją. Jeśli jesteś gotowy, aby naprawdę zanurzyć się w luksusowej przyjemności, oto jak to zrobić:\n\nOn: Jest to niewiarygodnie łatwa i wygodna pozycja seksualna dla Ciebie, wymagająca od Ciebie jedynie użycia rąk do stabilizacji, ponieważ będziesz na czworaka. Umieść prawą nogę wewnątrz jej nóg, a lewą na zewnątrz.\n\nOna: Jeśli lubisz łatwe pozycje seksualne, które pozwalają Ci się położyć, to pozycja seksualna raka jest idealna dla Ciebie! Po prostu połóż się, zegnij kolana i unieś łydki w powietrze. Przytrzymaj łóżko przed sobą i daj się ponieść miłosnym igraszkom.\n\nDlaczego warto?: Jest to przyjemna pozycja seksualna, która jest łatwa do osiągnięcia dla obu stron. Wszystko, czego potrzebujesz, to łóżko i trochę gorącej, parnej pasji podczas nocnej przejażdżki.\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/34.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Boat",
            "translateTitlePL": "Na Łodzi",
            "content": "This is a more complex sex position, requiring agility, flexibility, and patience from both partners involved in the dirty act. Although it might not look beautiful to a bystander, this classically “lazy sex position” still requires some clever movement to get it right. Here\u0027s how:\n\nHim: You\u0027re going to need a surface or blanket to grab onto as you take your woman from behind. With her legs spread, place your left leg between hers, and your right leg on the outside of her right leg. Angle yourself correctly, grab the blanket for balance, and go to town.\n\nHer: Lay down on your stomach, bend your legs at the knees, and spread them while the man angles himself into you. For the best feeling, position yourself at the edge of the bed so you can hold onto it for support while he enters you. Take this one slow, you\u0027ll want to enjoy it.\n\nWhy It Rocks: The Boat Sex Position feels amazing for both partners, as a deep sex position that with the right angle, can be otherworldly. For the best results, do it on top of a bed so you can hang in there.\n",
            "translateContentPL": "Jest to bardziej złożona pozycja seksualna, wymagająca zwinności, elastyczności i cierpliwości od obojga partnerów. Chociaż może nie wyglądać pięknie dla osoby postronnej, ta klasyczna “leniwa pozycja seksualna” nadal wymaga sprytnych ruchów, aby wykonać ją prawidłowo. Oto jak to zrobić:\n\nOn: Będziesz potrzebował jakiejś powierzchni lub koca, którego będziesz mógł się chwycić, gdy będziesz brał swoją kobietę od tyłu. Umieść lewą nogę między jej nogami, a prawą nogę po zewnętrznej stronie jej prawej nogi. Ustaw się pod odpowiednim kątem i chwyć koc dla równowagi.\n\nOna: Połóż się na brzuchu, zegnij nogi w kolanach i rozłóż je, podczas gdy mężczyzna ustawia się pod kątem. Aby uzyskać najlepsze wrażenia, ustaw się na krawędzi łóżka, abyś mogła się o nie oprzeć, podczas gdy on będzie w Ciebie wchodził.\n\nDlaczego warto?: Pozycja seksualna “na łodzi” jest niesamowita dla obojga partnerów, wykonana pod odpowiednim kątem może być nieziemska. Aby uzyskać najlepsze rezultaty, wykonaj ją na łóżku.\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/8.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Snow Angel",
            "translateTitlePL": "Śnieżny Anioł",
            "content": "Even in summer, you can be a snow angel! That\u0027s right, the snow angel sex position is a move anyone can add to their must-try list. I mean, maybe you shouldn\u0027t rush to it, because it is one of the more extreme sex positions, but it can get you closer to that sex god level. You don\u0027t have to be one yet to get it, but once you read about it you\u0027ll want to try it. Here\u0027s how to become a snow angel in the bedroom.\n\nHer: Lie on your back. Wrap your legs around your male partner\u0027s hips. Lean forward with your hands on his ass or lower back. Almost like you are doing an ab workout.\n\nHim: Lie on your stomach in the opposite direction of your partner. Scooch your hips back and over her hips and enter her from the opposite direction and on top. Let her wrap her legs around you and place your hands on your body. Get in sphinx pose with your forearms laying down in front of you.\n\nWhy It Rocks: The snow angel sex position is absolutely unique. You probably have never tried it before, but once you do it you\u0027ll learn that you can do more than you thought you could. Oh, and it feels great too!\n",
            "translateContentPL": "Nawet latem możesz być śnieżnym aniołem! Zgadza się, pozycja seksualna śnieżnego anioła to pozycja, którą każdy może dodać do swojej listy rzeczy do wypróbowania. To znaczy, może nie powinieneś się z nią spieszyć, ponieważ jest to jedna z bardziej ekstremalnych pozycji seksualnych, ale może przybliżyć Cię do poziomu boga seksu. Nie musisz jeszcze nim być, ale gdy tylko o tym przeczytasz, będziesz chciał spróbować. Oto jak zostać śnieżnym aniołem w sypialni.\n\nOna: Połóż się na plecach. Owiń nogi wokół bioder partnera. Pochyl się do przodu, kładąc dłonie na jego pośladkach lub dolnej części pleców. Prawie tak, jakbyś ćwiczyła brzuch.\n\nOn: Połóż się na brzuchu w kierunku przeciwnym do partnera. Przesuń biodra do tyłu, nad jej biodrami i wejdź w nią z przeciwnej strony od góry. Pozwól jej owinąć nogi wokół siebie. Przyjmij pozę sfinksa z przedramionami ułożonymi przed sobą.\n\nDlaczego warto?: Pozycja seksualna śnieżnego aniołka jest absolutnie wyjątkowa. Prawdopodobnie nigdy wcześniej jej nie próbowałeś, ale kiedy już to zrobisz, dowiesz się, że możesz zrobić więcej, niż myślałeś. Aha, i to też świetne uczucie!\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/364.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Missionary",
            "translateTitlePL": "Na Misjonarza",
            "content": "The missionary sex position is quite possibly the most popular sex position in the world. It is a man on the top move that is designed to get both partners closer to that precious O moment. But what is missionary sex position? How do you do the missionary sex position? Well, today we are going to help you out with nailing missionary style sex. And if you\u0027re wondering why it\u0027s called missionary, it has to do with the puritan notion behind this move.\n\nHer: Lie down on your back with your knees slightly bent and pulled up to your chest. Widen your hips enough for your man to fit completely between them.\n\nHim: Lie on top of your partner with your legs as wide as you can get them. Enter her from underneath and grind into her as you edge your way closer to that coveted moment.\n\nWhy It Rocks: Missionary style sex is always a good stand by for anyone who needs a few classic moves. It feels pretty good too.\n",
            "translateContentPL": "Pozycja misjonarska jest prawdopodobnie najpopularniejszą pozycją seksualną na świecie. Ale czym jest pozycja misjonarska? Jak wykonać pozycję misjonarską? A jeśli zastanawiasz się, dlaczego nazywa się ją misjonarską, ma to związek z purytańską ideą.\n\nOna: Połóż się na plecach z lekko ugiętymi kolanami. Rozszerz biodra na tyle, aby Twój mężczyzna mógł całkowicie zmieścić się między nimi.\n\nOn: Połóż się na partnerce z nogami rozstawionymi tak szeroko, jak to tylko możliwe. Wejdź w nią i penetruj, zbliżając się do tego upragnionego momentu.\n\nDlaczego warto?: Seks w stylu misjonarskim jest zawsze dobrym rozwiązaniem dla każdego, kto potrzebuje kilku klasycznych ruchów. To też całkiem niezłe uczucie.\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/67.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Jockey",
            "translateTitlePL": "Dżokej",
            "content": "You don\u0027t have to weigh 130 pounds or less to be a jockey! The jockey sex position can turn your dream of being a jockey into a reality. Now, your lady friend probably wouldn\u0027t like to be called a horse, so leave that out of the equation, but don\u0027t hesitate to give her a little slap (if she likes it) on the behind to keep things going. The sex jockey position is sure to become a favorite for you both! Here\u0027s how you do it.\n\nHer: Lay down on your stomach with your body flat on the bed or another surface. Spread your arms out in front of you to cushion your head.\n\nHim: Climb on top of your lady friend like you\u0027re climbing on top of an award-winning race horse. Grab ahold of her cheeks and grind into her. Give her a smack here and there and have a good time.\n\nWhy It Rocks: It\u0027s a sex jockey position, what is not to love? Climb on top and give her an O, you\u0027ll both love this move!\n",
            "translateContentPL": "Pozycja seksualna dżokeja może sprawić, że Twoje marzenie o byciu dżokejem stanie się rzeczywistością. Twoja partnerka prawdopodobnie nie chciałaby być nazywana koniem, więc pomiń to, ale nie wahaj się dać jej małego klapsa (jeśli to lubi) w tyłek. Pozycja dżokeja z pewnością stanie się ulubioną dla Was obojga! Oto jak to zrobić:\n\nOna: Połóż się płasko na brzuchu na łóżku lub innej powierzchni. Rozłóż ręce przed sobą, aby podeprzeć głowę.\n\nOn: Wespnij się na swoją partnerkę jak na utytułowanego konia wyścigowego. Chwyć ją za policzki i wejdź w nią. Daj jej klapsa tu i tam i baw się dobrze.\n\nDlaczego warto?: To pozycja dżokeja, czego tu nie kochać?\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/155.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Flatiron",
            "translateTitlePL": "Flatiron",
            "content": "Ever heard of the flatiron sex position? If you haven\u0027t then this is definitely one you\u0027ll want to add into your mix. The flatiron position is super-hot and unique. It\u0027s a great twist on your traditional doggie style sex moves. Looking for a new way to keep her attention and keep things hot? Then you will love this sexy man from behind position.\n\nHer: Lie on your stomach with a pillow underneath your hips. Spread your legs to towards the sides of your bed. Arch your lower back slightly and relax.\n\nHim: Climb on top of her from behind, entering her slowly. Keep your legs flesh together and grab ahold of her hips with one hand and brace yourself on the bed with the other. Pound it out until you both are screaming in pleasure.\n\nWhy It Rocks: The Flatiron sex position is a tantalizingly fun, energetic and super sultry. What\u0027s not to like about doggie style, after all?\n",
            "translateContentPL": "Słyszałeś kiedyś o pozycji seksualnej Flatiron? Jeśli nie, to zdecydowanie jest to pozycja, którą będziesz chciał dodać do swojej kolekcji ulubionych. Pozycja Flatiron jest super gorąca i wyjątkowa. To świetna odmiana od tradycyjnych pozycji w stylu pieska. Szukasz nowego sposobu na przyciągnięcie jej uwagi i utrzymanie gorącej atmosfery? W takim razie pokochasz tę seksowną pozycję od tyłu.\n\nOna: Połóż się na brzuchu z poduszką pod biodrami. Rozłóż nogi w kierunku boków łóżka. Lekko wygnij dolną część pleców i rozluźnij się.\n\nOn: Wespnij się na nią od tyłu, wchodząc w nią powoli. Trzymaj nogi złączone i chwyć jej biodra jedną ręką, a drugą podeprzyj się na łóżku. Penetruj ją tak długo, aż oboje będziecie krzyczeć z rozkoszy.\n\nDlaczego warto?: Pozycja seksualna Flatiron jest kusząco zabawna, energiczna i super zmysłowa. W końcu czego nie lubić w pozycji na pieska?\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/95.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Anvil",
            "translateTitlePL": "Anvil",
            "content": "Looking for an amazing G-spot position? Then the Anvil Sex Position is sure to fit your bill. Get intimate, up close in personal with your partner as you look intensely in one another\u0027s eyes. It\u0027s also one of the best positions for deep penetration! Get a taste of your favorite meal with this penetrating, pulsating, and delicious leg up sex position. Here\u0027s how to nail it.\n\nHer: Lie on your back and pull your legs all the way up to your breasts and hold your legs as he enters you from on top. Wrap your legs around his neck once he\u0027s on top.\n\nHim: Climb on top of your partner with your legs slightly spread and then penetrate your partner from above. Use your arms to support yourself on either side of your partner.\n\nWhy It Rocks: It\u0027s the best position for deep penetration! Can you say “g-spot”? You won\u0027t have to if you try this move.\n",
            "translateContentPL": "Szukasz niesamowitej pozycji seksualnej? W takim razie “Anvil” z pewnością spełni Twoje oczekiwania. Jest to również jedna z najlepszych pozycji do głębokiej penetracji! Zasmakuj obłędnego seksu dzięki tej penetrującej, pulsującej i pysznej pozycji seksualnej z nogami w górze. Oto jak to zrobić:\n\nOna: Połóż się na plecach i podciągnij nogi aż do piersi, a następnie je przytrzymaj, gdy on wejdzie w Ciebie od góry. Owiń nogi wokół jego szyi, gdy już będzie na górze.\n\nOn: Wespnij się na partnerkę z lekko rozłożonymi nogami, a następnie penetruj ją od góry. Użyj rąk, aby podeprzeć się po obu stronach partnerki.\n\nDlaczego warto?: To najlepsza pozycja do głębokiej penetracji!\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/115.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Doggy Style",
            "translateTitlePL": "Na Pieska",
            "content": "Doggy style sex positions seem to be a dime a dozen, but this doggie style sex position is sure to please every member of your screw session. Wondering how to do the doggy style sex position? If so, this move is a good place to start. So pull out your leashes and collars, this doggy style sexual position will get you both ready to fetch.\n\nHer: Get on your hands and knees, kind of like a dog but with more dignity. Spread your legs hip width across and brace yourself for impact from behind you.\n\nHim: Straddle your lady\u0027s hips with one of your legs on the outside of one of her legs. Slightly open your hips and begin to go doggy style on her from behind. Hold onto her hips to brace yourself and keep things moving in the right direction.\n\nWhy It Rocks: Doggy style sex positions are the best. They give the lady some amazing angles to work with and give the man some super hot and sexy views to work with.\n",
            "translateContentPL": "Pozycji seksualnych w stylu na pieska wydaje się być kilkanaście, ale ta pozycja na pieska z pewnością Was zadowoli. Zastanawiasz się, jak wykonać pozycję seksualną na pieska? Wyciągnij smycze i obroże, ta pozycja seksualna sprawi, że oboje będziecie gotowi do aportowania.\n\nOna: Połóż się na rękach i kolanach, trochę jak pies, ale z większą godnością. Rozłóż nogi na szerokość bioder i przygotuj się na wejście od tyłu.\n\nOn: Lekko rozchyl biodra i zacznij na nią wchodzić od tyłu w stylu “na pieska”. Przytrzymaj się jej bioder, aby się ustabilizować i utrzymać wszystko we właściwym miejscu.\n\nDlaczego warto?: Pozycje seksualne w stylu na pieska są najlepsze. Dają kobiecie niesamowite wrażenia, a mężczyźnie dają super gorące i seksowne widoki.\n",
            "category": "Man On Top",
            "translateCategoryPL": "Mężczyzna na górze",
            "URL": "https://sexpositions.club/positions/140.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Swing",
            "translateTitlePL": "Seks-huśtawka",
            "content": "The swing sex position is an easy-to-achieve state of bliss that requires nothing but a little balance from the woman. Lay down, close your eyes, and allow yourself to drift off in pure bliss:\n\nHim: You get to just lay there, completely flat, with your feet out in front of you. Get ready to stabilize your woman as she sits down on top of you, facing away, riding your dick dirty until you scream.\n\nHer: After your man lays down, to get the sex swing position just right, step down on either side of him, facing away, and ease yourself onto his dick. Once there, place one foot down between his legs, and the other on the bed. Get your stability before you start thumping.\n\nWhy It Rocks: This is a user-friendly reverse style sex position that is a great introductory into the world of fucking while sitting. Take our word for it!\n",
            "translateContentPL": "“Seks-huśtawka” to łatwy do osiągnięcia stan błogości, który wymaga od kobiety jedynie odrobiny równowagi. Połóż się, zamknij oczy i pozwól sobie odpłynąć w czystej błogości.\n\nOn: Możesz po prostu leżeć, całkowicie płasko, z nogami wyciągniętymi przed siebie. Przygotuj się, aby ustabilizować swoją kobietę, gdy usiądzie na Tobie, ujeżdżając Twojego penisa, aż będziesz krzyczeć.\n\nOna: Po tym, jak Twój mężczyzna się położy, aby uzyskać właściwą pozycję huśtawki seksualnej, umieść jedną stopę między jego nogami, a drugą na łóżku. Uzyskaj stabilność, zanim zaczniesz się huśtać.\n\nDlaczego warto?: Jest to przyjazna pozycja seksualna w odwróconym stylu, która jest świetnym wprowadzeniem do świata seksu na siedząco. Uwierz nam na słowo!\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/15.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Cowgirl",
            "translateTitlePL": "Na jeźdźca",
            "content": "Get ready to ride each other wild as you saddle up for the adventure of a lifetime.\nThe riding sex position is a great way to stare into each other\u0027s eyes, enjoy and view, and sink into deep and meaningful penetration on top. As one of the best sex positions for women on top, here\u0027s how to make it happen:\n\nHim: Lay back with your arms and legs spread as your place your head on the bed. Crane your head slightly up and stabilize yourself with your feet dug into the blankets as you get ready to thrust deeply in an upward fashion into your woman.\n\nHer: Do you know how to ride during sex? You\u0027re about to find out. Once your man assumes position, spread your legs and sit down on him, facing him, as you gently lower your pussy onto his cock. Once in position, get ready to thrust right alongside him.\n\nWhy It Rocks: This sex position provides every woman with serious control while she goes for the ride of her life on a totally exposed and accessible cock. Men, get ready for an awesome view as her tits bounce up and down during the pounding.\n",
            "translateContentPL": "Przygotuj się na dziką jazdę na siodełku. Pozycja seksualna na jeźdźca to świetny sposób, aby wpatrywać się sobie w oczy, cieszyć się widokiem i zatopić się w głębokiej i znaczącej penetracji. Jest to jedna z najlepszych pozycji seksualnych na górze dla kobiet, a oto jak ją wykonać:\n\nOn: Połóż się na plecach z rozłożonymi rękami i nogami, kładąc głowę na łóżku. Podnieś głowę lekko do góry i ustabilizuj się ze stopami wbitymi w łóżko, przygotowując się do głębokiego pchnięcia w górę w swoją kobietę.\n\nOna: Gdy Twój mężczyzna przyjmie pozycję, rozłóż nogi i usiądź na nim, twarzą do niego, delikatnie opuszczając pochwę na jego penisa. Po zajęciu pozycji, przygotuj się na głęboką penetrację.\n\nDlaczego warto?: Ta pozycja seksualna zapewnia każdej kobiecie kontrolę, podczas przejażdżki swojego życia na całkowicie odsłoniętym i dostępnym penisie. Mężczyźni, przygotujcie się na niesamowity widok, gdy jej cycki będą podskakiwać w górę i w dół podczas seksu!\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/113.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Gemini",
            "translateTitlePL": "Gemini",
            "content": "Lay back, hands spread for support, and go at each other in the center, bodies connected as one in the Gemini Sex Position.\nThis is one of those lovemaking positions that provides direct eye contact and total control for both parties as they meet as one in the center, conjoined for ultimate pleasure. Because of its sex control, it\u0027s an easy way to reach an orgasm.\n\nHim: This golden gate sex position is comfortable for you, as you sit down, hands behind you for support, and legs spread mildly so your woman can fit inside. Get ready to angle your body just right so she\u0027s feeling maximum pleasure.\n\nHer: After your man is in place, ease onto him with your legs bent at the knee and spread around him. Use your hands to support your back and rest the remainder of your weight on the bed where his cock enters your body.\n\nWhy It Rocks: If you love to watch your partner scream while they orgasm, this lovemaking position provides the perfect control and vantage point. Plus, little flexibility is required!\n",
            "translateContentPL": "Jest to jedna z tych pozycji miłosnych, która zapewnia bezpośredni kontakt wzrokowy i całkowitą kontrolę dla obu stron. Ze względu na kontrolę nad seksem jest to łatwy sposób na osiągnięcie orgazmu.\n\nOn: Ta pozycja seksualna jest wygodna dla Ciebie, ponieważ siedzisz, ułóż ręce za sobą dla wsparcia, a nogi lekko rozłóż przed sobą, aby Twoja kobieta mogła zmieścić się w środku. Przygotuj się na odpowiednie nachylenie ciała, aby poczuła maksymalną przyjemność.\n\nOna: Gdy Twój mężczyzna jest już na swoim miejscu, połóż się na nim z nogami zgiętymi w kolanach i rozłożonymi wokół niego. Użyj rąk, aby podeprzeć plecy i oprzyj resztę ciężaru na łóżku w miejscu, w którym jego penis wchodzi w Twoją pochwę.\n\nDlaczego warto?: Jeśli uwielbiasz patrzeć, jak Twój partner krzyczy podczas orgazmu, ta pozycja miłosna zapewnia idealną kontrolę i punkt obserwacyjny. Ponadto wymagana jest niewielka elastyczność!\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/242.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Crouching Tiger",
            "translateTitlePL": "Przyczajony Tygrys",
            "content": "Ready to bring out your crouching tiger, hidden dragon? This is an exposing and intimate position that enables for parties to deeply connect, facing each other, gazing into one another\u0027s sex eyes while the dirty deed is done. Here\u0027s how to do the Crouching Tiger Sex Position right:\n\nHim: You get to lay down with the crouching tiger position, which makes it an awesome position for you. Lay down, legs slightly spread, ready to receive your queen. This is also a great breast viewing position for you, so get ready for the show.\n\nHer: Facing your man, spread your legs apart on either side of him and bend your knees, slowly lowering yourself onto him. Place your hands on his thighs for support, while he holds your knees, and get ready to ride him into the sunset.\n\nWhy It Rocks: If you\u0027re ready to get down, close, and intimate with your partner, this is an easy sex position that requires minimal flexibility. Although the woman does more of the heavy lifting, she is in control with regards to penetration so everyone is happy with the end result.\n",
            "translateContentPL": "Gotowy, aby wydobyć swojego przyczajonego tygrysa, ukrytego smoka? Jest to obnażająca i intymna pozycja, która umożliwia obu stronom głębokie połączenie. Oto jak prawidłowo wykonać pozycję Przyczajonego Tygrysa:\n\nOn: W pozycji przykucniętego tygrysa musisz się położyć, co sprawi, że będzie to niesamowita pozycja dla Ciebie. Połóż się z lekko rozłożonymi nogami, gotowy na przyjęcie swojej królowej. Jest to również świetna pozycja do oglądania piersi, więc przygotuj się na pokaz.\n\nOna: Stań twarzą do swojego mężczyzny, rozłóż nogi po obu jego stronach i ugnij kolana, powoli opuszczając się na niego. Połóż dłonie na jego udach dla wsparcia, podczas gdy on przytrzyma Twoje kolana i przygotuj się na ujeżdżanie go do zachodu słońca.\n\nDlaczego warto?: Jeśli jesteś gotowa na intymność ze swoim partnerem, jest to łatwa pozycja seksualna, która wymaga minimalnej elastyczności. Chociaż kobieta wykonuje większość ciężkiej pracy, ma kontrolę nad penetracją, więc wszyscy są zadowoleni z efektu końcowego.\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/40.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Cradle",
            "translateTitlePL": "Kołyska",
            "content": "If you\u0027re into sitting sex positions, then the Cradle Sex Position has got you covered. All you need is a flat surface and a wall for the man to lean up against as the woman is slowly lowered, in a sitting position, on her man for ultimate, deep, and alluring penetration. Here\u0027s how to make it happen\n\nHim: The Cradle Sex Position will provide you with the opportunity to demonstrate your strength and manliness as you will be entirely supporting your woman. Sit down, legs in front of you, with your back against the wall. All your woman to approach you, facing away, lowering herself legs spread onto you. Grab under her thighs and lift her up entirely onto you, holding on as you thrust.\n\nHer: Your man\u0027s got this one covered as he holds you from the lower thigh, facing away, while he goes to town. Reach around behind you and hold his back for support.\n\nWhy It Rocks: This is an easy sex position, if the man is up for some heavy lifting, for both parties and requires no furniture – just a back support the for man. As a deep, penetrative position, go slow to ensure everyone is ready for ultimate thrusts.\n",
            "translateContentPL": "Jeśli lubisz siedzące pozycje seksualne, to pozycja kołyski jest dla Ciebie. Wszystko, czego potrzebujesz, to płaska powierzchnia i ściana, o którą mężczyzna może się oprzeć, podczas gdy kobieta będzie powoli opuszczać się w pozycji siedzącej na swojego mężczyznę, aby uzyskać ostateczną, głęboką i kuszącą penetrację. Oto jak to zrobić:\n\nOn: Pozycja seksualna kołyski zapewni Ci możliwość zademonstrowania swojej siły i męskości, ponieważ będziesz całkowicie wspierać swoją kobietę. Usiądź, nogi przed sobą, plecami do ściany. Poproś swoją kobietę, aby zbliżyła się do Ciebie, odwracając się, opuszczając się na Ciebie z rozłożonymi nogami. Chwyć ją pod udami i podnieś ją całkowicie na siebie, przytrzymując podczas penetracji.\n\nOna: Sięgnij za siebie i chwyć jego plecy, aby uzyskać wsparcie.\n\nDlaczego warto?: Jest to łatwa, głęboka, penetracyjna pozycja seksualna, jeśli mężczyzna jest gotowy na podnoszenie ciężarów.\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/78.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Chair",
            "translateTitlePL": "Na krześle",
            "content": "It\u0027s time to get wild and crazy with that loveseat sitting in your living room. The Chair Sex Position is a perfect sex pose for couples looking to mix things up, taking it out of the bedroom and into other parts of the house. Chair sex can be crazy and adventurous, using the structure of the chair to spice up your sex life. Here\u0027s how:\n\nHim: This is quite possibly the most comfortable sex position you will ever assume as a man. All you have to do is sit down and lay back in the curves of the chair, legs slightly spread and ready for your woman. What could be better?\n\nHer: Once your man has sat down, sit down on top of him, facing away from him, with your legs between his. Lower yourself onto him according to your pleasure, and grab onto his face while he takes you for a chair sex spin.\n\nWhy It Rocks: This chair sex position is easy to do, requires no strength or agility, and can feel incredibly pleasurable, helping you to mix up things by adding in some furniture support.\n",
            "translateContentPL": "Pozycja seksualna na krześle to idealna pozycja dla par, które chcą urozmaicić swoje życie seksualne, wychodząc z sypialni do innych części domu. Seks na krześle może być szalony i pełen przygód. Oto jak to zrobić:\n\nOn: Jest to prawdopodobnie najwygodniejsza pozycja seksualna, jaką kiedykolwiek przyjmiesz jako mężczyzna. Wszystko, co musisz zrobić, to usiąść i położyć się krześle, lekko rozłożyć nogi i być gotowym na swoją kobietę.\n\nOna: Gdy Twój mężczyzna usiądzie, usiądź na nim, twarzą od niego, z nogami między jego nogami. Opuść się na niego w zależności od swojej przyjemności i chwyć go za twarz, podczas gdy on zabierze Cię w seksualną podróż.\n\nDlaczego warto?: Ta pozycja jest łatwa do wykonania, nie wymaga siły ani zręczności i może być niesamowicie przyjemna.\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/114.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Capricorn",
            "translateTitlePL": "Koziorożec",
            "content": "The Capricorn Sex Position is a great way for women to control their love making and pleasure centers while riding their man long into the night. Easy to achieve and definitely considered a sex position that women love, here\u0027s how to make it happen:\n\nHim: Simply sit down, legs stretched out in front of you, with your arms behind your head for balance. You can lean against a wall, too. Wait for your woman to assume position. That\u0027s it!\n\nHer: This is a classic female on top sex position in which you are going to reverse cowgirl your man, legs spread apart. Lower yourself onto him at your leisure, controlling penetration until it feels perfect for you. Place your hands on his calves for stabilization, leaning forward slightly for the perfect angle of penetration.\n\nWhy It Rocks: The Capricorn Sex Position provides both partners with the ability to control their preferred amount of penetration and thrusting. With the right patience, you can both hit an orgasm seamlessly, without any physical strain.\n",
            "translateContentPL": "Pozycja seksualna Koziorożca to świetny sposób dla kobiet, aby kontrolować orgazm, jednocześnie ujeżdżając swojego mężczyznę całą noc. Łatwa do osiągnięcia i zdecydowanie uważana za pozycję seksualną, którą kobiety uwielbiają, oto jak to zrobić:\n\nOn: Po prostu usiądź, z nogami wyciągniętymi przed siebie, z rękami za głową dla zachowania równowagi. Możesz też oprzeć się o ścianę. Poczekaj, aż Twoja kobieta przyjmie pozycję. To jest to!\n\nOna: Jest to klasyczna pozycja odwróconej kowbojki. Opuść się na swojego mężczyznę, kontrolując penetrację, aż poczujesz się idealnie. Połóż dłonie na jego łydkach dla stabilizacji, pochylając się lekko do przodu, aby uzyskać idealny kąt penetracji.\n\nDlaczego warto?: Pozycja seksualna Koziorożca zapewnia obojgu partnerom możliwość kontrolowania penetracji. Przy odpowiedniej cierpliwości, oboje możecie osiągnąć orgazm płynnie, bez żadnego wysiłku.\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/245.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Aries",
            "translateTitlePL": "Baran",
            "content": "Are you ready to get down and dirty with the Aries Sex Position? Make sure you have a headboard or wall to rest against so this kind of sex is comfortable for both parties involved. Ease into it slowly, as this new kind of angling can feel different to the woman. But, trust us, it\u0027s worth it in the end.\n\nHim: Simply sit down, legs laying flat ahead of you, either on the floor against the wall, or on the bed against the wall. In order for it to be comfortable, you will want to be able to rest your back against support. Allow your woman to slowly ease onto you, providing her with control throughout the fucking time.\n\nHer: While your man sits there, legs ahead of him, reverse cowgirl yourself onto him, legs spread apart so his legs fit under you, facing away from him. This is one of the best girls on top sex positions going right now, providing you with the power to angle yourself so that it feels good for you.\n\nWhy It Rocks: This is an easy sex position for men to maintain, and one that empowers the woman to position herself so that the experience feels great from start to finish. Not to mention, it requires little strength, but it does demand some flexibility from the woman, which can be achieved with a little patience.\n",
            "translateContentPL": "Czy jesteś gotowy na seks w pozycji Barana? Upewnij się, że masz zagłówek lub ścianę, o którą możesz się oprzeć. Stopniowo wchodź w partnerkę ponieważ ten nowy rodzaj pozycji może wydawać się inny dla kobiety. Ale zaufaj nam, będzie warto!\n\nOn: Po prostu usiądź, nogi leżące płasko przed Tobą, albo na podłodze przy ścianie, albo na łóżku przy ścianie. Pozwól swojej kobiecie powoli zejść na Ciebie, zapewniając jej kontrolę przez cały czas penetracji.\n\nOna: Podczas gdy Twój mężczyzna siedzi, odwróć się od niego, nogi rozstaw tak, aby jego nogi zmieściły się pod Tobą. Jest to obecnie jedna z najlepszych pozycji seksualnych, zapewniająca Ci możliwość ustawienia się pod takim kątem, aby było to dla Ciebie komfortowe.\n\nDlaczego warto?: Jest to łatwa do wykonania pozycja, która daje kobiecie możliwość ustawienia się tak, aby doznania były wspaniałe od początku do końca. Nie wspominając o tym, że nie wymaga dużej siły, ale wymaga od kobiety pewnej elastyczności, którą można osiągnąć przy odrobinie cierpliwości.\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/174.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Amazon",
            "translateTitlePL": "Amazon",
            "content": "As arguably one of the freakiest sex positions in the game today, the Amazon Sex Position challenges both lovers to jump out of their comfort zones, switching positioning in a way that is empowering and even better feeling. This move is generally easy to maneuver and requires the male to have some flexibility, while the woman is able to ride on top according to her preference.\n\nHim: The Amazon fuck position requires the male to assume a fetal position typically reserved for the woman. You\u0027re going to get to relax this time, laying on your back and pulling your legs up far enough so the penis can penetrate the woman, sitting atop of you. See the world from her perspective with this one, allowing your body to relax while you focus on the best parts of love-making.\n\nHer: Get ready to ride on top with this Amazon style sex, with your partner\u0027s legs in front of you as you ease down slowly for a powerful, yet gentle fuck. Lean forward and support yourself on the bed, pillows, or wall to keep your balance so you can control a classic sex position that women love.\n\nWhy It Rocks: The Amazon sex position is something everyone can handle, and can be performed in any kind of setting. It\u0027s a move that is fun for both of you, and with a little patience, can feel even better once you get the angling down. Check out Amazon sex position videos to help you get it right.\n",
            "translateContentPL": "Jako prawdopodobnie jedna z najbardziej dziwacznych pozycji seksualnych, Amazon rzuca wyzwanie obojgu kochankom, aby wyskoczyli ze swoich stref komfortu. Pozycja ta jest ogólnie łatwa w wykonaniu, ale wymaga od mężczyzny pewnej elastyczności, podczas gdy kobieta będzie ujeżdżała go na górze zgodnie ze swoimi preferencjami.\n\nOn: Pozycja Amazon wymaga od mężczyzny przyjęcia pozycji płodowej, zwykle zarezerwowanej dla kobiety. Tym razem będziesz mógł się zrelaksować, kładąc się na plecach i podciągając nogi tak daleko, aby penis mógł penetrować kobietę, siedzącą na Tobie. Zobacz świat z jej perspektywy, pozwalając swojemu ciału się zrelaksować.\n\nOna: Przygotuj się na jazdę na szczycie. Pochyl się do przodu i podeprzyj się na łóżku lub o ścianę, aby utrzymać równowagę, dzięki czemu będziesz mogła wszystko kontrolować.\n\nDlaczego warto?: Pozycja Amazon to coś, z czym każdy może sobie poradzić i może być wykonywana w dowolnym otoczeniu. Jest to pozycja, która jest zabawna dla was obojga, a przy odrobinie cierpliwości może być jeszcze lepsza.\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/161.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Reverse Cowgirl",
            "translateTitlePL": "Odwrócona kowbojka",
            "content": "The Reverse Cowgirl sex position is one of the world\u0027s favorite positions. While some might think that this position is all about fantasizing about another person besides your partner, we think it\u0027s all about dat ass. But what is the reverse cowgirl sex position, and how can you master it so that your partner falls in love, with it not you?\nIf you\u0027re searching for the reverse cowgirl sexual position, you\u0027ll get tons of results. Most of which overcomplicate this very simple, very amazing, position. So grab your cowgirl boots and hat, leave the spurs for the real animals, and climb on top—it\u0027s going to be fun a ride!\n\nHim: Lay down flat on your bed with your knees bent just enough to give her a saddle to ride. Then relax. Be sure to grab her hips and even hair—if she\u0027s into it—and start grinding on her from behind.\n\nHer: Climb on top of your male partner reverse style. Allow your hips to open and then lean slightly forward after he\u0027s entered you. Start riding him like your favorite horse, and enjoy the wild ride that follows.\n\nWhy It Rocks: Everybody gets a little bit of what they love all in one amazing sack session.\n",
            "translateContentPL": "Odwrócona kowbojka to jedna z ulubionych pozycji seksualnych na świecie. Ale czym jest pozycja seksualna odwróconej kowbojki i jak ją opanować, aby partner się w niej zakochał? Chwyć buty i kapelusz kowbojki, zostaw ostrogi dla prawdziwych zwierząt i wejdź na górę - to będzie zabawna przejażdżka!\n\nOn: Połóż się płasko na łóżku z kolanami zgiętymi na tyle, aby dać jej siodło do jazdy. Następnie rozluźnij się. Pamiętaj, aby chwycić ją za biodra, a nawet włosy - jeśli jej się to podoba - i zacznij penetrować ją od tyłu.\n\nOna: Wespnij się na swojego partnera. Pozwól swoim biodrom się otworzyć, a następnie pochyl się lekko do przodu po tym, jak w Ciebie wejdzie. Zacznij jeździć na nim jak na swoim ulubionym koniu i ciesz się dziką jazdą.\n\nDlaczego warto?: Każdy dostaje odrobinę tego, co kocha, w jednej niesamowitej pozycji!\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/150.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Crab",
            "translateTitlePL": "Krab",
            "content": "The Crab Walk Sex Position has nothing to do with crabs, that we can assure you. But the crab sex position is a key position if you and your partner have been going at it for a while with fairly tame and boring sex under your wings. Embrace your inner crustacean with this simple to do, yet so hot and fun position.\n\nHim: Sit down on your ass with your legs spread as wide as you can get them to go. Grab your lover\u0027s hips and hold on to them for dear life. You don\u0027t want her waddling away from you!!\n\nHer: Straddle your man with your legs spread out to either side of his body. Widen your legs and hips as much as they can go. Brace yourself with your arms behind your back. Slightly bend your back to get that oh so perfect angle. Toss your head back and enjoy the ride.\n\nWhy It Rocks: It is so intimate yet so sexual that it makes missionary look like a dance move. The Crab Sex Position is definitely one of the hottest in the book and gives you a new take on traditional male on female moves.\n",
            "translateContentPL": "Pozycja seksualna kraba nie ma nic wspólnego z krabami, o czym możemy zapewnić. Ale jest kluczową pozycją, jeśli Ty i Twój partner uprawiacie seks od jakiegoś czasu. Ujarzmij swojego wewnętrznego skorupiaka dzięki tej prostej do wykonania, ale tak gorącej i zabawnej pozycji.\n\nOn: Usiądź na pupie z nogami rozłożonymi tak szeroko, jak to tylko możliwe. Chwyć swoją partnerkę za biodra i trzymaj się ich jak najdłużej. Nie chcesz przecież, by się od Ciebie odsuwała!\n\nOna: Usiądź okrakiem na swoim mężczyźnie z nogami rozłożonymi po obu stronach jego ciała. Rozszerz nogi i biodra tak szeroko, jak to możliwe. Podeprzyj się rękami za plecami. Lekko zegnij plecy, aby uzyskać idealny kąt. Odchyl głowę do tyłu i ciesz się jazdą.\n\nDlaczego warto?: Pozycja seksualna kraba jest zdecydowanie jedną z najgorętszych w tej kategorii!\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/77.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Italian Chandelier",
            "translateTitlePL": "Włoski Żyrandol",
            "content": "The Italian chandelier sex position has nothing to do with décor, of that we can assure you. But the Italian chandelier position is pretty opulent if you\u0027re prepared. The Italian chandelier style position is sexy, sensual, and is sure to give you both one heck of a good time. Pair it with other moves like the PileDriver to amp up the pleasure. And if you\u0027re just curious what this move looks like, then check out the Italian Chandelier position picture we\u0027ve posted for you.\n\nHim: Lay down flat on your back stable. Let her do all the work for you as you sit there, relaxing into the passion of the move.\n\nHer: The Italian chandelier sex position is all about her. Climb on top of your partner and position yourself in the opposite direction. Bend your knees and brace yourself with your hands on either side of his body.\n\nWhy It Rocks: The Italian chandelier position is a pretty lazy move for him, but for her, it involves a bit of work. Either way, it feels absolutely incredible for both of you.\n",
            "translateContentPL": "Pozycja “włoski żyrandol” nie ma nic wspólnego z wystrojem, o czym możemy zapewnić. Jest dość bogata, jeśli jesteś przygotowany. Pozycja w stylu włoskiego żyrandola jest seksowna, zmysłowa i z pewnością zapewni Wam niezłą zabawę.\n\nOn: Połóż się stabilnie na plecach. Pozwól jej wykonać całą robotę za Ciebie.\n\nOna: Wespnij się na swojego partnera i ustaw się w przeciwnym kierunku. Zegnij kolana i podeprzyj się dłońmi po obu stronach jego ciała.\n\nDlaczego warto?: Pozycja włoskiego żyrandola jest dość leniwym ruchem dla niego, ale dla niej wymaga trochę pracy. Tak czy inaczej, jest to absolutnie niesamowita pozycja dla Was obojga.\n",
            "category": "Woman On Top",
            "translateCategoryPL": "Kobieta na górze",
            "URL": "https://sexpositions.club/positions/126.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Pisces",
            "translateTitlePL": "Ryby",
            "content": "The Pisces sex position is one of those creative ways to eat out a woman until she\u0027s coming and screaming for mercy. Requiring some flexibility from the female, get ready for an all-you-can-eat buffet.\n\nHim: Get ready to show off your tonging skills as you bury your mouth deep into your woman\u0027s pussy. Presented open, high, and accessible to you, get to work pleasing her the right way.\n\nHer: Lay on your back, and lift your lower half at the hips up into the air. Stabilize your legs as the dangle above your head, presenting your vagina in an open and accessible manner to your man. Use your hands to stabilize your lower back and provide support while you\u0027re eaten out.\n\nWhy It Rocks: This is great sex position that provides entirely new angles to oral sex. If you\u0027re ready to bury your face deep into vaginal cum, the Pisces position will make it happen.\n",
            "translateContentPL": "Pozycja seksualna Ryby to jeden z kreatywnych sposobów na pożarcie kobiety, aż dojdzie i zacznie krzyczeć o litość. Wymaga pewnej elastyczności od kobiety, przygotuj się na bufet, w którym możesz jeść do woli.\n\nOn: Przygotuj się na popis swoich umiejętności, zakopując usta głęboko w pochwie swojej kobiety. Zabierz się do pracy, aby zadowolić ją we właściwy sposób.\n\nOna: Połóż się na plecach i unieś dolną połowę bioder w powietrze. Ustabilizuj nogi, gdy będą zwisać nad głową, aby Twoja pochwa była dostępna dla Twojego mężczyzny. Użyj rąk, aby ustabilizować dolną część pleców i zapewnić wsparcie podczas konsumpcji.\n\nDlaczego warto?: To świetna pozycja seksualna, która zapewnia zupełnie nowe oblicze seksu oralnego. Jeśli jesteś gotowy, aby zanurzyć twarz głęboko w pochwie, pozycja Ryby sprawi, że tak się stanie.\n",
            "category": "Oral",
            "translateCategoryPL": "Seks oralny",
            "URL": "https://sexpositions.club/positions/202.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Hucklebuck",
            "translateTitlePL": "Hucklebuck",
            "content": "If you want to 69 in a way that is more open, exposed, and raw, the Hucklebuck Sex Position will surely get you there.\n\nWho doesn\u0027t love to 69? For the men who want a better view, and perhaps the ability to eat out some ass at the same time, the Hucklebuck Sex Position is a clever and creative 69 facing position that will leave both parties moaning.\n\nHim: Simply lay down and put your legs in a frog position, knees bowed out so your cock is open and ready for sucking. Otherwise, get comfy and lip your lips as you sink your teeth into some gaping pussy and ass.\n\nHer: Climb on top of your man and bend down facing him, with your head at his legs, and your ass open and ready for munching at his face. Place your feet at his elbows, and put your hands under your body, challenging you to really go all in with dick sucking.\n\nWhy It Rocks: This is a fun twist on 69ing that provides both parties with more of a direct eating approach, which can result in some of the best climaxes out there. Plus, it\u0027s not that hard to do!\n",
            "translateContentPL": "Kto nie lubi 69? Dla mężczyzn, którzy chcą mieć lepszy widok i być może możliwość zjedzenia tyłeczka w tym samym czasie, pozycja seksualna Hucklebuck jest sprytną i kreatywną pozycją 69, która sprawi, że obie strony będą jęczeć.\n\nOn: Po prostu połóż się i ułóż nogi w pozycji żaby, kolana ugięte, aby Twój penis był widoczny i gotowy do ssania. Zaciśnij usta, zatapiając się w ciasnej pochwie i tyłeczku.\n\nOna: Wespnij się na swojego mężczyznę i pochyl się twarzą do niego, z głową przy jego nogach i tyłeczkiem otwartym i gotowym do schrupania jego twarzy. Umieść stopy na jego łokciach i połóż ręce pod swoim ciałem, rzucając wyzwanie, aby naprawdę pójść na całość z ssaniem penisa.\n\nDlaczego warto?: Jest to zabawna odmiana 69, która zapewnia obu stronom bardziej bezpośrednie podejście do jedzenia, co może skutkować jednymi z najlepszych momentów kulminacyjnych. Poza tym nie jest to takie trudne!\n",
            "category": "Oral",
            "translateCategoryPL": "Seks oralny",
            "URL": "https://sexpositions.club/positions/49.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Mexican Halloween",
            "translateTitlePL": "Meksykańskie Halloween",
            "content": "Feeling a little festive? If so, the Mexican Halloween sex position will replace your fear with fiery sex. This move is not for the faint of heart, either. Our sex position sketch shows you how dangerous it can be also. If your man is on the heavier side or if you\u0027re on the smaller side, it might not be the best position for you. So, dawn your skull mask and get the bed ready, this Mexican Halloween sex position is sure to please.\n\nHer: Lie down on your back with your knees wrap your arms around your man\u0027s stomach and put your head on a pillow. Lick and suck your way to his man bits.\n\nHim: Lie down gently on your lady\u0027s stomach with your back and head positioned on her legs. Spread your legs far enough so she can fit her head between them. Brace yourself with your arms on each side of your body.\n\nWhy It Rocks: The Mexican Halloween sex position is the ideal move if you want something new to spice up your sex life!\n",
            "translateContentPL": "Pozycja seksualna Meksykańskie Halloween zastąpi strach ognistym seksem. Nie jest ona jednak przeznaczona dla osób o słabych nerwach. Nasz szkic pokazuje, jak niebezpieczna może być ta pozycja. Jeśli Twój mężczyzna jest cięższy lub jeśli Ty jesteś niższa, może to nie być najlepsza pozycja dla Ciebie. Załóż maskę i przygotuj łóżko, ta pozycja z pewnością Ci się spodoba.\n\nOna: Połóż się na plecach z ugiętymi kolanami, owiń ręce wokół talii swojego mężczyzny i połóż głowę na poduszce.\n\nOn: Połóż się delikatnie na swojej kobiecie. Rozłóż nogi na tyle, aby mogła zmieścić między nimi głowę. Podeprzyj się rękami po obu stronach ciała.\n\nDlaczego warto?: Pozycja seksualna Meksykańskie Halloween jest idealna, jeśli chcesz doświadczyć czegoś nowego, aby urozmaicić swoje życie seksualne!\n",
            "category": "Oral",
            "translateCategoryPL": "Seks oralny",
            "URL": "https://sexpositions.club/positions/171.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Jackhammer",
            "translateTitlePL": "Jackhammer",
            "content": "Get your hardhat and construction vest on gentlemen, this position will make a construction worker yet. How many times have you heard in the bedroom, “Can you ease off the jackhammering”? Likely more than once. Well, this position should fulfil your fantasies. The Jackhammer sex position lets you be yourself. But what is the jackhammer position? How can you do the jackhammer sex move without making her mad at you again? Here\u0027s how…\n\nHer: Get down on the floor on your butt. Spread your legs slightly and bend your knees to stabilize yourself. Put your man\u0027s member into your mouth as he stands over you and plays with his other jewels.\n\nHim: Put yourself into the jackhammer sex position by standing on top of your lady friend and bending your knees slightly. Let her go to work on your member as you enjoy yourself.\n\nWhy It Rocks: The jackhammer sex position is comfortable for her and oh so much fun for him! No more creak in your neck while you give your man a BJ, and he\u0027ll love it because you\u0027ll be pleasuring all his favorite parts!\n",
            "translateContentPL": "Załóżcie kask i kamizelkę budowlaną Panowie, ta pozycja zrobi z Was pracowników budowlanych. Cóż, ta pozycja powinna spełnić Twoje fantazje. Pozycja Jackhammer pozwala Ci być sobą. Ale czym ona właściwie jest? Jak ją wykonać, nie doprowadzając jej do szału?\n\nOna: Usiądź na podłodze na pupie. Rozłóż lekko nogi i ugnij kolana, aby się ustabilizować. Włóż członka swojego mężczyzny do ust, podczas gdy on będzie stał nad Tobą i bawił się swoimi klejnotami.\n\nOn: Pozwól jej popracować nad Twoim członkiem, podczas gdy Ty będziesz się dobrze bawić.\n\nDlaczego warto?: Pozycja Jackhammer jest wygodna dla niej i bardzo przyjemna dla niego! Koniec z trzeszczeniem w szyi, gdy robisz swojemu mężczyźnie loda, on to pokocha!\n",
            "category": "Oral",
            "translateCategoryPL": "Seks oralny",
            "URL": "https://sexpositions.club/positions/203.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Fire Hydrant",
            "translateTitlePL": "Hydrant",
            "content": "You know, they say men can act like dogs, and the Fire Hydrant Sex Position is a great way for men to let that part of them show. Not to mention that this is a way different oral sex position than what most of you are used to. If you want to spice things up with your man or just want to act like the dog you are, you\u0027ll like this move.\n\nHer: Take things down to the floor with your butt on the ground and your hands wrapped around your man\u0027s upper thighs. Grab a hold and give him the best blowjob of his life.\n\nHim: Stand in front of your lady and slightly spread your legs so she can get in there for the total package. Relax, and enjoy everything that she has to offer.\n\nWhy It Rocks: The fire hydrant sex position is a different move for oral sex that so many people are losing out on. Try it out for an exciting time for both of you.\n",
            "translateContentPL": "Mówi się, że mężczyźni potrafią zachowywać się jak psy, a pozycja hydrantu to świetny sposób, aby pokazać tę część siebie. Nie wspominając o tym, że jest to zupełnie inna pozycja seksu oralnego niż ta, do której większość z Was jest przyzwyczajona. Jeśli chcesz urozmaicić relacje ze swoim mężczyzną ta pozycja jest dla Ciebie.\n\nOna: Usiądź na podłodze z rękami owiniętymi wokół ud swojego mężczyzny. Chwyć go i zrób mu najlepszego loda w jego życiu.\n\nOn: Stań przed swoją kobietą i lekko rozłóż nogi. Zrelaksuj się i ciesz się wszystkim, co ma do zaoferowania.\n\nDlaczego warto?: Seks w pozycji hydrantu to zupełnie inne podejście do seksu oralnego. Wypróbuj ją, aby miło spędzić czas We dwoje.\n",
            "category": "Oral",
            "translateCategoryPL": "Seks oralny",
            "URL": "https://sexpositions.club/positions/232.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "69",
            "translateTitlePL": "69",
            "content": "Looking for better blowjob sex positions to give your man a seriously good night? Well, we\u0027ve got you covered. This Classic 69 sex position is sure to please you both. Giving it to your lover the right way cannot be underestimated. Literally, marriages have lasted for years because of good head. The beauty of this blowjob and oral sex position is its simplicity. It\u0027s easy and fun to do. Haven\u0027t done it before? Well, here\u0027s how to start.\n\nHim: Lay down on your back. Spread your legs slightly. Grab a few pillows to prop up your hips. Go to town on her bits as soon as they hit your face, and oh how they will.\n\nHer: Climb on top of your man in a reverse position with your mouth hovering over his member. Slide your body parts into his mouth delicately as you do the same with his. Pleasure each other until you both climax.\n\nWhy It Rocks: There\u0027s not much to say, it rocks because you both get some damn good oral sex.\n",
            "translateContentPL": "Szukasz lepszych pozycji seksualnych do robienia loda, aby zapewnić swojemu mężczyźnie naprawdę dobrą noc? Cóż, mamy coś dla Ciebie. Ta klasyczna pozycja 69 z pewnością zadowoli Was oboje. Nie można lekceważyć oddawania się partnerowi we właściwy sposób. Dosłownie, małżeństwa przetrwały lata dzięki dobrej zabawie. Piękno tej pozycji do obciągania i seksu oralnego polega na jej prostocie. Jest łatwa i przyjemna do wykonania. Nie robiłeś tego wcześniej? Cóż, oto jak zacząć.\n\nOn: Połóż się na plecach. Rozłóż lekko nogi. Weź kilka poduszek, aby podeprzeć biodra.\n\nOna: Wespnij się na swojego mężczyznę w pozycji odwróconej, z ustami unoszącymi się nad jego członkiem. Delikatnie wsuwaj swoje części ciała do jego ust, robiąc to samo z jego. Sprawiajcie sobie nawzajem przyjemność, aż oboje osiągniecie punkt kulminacyjny.\n\nDlaczego warto?: Nie ma tu dużo do powiedzenia, ta pozycja jest świetna, ponieważ oboje uprawiacie cholernie dobry seks oralny.\n",
            "category": "Oral",
            "translateCategoryPL": "Seks oralny",
            "URL": "https://sexpositions.club/positions/182.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "On Your Knees",
            "translateTitlePL": "Na Kolanach",
            "content": "Have you ever watched an action flick, you know the ones with A-List action stars, and heard the line, “Get On Your Knees”? Well, this is kind of like that, except there\u0027s a dick in your mouth. We love to offer our visitors pictures of oral sex positions in this category so you can see exactly what we\u0027re talking about. In this move, you\u0027ll see our mannequin assuming the position and you\u0027ll notice our male mannequin is blankly staring off into space. Rest assured, this position will NOT make you stare off blankly into space unless that\u0027s your go-to when you\u0027re getting the best pleasure of your life.\n\nHim: Stand up tall perhaps leaning against a wall or other object.\n\nHer: Get on your knees in front of your man, almost in a doggie style position. Grab ahold of his member and place it in your mouth. Use your hands and mouth to give him one hell of a good time.\n\nWhy It Rocks: Our picture says it all, this sex position is great for him because he\u0027s getting a blowjob, and it\u0027s easy for her because it\u0027s direct access to his member.\n",
            "translateContentPL": "Czy kiedykolwiek oglądałeś film akcji i słyszałeś tekst “Padnij na kolana”? Cóż, ta pozycja jest trochę podobna, z wyjątkiem tego, że w Twoich ustach jest penis. Uwielbiamy oferować naszym odwiedzającym zdjęcia pozycji seksu oralnego w tej kategorii, abyś mógł dokładnie zobaczyć, o czym mówimy. W tym przypadku zobaczysz naszego manekina przyjmującego pozycję i zauważysz, że nasz męski manekin pusto wpatruje się w przestrzeń. Zapewniamy, że ta pozycja NIE sprawi, że będziesz wpatrywać się pustym wzrokiem w przestrzeń, chyba że jest to Twój sposób na osiągnięcie najlepszej przyjemności w życiu.\n\nOn: Stań wysoko, być może opierając się o ścianę lub inny obiekt.\n\nOna: Uklęknij przed swoim mężczyzną, prawie w pozycji na pieska. Chwyć jego członka i umieść go w ustach. Użyj swoich rąk i ust, aby dać mu piekielnie dobrą zabawę.\n\nDlaczego warto?: Nasze zdjęcie mówi wszystko, ta pozycja seksualna jest świetna dla niego, a dla niej jest łatwa, ponieważ daje jej bezpośredni dostęp do jego członka.\n",
            "category": "Oral",
            "translateCategoryPL": "Seks oralny",
            "URL": "https://sexpositions.club/positions/223.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Superhero",
            "translateTitlePL": "Superbohater",
            "content": "Have you ever face planted into the dirt? This is one of those positions for oral sex that feels like that, but instead of dirt, you face plant into your lady\u0027s special parts. All you need is some damn good stamina and an ability to levitate, at least according to our model. But in all seriousness, this one is super fun for both sides and if you do it right it can make your orgasm all the better. Forget about boring positions for oral sex. This move will get your heart pumpin\u0027 in more than one way.\n\nHer: Arch your back and put your legs on your partner\u0027s shoulders. Keep your back as straight as possible while bracing yourself with your forearms on the bed.\n\nHim: Get on your knees on your bed and slowly slide her legs over your shoulders. Brace your body with your arms and give her the best damn oral sex that she has ever had.\n\nWhy It Rocks: It\u0027s a great move if you want to impress your partner and it\u0027s perfect access to all her best parts.\n",
            "translateContentPL": "Czy kiedykolwiek zdarzyło Ci się wpaść twarzą w ziemię? To jedna z tych pozycji seksu oralnego, w której czujesz się podobnie, ale zamiast brudu sadzasz twarz w swojej kobiecie. Wszystko, czego potrzebujesz, to cholernie dobra wytrzymałość i zdolność lewitacji, przynajmniej według naszego modelu. Ale z całą powagą, ta pozycja jest super zabawna dla obu stron, a jeśli zrobisz to dobrze, może sprawić, że Twój orgazm będzie jeszcze lepszy. Zapomnij o nudnych pozycjach seksu oralnego. Ta pozycja przyspieszy bicie serca.\n\nOna: Wygnij plecy w łuk i połóż nogi na ramionach partnera. Trzymaj plecy tak prosto, jak to możliwe, jednocześnie podpierając się przedramionami na łóżku.\n\nOn: Uklęknij na łóżku i powoli zsuń jej nogi na swoje ramiona. Podeprzyj swoje ciało ramionami i daj jej najlepszy seks oralny, jaki kiedykolwiek miała.\n\nDlaczego warto?: To świetna pozycja, jeśli chcesz zaimponować swojej partnerce. Zapewnia doskonały dostęp do wszystkich najlepszych części jej ciała.\n",
            "category": "Oral",
            "translateCategoryPL": "Seks oralny",
            "URL": "https://sexpositions.club/positions/250.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Mermaid",
            "translateTitlePL": "Syrena",
            "content": "If you\u0027re looking for a sex position that comes with bragging rights, then the mermaid sex position can definitely deliver. Mermaid sex is named for the incredible flexibility that needs to come with the female, as well as the core strength to stabilize the whole act. Here\u0027s how to pull it off:\n\nHim: This one is easy for you. All you do is lay down, completely flat with your legs straight out in front of you, while you get ready to stabilize the entirety of your woman\u0027s weight above your groin.\n\nHer: Get ready to pull out all the moves. Sit down on top of your man at his groin and slowly bend your torso, as well as your legs, into the air. Use your arms to stabilize your weight by grabbing the back of your knees, relying on your core to stay stable. Wiggle yourself into perfect cock placement.\n\nWhy It Rocks: This is definitely a sex position that will spice things up for you and your lover. If you\u0027re a woman with yoga, athletic, or flexibility experience, exercise extreme patience in getting this one right.\n",
            "translateContentPL": "Jeśli szukasz pozycji seksualnej, która daje prawo do chwalenia się, to pozycja syreny zdecydowanie może to zapewnić. Jest ona tak nazwana ze względu na niesamowitą elastyczność, którą musi wykazać się kobieta. Oto jak to zrobić:\n\nOn: Wszystko, co musisz zrobić, to położyć się całkowicie płasko z nogami wyciągniętymi przed siebie, przygotowując się do ustabilizowania całego ciężaru swojej kobiety.\n\nOna: Usiądź na swoim mężczyźnie przy jego pachwinie i powoli wyginaj tułów, a także nogi, w powietrze. Użyj ramion, aby ustabilizować ciężar ciała, chwytając się za łydki, aby zachować stabilność. Poruszaj się, aby idealnie osadzić penisa.\n\nDlaczego warto?: Jest to zdecydowanie pozycja, która urozmaici życie Twoje i Twojego partnera. Jeśli jesteś kobietą z doświadczeniem w jodze lub lekkoatletyce, wykaż się niezwykłą starannością, aby wykonać tę pozycję prawidłowo.\n",
            "category": "Acrobatic",
            "translateCategoryPL": "Akrobatyczne",
            "URL": "https://sexpositions.club/positions/2.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Golden Gate",
            "translateTitlePL": "Golden Gate",
            "content": "Not everyone can Golden Gate, which is why for the women who can, it\u0027s a serious 69 feat they should brag about for the rest of their lives.\n\nEveryone loves a good 69. Dicks sucked, pussies eaten, and maximum pleasure at the same time. The Golden Gate Sex Position takes 69ing to a whole other level as the woman\u0027s body essentially makes the top of a bridge with the man below her.\n\nHim: This couldn\u0027t be easier for you. Simply lay there and get ready to embrace a wet and dripping pussy while your woman performs a seriously impressive acrobatic act above your face.\n\nHer: If you have extreme flexibility and athletic dispositions, this 69 sex position is worth a try. Sit down on your partner\u0027s face, facing forward, legs spread around his head. Bend backwards slowly to create an arch with your body until you are facing his erect penis. It\u0027s time to get to work.\n\nWhy It Rocks: Not many people can pull off the Golden Gate Sex Position. It all comes down to the female\u0027s flexibility. But, if you\u0027re one of the lucky ones, it\u0027s one of the most insane ways to 69.\n",
            "translateContentPL": "Każdy uwielbia dobre 69. Ssanie penisa, lizanie cipki i maksymalna przyjemność w tym samym czasie. Pozycja seksualna Golden Gate przenosi 69 na zupełnie inny poziom, ponieważ ciało kobiety zasadniczo tworzy szczyt mostu z mężczyzną pod nią.\n\nOn: Po prostu połóż się i przygotuj na objęcie mokrej i ociekającej cipki, podczas gdy Twoja kobieta wykonuje naprawdę imponujący akrobatyczny akt nad Twoją twarzą.\n\nOna: Jeśli masz wyjątkową elastyczność i atletyczne usposobienie, ta pozycja jest warta wypróbowania. Usiądź na twarzy partnera z nogami rozłożonymi wokół jego głowy. Powoli wygnij się do tyłu, tworząc łuk swoim ciałem, aż znajdziesz się naprzeciwko jego penisa. Czas zabrać się do pracy.\n\nDlaczego warto?: Niewiele osób potrafi wykonać pozycję seksualną Golden Gate. Wszystko sprowadza się do elastyczności kobiety. Ale jeśli jesteś jednym z tych szczęśliwców, jest to jeden z najbardziej szalonych sposobów na 69.\n",
            "category": "Acrobatic",
            "translateCategoryPL": "Akrobatyczne",
            "URL": "https://sexpositions.club/positions/109.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Brute",
            "translateTitlePL": "Brute",
            "content": "Few sex positions are as complicated, freaky, and challenging as the Brute Sex Position, requiring both parties to bend, twist, and turn in an unnatural way. However, if you manage to conquer the brute position together, what could feel more rewarding? Talk about bragging rights! Here\u0027s how to attempt it:\n\nHim: Once your woman is in place, slowly squat down atop her, facing away from here, with a stiff bend in your knee. Lower yourself into her, arch your back, and use your hands for stability with her thighs and lower hip region. This is going to burn in your quads – get ready!\n\nHer: Lay on your back and place your arms under your lower back to elevate the bottom half of your body. Bring your pleasure center into the air, legs apart and bent over your face. Hold still while your man lowers himself into position facing away from you.\n\nWhy It Rocks: The pleasure sensation that ensues from the brute sex position is like nothing you have ever felt, which is why if you\u0027re up for the flexible challenge, it is incredibly rewarding by the end. Talk about bragging rights!\n",
            "translateContentPL": "Niewiele pozycji seksualnych jest tak skomplikowanych, dziwacznych i wymagających jak pozycja Brute, wymagająca od obu stron zginania się, skręcania i obracania w nienaturalny sposób. Jeśli jednak uda wam się wspólnie ją opanować, to co może być bardziej satysfakcjonującego? Oto jak tego dokonać:\n\nOn: Gdy Twoja kobieta jest już na miejscu, powoli przykucnij na niej, twarzą odwróconą od niej, sztywno uginając kolana. Opuść się na nią, wygnij plecy w łuk i użyj rąk do stabilizacji, trzymając ją za uda. To spali Twoje mięśnie czworogłowe - przygotuj się!\n\nOna: Połóż się na plecach i umieść ręce pod dolną częścią pleców, aby unieść dolną połowę ciała. Podnieś swoje centrum przyjemności w powietrze, nogi załóż za głowę. Nie ruszaj się, podczas gdy Twój mężczyzna będzie obniżał się do Ciebie.\n\nDlaczego warto?: Doznania płynące z tej pozycji seksualnej są nieziemskie, dlatego jeśli jesteś gotowy na elastyczne wyzwanie, jest to niesamowicie satysfakcjonująca pozycja.\n",
            "category": "Acrobatic",
            "translateCategoryPL": "Akrobatyczne",
            "URL": "https://sexpositions.club/positions/186.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Waterfall",
            "translateTitlePL": "Wodospad",
            "content": "Don\u0027t go chasing waterfalls, except and unless it is the waterfall sex position—sorry TLC. But in all seriousness, sex does not have to be boring, and the waterfall position is anything but boring. You don\u0027t have to have tremendous flexibility, but you should be able to touch your toes to do this move. If you\u0027re thinking about doing the sex position “waterfall” then consider our tips below.\n\nHim: Get on your knees in front of your lady friend. Spread your hips. Grab her by the hips and pull her onto your member. Stay stable so she is safe during the act. Give her an O. This your job, so do it!\n\nHer: Wrap your legs around your man\u0027s body and then bend yourself backwards and stabilize yourself with your hands on the ground. Bend it all the way as far as you can go and let him do the rest.\n\nWhy It Rocks: The waterfall sex position is sure to please you both if you do it right. Put in the work and it will get you where you both want to go.\n",
            "translateContentPL": "Seks nie musi być nudny, a pozycja wodospadu nie jest nudna. Nie musisz mieć ogromnej elastyczności. Jeśli zastanawiasz się nad wykonaniem tej pozycji seksualnej, rozważ nasze wskazówki poniżej:\n\nOn: Uklęknij przed swoją partnerką. Chwyć ją za biodra i przyciągnij do swojego członka. Zachowaj stabilność, aby była bezpieczna podczas stosunku.\n\nOna: Owiń nogi wokół ciała swojego mężczyzny, a następnie odchyl się do tyłu i ustabilizuj się rękami na ziemi. Wygnij się tak daleko, jak to możliwe i pozwól mu zrobić resztę.\n\nDlaczego warto?: Ta pozycja z pewnością Was zadowoli, jeśli dobrze ją wykonacie. Włóżcie w to trochę pracy, a doprowadzi Was to tam, gdzie oboje chcecie dotrzeć.\n",
            "category": "Acrobatic",
            "translateCategoryPL": "Akrobatyczne",
            "URL": "https://sexpositions.club/positions/18.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Spider",
            "translateTitlePL": "Pająk",
            "content": "Hate spiders but love sex? Good news, the spider sex position has nothing to do with arachnids. The spider sex position is all about getting freaky and imitating the best nature has to offer. Spider sex style is absolutely a good time if you know how to do it. But if you haven\u0027t done it before you might be intimidated. Don\u0027t be. Here is how to master this sex move.\n\nHim: Get down on your back and arch your back like you\u0027re moving into bridge pose Yoga style. Keep your hips level with the rest of your body and brace yourself with your arms on the bed.\n\nHer: Mirror your partner\u0027s position with your hips over your partner\u0027s hips. Put him inside of you and then bump and grind down onto his member as you enjoy yourself.\n\nWhy It Rocks: The spider sex position is super fun to try at least once.\n",
            "translateContentPL": "Nienawidzisz pająków, ale kochasz seks? Dobra wiadomość, pozycja seksualna pająka nie ma nic wspólnego z pajęczakami. W tej pozycji chodzi o to, by być dziwacznym i naśladować to, co natura ma najlepszego do zaoferowania. Seks w stylu pająka to absolutnie dobra zabawa, jeśli wiesz, jak to zrobić. Jeśli nie robiłeś tego wcześniej, możesz być onieśmielony. Nie martw się. Oto jak ją opanować:\n\nOn: Połóż się na plecach i wygnij plecy w łuk, jakbyś przechodził do pozycji mostka. Utrzymuj biodra na poziomie reszty ciała i podeprzyj się rękami na łóżku.\n\nOna: Odzwierciedlaj pozycję partnera, umieszczając swoje biodra nad biodrami partnera. Umieść penisa w pochwie, a następnie poruszaj się w górę i w dół, czerpiąc z tego jak najwięcej przyjemności.\n\nDlaczego warto?: Pozycja seksualna pająka to świetna zabawa, którą warto wypróbować przynajmniej raz.\n",
            "category": "Acrobatic",
            "translateCategoryPL": "Akrobatyczne",
            "URL": "https://sexpositions.club/positions/184.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Overpass",
            "translateTitlePL": "Wiadukt",
            "content": "Ever heard of the overpass sex position? You probably haven\u0027t because it\u0027s one of those almost impossible sex positions. But if you have the time and the desire, this could be a rewarding position to learn how to do. The sex position called “overpass” is a great way to get your cardio and stretching in also. So how do you do it? Follow along boys and girls.\n\nHer: Lie on your back and bend your legs back over your head almost like you\u0027re trying to do a backflip. Grab ahold of his hips above you to keep yourself stable while he penetrates you from above.\n\nHim: Squat down on top of your girl with your hands on the ground or surface in front of you as you bend forward. Penetrate her from the top and start gently to avoid any awkward angles. And if you nail the overpass sex position, she\u0027ll be so happy to know you.\n\nWhy It Rocks: If you can do the overpass sex position you can do almost anything! It\u0027s nearly impossible, so don\u0027t be afraid to try it out.\n",
            "translateContentPL": "Słyszałeś kiedyś o pozycji seksualnej wiaduktu? Prawdopodobnie nie, ponieważ jest to jedna z tych prawie niemożliwych do wykonania pozycji. Jeśli masz czas i ochotę, może to być satysfakcjonująca pozycja, której możesz się nauczyć. To świetny sposób na trening cardio i gimnastykę.\n\nOna: Połóż się na plecach i zegnij nogi do tyłu nad głową, prawie tak, jakbyś próbowała zrobić salto w tył. Chwyć jego biodra nad sobą, aby zachować stabilność, podczas gdy on penetruje Cię od góry.\n\nOn: Przykucnij na swojej partnerce z rękami na powierzchni przed sobą, pochylając się do przodu. Penetruj ją od góry, zacznij delikatnie, aby uniknąć niezręcznych sytuacji.\n\nDlaczego warto?: Jeśli potrafisz wykonać tę pozycję, możesz zrobić prawie wszystko! Jest ona niemal niemożliwa, ale nie bój się jej wypróbować!\n",
            "category": "Acrobatic",
            "translateCategoryPL": "Akrobatyczne",
            "URL": "https://sexpositions.club/positions/175.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "London Bridge",
            "translateTitlePL": "London Bridge",
            "content": "The London Bridge is Falling Down, Falling Down, Falling Down… actually no, things are getting much firmer. The London bridge sex position is sure to arch your bridge like nothing else. And good news, you don\u0027t have to be from the UK to understand the London bridge sex move. The bridge sex position does require a bit of flexibility and stamina, so be prepared to do it right. Grab your partner, have a cup of tea, and then get ready for some back-bending fun for you both.\n\nHer: Get on your back on your bed or another surface. Then begin arching your back slowly while keeping your feet flat on the ground. Use your arms to stabilize yourself.\n\nHim: For the London bridge sex position, hover on top of your partner. Grab her around the waste and pull her closer to you. Enter her from between her open knees and keep your legs together. Stabilize yourself with one arm on the bed and go to town!\n\nWhy It Rocks: The bridge sex position is a great workout and gives you perfect access to all the best parts of each other.\n",
            "translateContentPL": "Pozycja seksualna London Bridge z pewnością wygnie Twój most jak nic innego. Nie musisz pochodzić z Wielkiej Brytanii, aby ją wykonać. Ta pozycja wymaga nieco elastyczności i wytrzymałości, więc przygotuj się, aby zrobić to dobrze. Chwyć swojego partnera, napij się herbaty, a następnie przygotuj się na dobrą zabawę.\n\nOna: Połóż się na plecach na łóżku lub innej powierzchni. Następnie zacznij powoli wyginać plecy, trzymając stopy płasko na ziemi. Użyj swoich ramion, aby się ustabilizować.\n\nOn: Aby uzyskać pozycję London Bridge, unieś się nad partnerką. Chwyć ją za biodra i przyciągnij bliżej siebie. Wejdź w nią pomiędzy jej rozchylonymi kolanami. Ustabilizuj się jedną ręką na łóżku i przejdź do rzeczy!\n\nDlaczego warto?: Ta pozycja jest świetnym sposobem na trening i zapewnia doskonały dostęp do wszystkich najlepszych partii ciała.\n",
            "category": "Acrobatic",
            "translateCategoryPL": "Akrobatyczne",
            "URL": "https://sexpositions.club/positions/226.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Helicopter",
            "translateTitlePL": "Helikopter",
            "content": "Go buck wild with the helicopter sex position. “Get to the chopper” takes on a whole new meaning with the helicopter sex move. You probably haven\u0027t heard of this move before, let alone used it in your sex life. So, if you haven\u0027t, then you have to try it out. Here\u0027s what you need to know to nail on your first go.\n\nHer: Lie on her stomach and grab ahold of your partner\u0027s feet as he goes to town on you like a helicopter landing on a launch pad.\n\nHim: Lie on top of her in the opposite direction. Grab ahold of her feet and kiss and lick her feet. Enter her from the top by laying the opposite way. Arch your back slightly and enter her from behind.\n\nWhy It Rocks: The helicopter style sex position is one hell of a way to get it on. It\u0027s unique, sexy, and totally hot. You\u0027ll love the way it makes you both feel.\n",
            "translateContentPL": "Zaszalej z pozycją seksualną helikoptera. Prawdopodobnie nie słyszałeś wcześniej o niej, nie mówiąc już o wypróbowaniu jej w swoim życiu seksualnym. Oto, co musisz wiedzieć, aby wejść w nią za pierwszym razem.\n\nOna: Połóż się na brzuchu i chwyć swojego partnera za stopy, gdy będzie leciał na Ciebie jak helikopter lądujący na ziemi.\n\nOn: Połóż się na niej w przeciwnym kierunku. Chwyć jej stopy, całuj je i liż. Lekko wygnij plecy w łuk i wejdź w nią od góry.\n\nDlaczego warto?: Pozycja seksualna w stylu helikoptera to piekielnie ekscytująca pozycja. Jest wyjątkowa, seksowna i totalnie gorąca. Pokochasz to, jak oboje się w niej poczujecie.\n",
            "category": "Acrobatic",
            "translateCategoryPL": "Akrobatyczne",
            "URL": "https://sexpositions.club/positions/221.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Vulgar Chair",
            "translateTitlePL": "Wulgarne Krzesło",
            "content": "You know those street performers, the ones who you watch do crazy things and think to yourself “I could never do THAT”, well this sexual position is kind of like that. The Vulgar Chair requires strength, patience, and an open mind to pull off. But if you do it right, it can bestow the pleasure of the gods upon you. Grab your favorite F buddy and go crazy with this crazy squat sex position. Here\u0027s how to do it.\n\nHim: Lay on your back and lean back with your legs in the air until you are almost doing a half backwards flip. Grab ahold of your partner\u0027s hands for stability.\n\nHer: Squat down backwards on your partner\u0027s junk. Squat on top of him and slide up and down while holding his hands to brace yourself. Keep him in place with your legs and your ass as you grind it out until he explodes.\n\nWhy It Rocks: This sexual position is almost a novelty position. But if you follow these steps, you can get incredible pleasure.\n",
            "translateContentPL": "Znasz tych ulicznych artystów, na których patrzysz, jak robią szalone rzeczy i myślisz sobie “nigdy nie mógłbym tego zrobić”, cóż, ta pozycja seksualna jest trochę podobna. Wulgarne Krzesło wymaga siły, cierpliwości i otwartego umysłu. Ale jeśli zrobisz to dobrze, może obdarzyć Cię boską przyjemnością.\n\nOn: Połóż się na plecach i odchyl się do tyłu z nogami w powietrzu, aż prawie wykonasz półobrót do tyłu. Chwyć partnerkę za biodra dla stabilności.\n\nOna: Przykucnij tyłem na partnerze i przesuwaj się w górę i w dół. Przytrzymaj go tyłkiem w miejscu, aż eksploduje.\n\nDlaczego warto?: Ta pozycja jest niemalże nowością. Jeśli zastosujesz się do powyższych wskazówek, możesz osiągnąć niesamowitą przyjemność.\n",
            "category": "Acrobatic",
            "translateCategoryPL": "Akrobatyczne",
            "URL": "https://sexpositions.club/positions/298.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Screwdriver",
            "translateTitlePL": "Śrubokręt",
            "content": "The screwdriver sex position is one of those quirky sex positions that challenges both parties to mix up a classic sex position. With the screwdriver position, get ready to bend and twist until ultimate penetration is achieved:\n\nHim: As your woman opens her lips to you, facing away, approach her from behind and place your leg leg over her upper thigh. Using your right leg for stability beneath you, hang onto her love handles while you gently plow into her.\n\nHer: Get on all fours like you\u0027re ready for doggystyle sex. Spread your legs wide, arch your back, and pop your pussy high into the air so your man can wiggle his way in.\n\nWhy It Rocks: This rear entry sex position is a twisted take on doggystyle, providing both parties with ultimate control and pleasure. With some patience, maneuver into place for total penetration.\n",
            "translateContentPL": "Pozycja na śrubokręt to jedna z tych dziwacznych pozycji seksualnych, która stanowi wyzwanie dla obu stron. Przygotuj się na zginanie i skręcanie, aż do osiągnięcia ostatecznej penetracji.\n\nOn: Gdy Twoja kobieta otworzy przed Tobą swoją pochwę, odwróć się, podejdź do niej od tyłu i umieść na niej nogę. Używając prawej nogi dla stabilności pod sobą, trzymaj się jej, delikatnie w nią wchodząc.\n\nOna: Ustaw się na czworaka, jakbyś była gotowa na seks w stylu na pieska. Rozłóż szeroko nogi, wygnij plecy w łuk i wysuń pochwę wysoko w powietrze, aby Twój mężczyzna mógł w nią wejść.\n\nDlaczego warto?: Ta pozycja to zakręcona wersja pozycji na pieska, zapewniająca obu stronom pełną kontrolę i przyjemność. Przy odrobinie cierpliwości można tak manewrować, aby uzyskać maksymalnie głęboką penetrację.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/92.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Sagittarius",
            "translateTitlePL": "Strzelec",
            "content": "This standing up sex position will challenge both of you to wiggle your way into place.\n\nThe Sagittarius sex position is not for the faint of heart, especially if you\u0027re a woman. Requiring the man to exercise extreme strength, this standing up sex position provides intense, direct penetration that will raise eyebrows:\n\nHim: You get to stand regularly during this one, although you\u0027re going to be tasked with stabilizing and supporting your woman. Grab her waist with your left hand as she swings her right leg over your right thigh. Pick up her right thigh and position her perfectly atop your cock.\n\nHer: Backwards, snuggle up next to your man as he puts you in place. Put your left hand behind your head for stability, and get ready for some serious penetration that will certainly wake you up.\n\nWhy It Rocks: This is a flexible way to achieve deep, mind-numbing penetration that can be done anytime, anywhere. Just remember to be patient while the woman gets into proper position!\n",
            "translateContentPL": "Ta pozycja seksualna na stojąco będzie wyzwaniem dla Was obojga. Pozycja Strzelca nie jest dla osób o słabym sercu. Wymagająca od mężczyzny ekstremalnej siły, ta stojąca pozycja zapewnia intensywną, bezpośrednią penetrację.\n\nOn: Twoim zadaniem będzie ustabilizowanie i podtrzymanie partnerki. Chwyć jej talię lewą ręką, gdy ona przesunie prawą nogę nad Twoje prawe udo. Podnieś jej prawe udo i umieść ją idealnie na swoim penisie.\n\nOna: Odwróć się tyłem, przytul się do swojego mężczyzny, gdy on umieści Cię na swoim miejscu. Połóż prawą rękę za głową partnera dla stabilności i przygotuj się na głęboką penetrację, która z pewnością Cię rozpali.\n\nDlaczego warto?: Jest to elastyczny sposób na osiągnięcie głębokiej, otępiającej umysł penetracji, którą można wykonać w dowolnym miejscu i czasie. Pamiętaj tylko, aby uzbroić się w cierpliwość!\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/46.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Prison Guard",
            "translateTitlePL": "Strażnik Więzienny",
            "content": "Named for the little space required to get it right, the prison guard sex position is a simple, yet challenging way to fuck deep and hard right out in the open. You can make it work just about anywhere, and here\u0027s how:\n\nHim: You get to simply walk up and assume your woman from behind, grabbing her love handles for stability during the dirty prison style sex.\n\nHer: You have to assume a more flexible position here, which is why stretching out your hamstrings ahead of the devious act might be a good idea. Back onto your man, facing away from him, while you position his cock and bend over as far forward as possible. Bonus points if you can get your head to touch your legs.\n\nWhy It Rocks: The prison guard sex position can be done anywhere, on a plane, at work, at home, in your kitchen, or yes, even in prison. It\u0027s a great standing up sex position to try when you get some time.\n",
            "translateContentPL": "Nazwana ze względu na niewielką przestrzeń wymaganą do jej prawidłowego wykonania, pozycja seksualna strażnika więziennego jest prostym, ale wymagającym sposobem na głęboki i ostry seks na otwartej przestrzeni.\n\nOn: Możesz po prostu podejść i objąć swoją kobietę od tyłu, chwytając jej ręce dla stabilności podczas brudnego seksu w stylu więziennym.\n\nOna: Musisz przyjąć bardziej elastyczną pozycję, dlatego dobrym pomysłem może być rozciągnięcie ścięgien podkolanowych przed tym przebiegłym aktem. Oprzyj się na swoim mężczyźnie, odwracając się od niego, umieszczając jego penisa w sobie i pochylając się jak najdalej do przodu. Punkty bonusowe, jeśli uda Ci się sprawić, że Twoja głowa dotknie Twoich nóg.\n\nDlaczego warto?: Pozycja seksualna strażnika więziennego może być wykonywana wszędzie, w samolocie, w pracy, w domu, w kuchni, a nawet w więzieniu. Jest to świetna pozycja do seksu na stojąco, którą warto wypróbować, gdy oboje macie trochę czasu.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/210.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Nirvana",
            "translateTitlePL": "Nirvana",
            "content": "The nirvana sex position takes missionary style sex to the next level, with a deeper penetration that will feel amazing to both parties. With just a little flexibility, here\u0027s how you can make it happen:\n\nHer: Lay down on the bed with your head down. Get ready to bend your legs straight at a 90-degree angle. Have your man pick up your legs and place them against his body for stability while he gets ready to peg you deeply.\n\nHim: Once your woman lays down, get on your knees and approach her body, placing her legs straight against you. Position yourself so you can drill your cock deep into her lady garden as she playfully plays with her tits in front of you.\n\nWhy It Rocks: Nirvana sex is named so for the pleasurable state of nirvana that is instantaneously achieved. If you\u0027re up for the challenge, the nirvana position will challenge both of you to see sex from a new angle.\n",
            "translateContentPL": "Pozycja Nirvana przenosi seks w stylu misjonarskim na wyższy poziom, z głębszą penetracją, która będzie niesamowita dla obu stron. Przy odrobinie elastyczności, oto jak można ją wykonać:\n\nOna: Połóż się na łóżku. Przygotuj się do zgięcia nóg pod kątem 90 stopni. Niech Twój mężczyzna podniesie Twoje nogi i umieści je przy swoim ciele, aby zapewnić stabilność.\n\nOn: Gdy Twoja kobieta się położy, uklęknij i podejdź do jej ciała, kładąc jej nogi na swoich ramionach. Ustaw się tak, abyś mógł wbić swojego penisa głęboko w jej pochwę.\n\nDlaczego warto?: Pozycja Nirvana jest tak nazwana ze względu na przyjemny stan nirwany, który jest natychmiast osiągany. Jeśli jesteś gotowy na nowe doświadczenie, ta pozycja będzie wyzwaniem dla Was obojga, aby spojrzeć na seks z nowej perspektywy.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/199.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Leapfrog",
            "translateTitlePL": "Leapfrog",
            "content": "This clever standing position places the woman in a frog like stance while deep and illustrious plowing takes place from behind.\n\nIf you love standing sex, the Leapfrog Sex Position is a fun and easy way to achieve total penetration, feeling good for both parties involved. Get into position, legs and hands planted, and open up for backside fucking.\n\nHim: You get to show off your strength in this one, simply standing with your legs slightly spread while you support your woman at her hips. As she backs onto you, help her position herself perfectly, leap frogged and ready to go.\n\nHer: Back onto your man, pussy popped up high, with your legs in-between his, as you bend down forward and use your fingertips to support the upper half of your body. As you get in the rhythm, you\u0027ll start to assume the shape of a frog leaping for joy, begging for more.\n\nWhy It Rocks: This is a generally easy standing sex position that doesn\u0027t require too much flexibility from the woman. Also a backside penetration opportunity, if you take the time to get the angles right, it will feel amazing for both parties.\n",
            "translateContentPL": "Ta sprytna pozycja na stojąco umieszcza kobietę w pozycji przypominającej żabę, podczas gdy głębokie i efektowne rżnięcie odbywa się od tyłu. Jeśli uwielbiasz seks na stojąco, pozycja Leapfrog jest zabawnym i łatwym sposobem na osiągnięcie całkowitej penetracji.\n\nOn: W tej pozycji możesz pokazać swoją siłę, stojąc z lekko rozłożonymi nogami, wspierając swoją kobietę na biodrach. Gdy ona opiera się na Tobie, pomóż jej ustawić się idealnie w pozycji skaczącej żabki, gotowej do akcji.\n\nOna: Oprzyj się na swoim mężczyźnie, z cipką uniesioną wysoko, pochylając się do przodu i używając opuszków palców do podparcia górnej połowy ciała. Gdy wejdziesz w rytm, zaczniesz przybierać kształt żaby skaczącej z radości, błagającej o więcej.\n\nDlaczego warto?: Jest to ogólnie łatwa pozycja seksualna, która nie wymaga od kobiety zbyt dużej elastyczności. Jest to również okazja do penetracji od tyłu.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/235.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Lap Dance",
            "translateTitlePL": "Lap Dance",
            "content": "This is a mutually pleasure-filled sex position that will drive men and women crazy, begging for more.\n\nIf you like to add a little something extra to your sex-making experience, the Lap Dance Sex Position takes it to the next level for both men and women. With extra fondling, double attention, and penetration that is direct and sincere, it\u0027s an easy to achieve lap sex position you\u0027ll want to try this week.\n\nHim: Simply sit down with your legs bent at your knees to either side of you, lean back, and present your cock out and proud for your lady. As she gets onto you, facing away, legs apart, hold her from the front, hanging onto her tits for dear life while she bounces around on top of you.\n\nHer: It\u0027s time for some lap dance sex! Back yourself onto your man slowly, penetrating at your leisure, with your legs spread out to either side. Your hands are free to use in this one, so play with yourself or hold the cock to the right angle down below you while your man fondles your breasts.\n\nWhy It Rocks: If you\u0027re a woman who likes extra foreplay while fucking, or a man that wants to immerse himself in breasts any chance he can, this easy sitting sex position requires a flat surface and that\u0027s it! Give it a spin.\n",
            "translateContentPL": "Jest to pozycja seksualna pełna wzajemnej przyjemności, która doprowadzi mężczyzn i kobiety do szaleństwa. Jeśli lubisz dodawać coś ekstra do swoich doznań seksualnych, pozycja Lap Dance przenosi je na wyższy poziom. Dzięki dodatkowym pieszczotom i penetracji, która jest bezpośrednia i szczera, jest to łatwa do osiągnięcia pozycja, którą będziesz chciał wypróbować w tym tygodniu.\n\nOn: Po prostu usiądź z nogami zgiętymi w kolanach, odchyl się do tyłu i zaprezentuj swojego penisa swojej kobiecie. Gdy ona wejdzie na Ciebie, odwrócona tyłem, z rozstawionymi nogami, przytrzymaj ją od przodu, trzymając się jej piersi, podczas gdy będzie podskakiwać na Tobie.\n\nOna: Nadszedł czas na seks na kolanach! Powoli oprzyj się na swoim mężczyźnie, penetrując go w wolnej chwili, z nogami rozłożonymi na boki. W tej pozycji masz wolne ręce, więc baw się sama ze sobą lub trzymaj penisa pod odpowiednim kątem, podczas gdy Twój mężczyzna będzie pieścił Twoje piersi.\n\nDlaczego warto?: Jeśli jesteś kobietą, która lubi dodatkową grę wstępną podczas seksu lub mężczyzną, który chce zanurzyć się w piersiach przy każdej możliwej okazji, ta łatwa siedząca pozycja seksualna wymaga płaskiej powierzchni i to wszystko! Wypróbuj ją!\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/128.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Elephant",
            "translateTitlePL": "Słoń",
            "content": "Facing each other in a delicate arrangement, hold on tight while you thump and thud your way to cumming heaven.\n\nThe Elephant Sex Position is one of those wild, crazy, and intimate love making positions that will put you face to face with your love while you ride each other deep and enchantingly.\n\nHim: You get to show off your strength and manliness in this move. Support your woman on your thighs while you wrap her legs around your back, holding her tight at her ass. With your strength enter her, over and over again, supporting her stance while getting really manly.\n\nHer: Let your man carry you, support you, and make love to you the sex position elephant style. Wrap your legs around his back and place your hands behind his neck, holding on tightly while the pleasure ensues.\n\nWhy It Rocks: So long as the man is able to support the weight of the woman, this is an intimate and eye-to-eye lovemaking position that will bring the two of you closer than ever before.\n",
            "translateContentPL": "Pozycja seksualna słonia jest jedną z tych dzikich, szalonych i intymnych pozycji miłosnych, które sprawią, że staniesz twarzą w twarz ze swoją miłością.\n\nOn: W tej pozycji możesz pokazać swoją siłę i męskość. Podeprzyj swoją kobietę na udach, podczas gdy jej nogi będą owinięte wokół Twoich pleców, trzymając ją mocno za tyłek. Dzięki swojej sile wejdź w nią, raz za razem, jednocześnie stając się naprawdę męskim.\n\nOna: Pozwól swojemu mężczyźnie nosić cię, wspierać i kochać się z Tobą w pozycji seksualnej słonia. Owiń nogi wokół jego pleców i połóż ręce za jego szyją, trzymając się mocno, gdy nadejdzie prawdziwa rozkosz.\n\nDlaczego warto?: Jest to intymna pozycja do kochania się twarzą w twarz, która zbliży Was do siebie bardziej niż kiedykolwiek wcześniej.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/225.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Eiffel Tower",
            "translateTitlePL": "Wieża Eiffla",
            "content": "This is a perfect standing sex position that provides couples with a way to make love hard while whisking off to Paris.\n\nWhat does the Eiffel tower mean sexually? If you like having sex standing up, the Eiffel Tower Sex move is an easy way to make it happen, requiring nothing but a little flexibility from the lady. The Eiffel Tower Position enables great pleasure for both parties, with a doggystyle entrance from behind.\n\nHim: You get to stand and simply grab your woman\u0027s hips from behind, plowing her hard and providing her balance while she bends forward.\n\nHer: This requires a little bit of limber movement in your legs and back as you bend forward to create an arch with your body. As you assume position and create Eiffel tower sex definition, plant your palms firmly on the ground while your man does the rest.\n\nWhy It Rocks: The Eiffel Tower Sex Position requires no furniture, wall, or space to get it right. If the woman is willing to be head down, after some patience and stretching, it can be a relatively comfortable fucking experience.\n",
            "translateContentPL": "Jeśli lubisz uprawiać seks na stojąco, pozycja seksualna Wieża Eiffla jest łatwą pozycją, nie wymagającą od kobiety nic poza odrobiną elastyczności. Pozycja wieży Eiffla zapewnia wielką przyjemność dla obu stron.\n\nOn: Stajesz i po prostu chwytasz swoją kobietę za biodra od tyłu, mocno ją penetrując i zapewniając jej równowagę, podczas gdy ona pochyla się do przodu.\n\nOna: Wymaga to trochę gibkiego ruchu, gdy pochylasz się do przodu, tworząc łuk swoim ciałem. Przyjmując pozycję wieży Eiffla, połóż dłonie mocno na ziemi, podczas gdy Twój mężczyzna zrobi resztę.\n\nDlaczego warto?: Pozycja seksualna wieży Eiffla nie wymaga żadnych mebli, ścian ani przestrzeni, aby wykonać ją prawidłowo. Po odrobinie cierpliwości i rozciągania, może to być stosunkowo komfortowa pozycja.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/229.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Downward Dog",
            "translateTitlePL": "Na Pieska z Głową w Dół",
            "content": "Every man\u0027s favorite position is probably downward dog sex, grabbing his woman from behind with primitive force while pleasuring her into the wee hours of the morning. With the Downward Dog Sex Position, this kinky and dominatrix style domination leaves the woman helplessly screaming for more. Here\u0027s how:\n\nHim: Of all the different doggystyle positions, this one places you in ultimate control as you enter her from behind. For ultimate penetration, place her face down on the bed while you kneel on the floor, grabbing her arms and locking them to her back so she can\u0027t move.\n\nHer: Get on your knees on the ground and lay your torso on the bed, face down. Allow your man to enter you, grabbing your arms behind your back so you can\u0027t move or resist. This downward dog sex style will leave you sexually helpless and begging for more.\n\nWhy It Rocks: Every man loves doggystyle sex – it\u0027s a known fact. If you\u0027re a woman looking to be dominated and punished for the bad girl you\u0027ve been, this is an easy position that requires an elevated surface. Otherwise, get to work!\n",
            "translateContentPL": "Ulubioną pozycją każdego mężczyzny jest prawdopodobnie seks na pieska, w którym chwyta swoją kobietę od tyłu z prymitywną siłą, jednocześnie sprawiając jej przyjemność do białego rana. Dzięki pozycji seksualnej Na Pieska z Głową w Dół, ta perwersyjna i dominująca pozycja pozostawia kobietę bezradnie krzyczącą o więcej. Oto jak to zrobić:\n\nOn: Spośród wszystkich różnych pozycji na pieska, ta daje Ci ostateczną kontrolę, gdy wchodzisz w nią od tyłu. Aby uzyskać najlepszą penetrację, połóż ją twarzą w dół na łóżku, uklęknij na łóżku, chwytając jej rękę i blokując ją na plecach, aby nie mogła się ruszyć.\n\nOna: Uklęknij i połóż tułów na łóżku, twarzą w dół. Pozwól swojemu mężczyźnie wejść w Ciebie, chwytając rękę za plecami, abyś nie mogła się poruszać ani stawiać oporu. Ten styl seksu na pieska sprawi, że będziesz  bezradna i będziesz błagać o więcej.\n\nDlaczego warto?: Każdy mężczyzna uwielbia seks na pieska - to fakt. Jeśli jesteś kobietą, która chce zostać zdominowana i ukarana za bycie niegrzeczną dziewczynką, jest to łatwa pozycja do wykonania. Do dzieła!\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/230.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Dolphin",
            "translateTitlePL": "Delfin",
            "content": "The Dolphin Sex Position is perfect for couples looking to mix things up while trying a classic stand and carry sex pose. Dolphin style sex is perfect for those wishing to join the mile-high club, requiring little space or furniture – just some kind of support rest to keep your balance while the thrusting ensues. Here\u0027s how:\n\nHim: You\u0027re in charge of keeping your woman balanced while supporting her right leg as it bends upward above yours. Grab her leg at the knee and use your opposite hand to grab her ass for stability while you drill into her, standing up.\n\nHer: Once your man grabs your right leg, tilt your body halfway away from him, using the wall with your left hand to stabilize your balance. The dolphin sex position does require some agility on your part, so don\u0027t be afraid to go style while you get your balance.\n\nWhy It Rocks: The dolphin position is an easy way to bust into love thrusting anytime, anywhere. If you have the patience to get the twisting into position for perfect dolphin style sex, the reward is definitely worth it.\n",
            "translateContentPL": "Pozycja seksualna delfina jest idealna dla par, które chcą urozmaicić swoje igraszki. Seks w stylu delfina jest idealny, wymagający niewielkiej przestrzeni lub mebli - wystarczy jakieś podparcie, aby utrzymać równowagę podczas penetracji.\n\nOn: Ty jesteś odpowiedzialny za utrzymanie równowagi swojej kobiety, jednocześnie podpierając jej prawą nogę, która wygina się w górę. Chwyć jej nogę i użyj przeciwnej ręki, aby złapać jej tyłek dla stabilności, podczas gdy będziesz ją penetrował na stojąco.\n\nOna: Gdy Twój mężczyzna złapie Twoją prawą nogę, odchyl swoje ciało, używając lewej ręki do podparcia się o ścianę, aby utrzymać równowagę. Pozycja seksualna delfina wymaga pewnej zwinności z Twojej strony.\n\nDlaczego warto?: Pozycja delfina to łatwy sposób na miłosne igraszki w dowolnym miejscu i czasie.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/106.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Corkscrew",
            "translateTitlePL": "Korkociąg",
            "content": "The Corkscrew Sex Position is one of those classic “porn” sex positions plastered around the Internet today. It makes for quite the show, and opens the female up for full, deep exposure. Slightly animalistic, there\u0027s something delicious and alluring about it. Here\u0027s how to make it happen:\n\nHim: Get down on your knees and grab your woman from an angle, facing away from you. Place her right leg atop your hip, opening her up while her other leg remains relax at your knees. As she grabs your back, from the side, enter her slowly until you get the rhythm moving.\n\nHer: This pose requires some agility on your end. Place your right leg over your man\u0027s hip, facing away from him, opening up while your left leg remains on the bed. With your right arm, grab onto his back and hold on tight.\n\nWhy It Rocks: This is a deep sex position for ultimate pleasure that places both parties in direct contact with one another. If taken slow with patience, you\u0027ll experience some of the best sex in your life. Get ready to hang on tight and remember to keep your body relaxed.\n",
            "translateContentPL": "Pozycja korkociągu to jedna z tych klasycznych pozycji seksualnych, które są dziś rozpowszechniane w Internecie. Stanowi niezłe widowisko i zapewnia kobiecie pełną, głęboką penetrację. Nieco zwierzęca, ma w sobie coś zachwycającego i pociągającego.\n\nOn: Uklęknij i chwyć swoją kobietę pod kątem. Umieść jej prawą nogę na swoim biodrze, podczas gdy jej druga noga pozostaje rozluźniona pod Twoim kroczem. Wejdź w nią powoli, aż złapiesz rytm.\n\nOna: Ta pozycja wymaga pewnej zwinności z Twojej strony. Umieść prawą nogę nad biodrem swojego mężczyzny, podczas gdy lewa noga pozostaje luźno pod kroczem Twojego partnera.\n\nDlaczego warto?: Jest to zmysłowa pozycja seksualna zapewniająca najwyższą przyjemność, w której obie strony mają ze sobą bezpośredni kontakt. Jeśli wykonasz ją powoli i cierpliwie, doświadczysz najlepszego seksu w swoim życiu.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/218.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Bicycle",
            "translateTitlePL": "Rower",
            "content": "This is certainly a creative sex position, one that is relaxing and easy for the man to maneuver. As for the ladies, get ready to get in some back stretches, while you arch your body into a perfect position for deep and illustrious sex. Here\u0027s how:\n\nHim: Bicycle sex is awesome for guys, requiring them to do nothing except stand up straight and hold onto their women, at the hips, through the motion. Show off your arm strength in this position, providing her with support while you take her from behind.\n\nHer: Form an arch with your body, balancing your front with your hands while you look down. Your man will grab you from behind, with his legs spread out around yours, entering you with ease and poise. Hold still and let it rock and roll.\n\nWhy It Rocks: The Bicycle Sex Position requires no bed or furniture to make it happen. That way you can assume position anywhere, anytime, requiring little agility to achieve that perfect synergy.\n",
            "translateContentPL": "Jest to z pewnością kreatywna pozycja seksualna, która jest relaksująca i łatwa w wykonaniu dla mężczyzny. Jeśli chodzi o Panie, przygotuj się na kilka wygibasów, aby ułożyć swoje ciało w idealnej pozycji do głębokiego i wspaniałego seksu.\n\nOn: Pozycja seksualna Rower jest niesamowita dla facetów, ponieważ nie wymaga od nich niczego poza wyprostowaniem się i trzymaniem kobiety za biodra podczas seksu. Pokaż swoją siłę ramion w tej pozycji, zapewniając jej wsparcie, gdy bierzesz ją od tyłu.\n\nOna: Uformuj łuk swoim ciałem, równoważąc przód rękami, patrząc w dół. Twój mężczyzna chwyci Cię od tyłu, z nogami rozłożonymi wokół Twoich, wchodząc w Ciebie z łatwością i opanowaniem. Nie ruszaj się i daj się rozbujać.\n\nDlaczego warto?: Pozycja seksualna Rower nie wymaga łóżka ani mebli. Możesz ją przyjąć w dowolnym miejscu i czasie.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/220.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Ballerina",
            "translateTitlePL": "Baletnica",
            "content": "This stand and carry form of sex requires both parties to be agile, flexible, and ready to assume awkward physical positions for maximum pleasure. This one is not for the faint of heart, and if you don\u0027t like exerting yourself during sexy time, then you\u0027re not going to like this split sex position. Here\u0027s how to make the Ballerina Sex Position come to life:\n\nHim: Lucky for you, you simply need to maintain a tall, erect pose so your woman can dance around you. She will be using your neck as the rest for her hand and ankle, where she grabs her foot to create the ballerina stance that opens her up for direct penetration.\n\nHer: Get ready to pull out all of the moves. You will need a furniture piece for balance. Gently lift one leg above your lover\u0027s head, grabbing it with the hand on the same side of the body. Stabilize yourself with the other hand, and let him do the rest.\n\nWhy It Rocks: If you have the strength and agility to hold the ballerina position, get ready for some of the most amazing sex in your life. Due to the position, enjoy deep, meaningful penetration that will produce screams by the end.\n",
            "translateContentPL": "Ta forma seksu wymaga od obu stron zwinności, elastyczności i gotowości do przyjmowania niewygodnych pozycji fizycznych dla maksymalnej przyjemności. Ta pozycja nie jest dla osób o słabym sercu, a jeśli nie lubisz się wysilać podczas seksu, to ta pozycja nie przypadnie Ci do gustu.\n\nOn: Na szczęście dla Ciebie, musisz po prostu utrzymać wysoką, wyprostowaną pozę, aby Twoja kobieta mogła tańczyć wokół Ciebie. Będzie ona używać ściany przed sobą, aby stworzyć postawę baletnicy, która otworzy ją na bezpośrednią penetrację.\n\nOna: Będziesz potrzebować ściany dla równowagi. Delikatnie unieś jedną nogę nad głowę partnera. Ustabilizuj się rękoma, opierając się o ścianę przed sobą.\n\nDlaczego warto?: Jeśli masz siłę i zwinność, aby utrzymać pozycję baletnicy, przygotuj się na najbardziej niesamowity seks w swoim życiu. Dzięki tej pozycji możesz cieszyć się głęboką, znaczącą penetracją, która pod koniec wywoła prawdziwe okrzyki.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/130.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Aquarius",
            "translateTitlePL": "Wodnik",
            "content": "This is one of those fun sex positions for girls, placing all of the heavy lifting on the guy. It\u0027s a great starter sex position for couples looking to experiment, as it requires minimal strength or flexibility from both parties. Spend some time getting the angling right so you both feel like it\u0027s working for you.\n\nHim: Saddle up cowboy and grab your woman like a man. This is a great sex position in bed in which you can show her your manliness, spreading her legs and allowing her lower half to rest on the support of your thighs. Grab onto her hips to keep her steady.\n\nHer: If you love sex positions in which you feel like you are being dominated, the Aquarius sex style is right for you. Lay back, and allow your partner to grab you like a man, pull you close, and penetrate you in style. You can simply lay back, relax, and let him do all the work.\n\nWhy It Rocks: This is a user-friendly sex position that feels good to both men and women, requiring little acrobatic experience, flexibility, or strength to get it right. With a little practice, find the angle that works for the both of you, and ride the night away.\n",
            "translateContentPL": "Jest to jedna z tych zabawnych pozycji seksualnych dla kobiet, w której cały ciężar spoczywa na facecie. Jest to świetna pozycja dla par, które chcą poeksperymentować, ponieważ wymaga minimalnej siły i elastyczności od obu stron. Poświęćcie trochę czasu na odpowiednie ustawienie się.\n\nOn: To świetna pozycja seksualna, w której możesz pokazać jej swoją męskość, rozkładając jej nogi i pozwalając jej dolnej połowie ciała spoczywać na Twoich udach. Chwyć ją za biodra, aby utrzymać ją stabilnie.\n\nOna: Jeśli uwielbiasz pozycje seksualne, w których czujesz się zdominowana, ta pozycja jest właśnie dla Ciebie. Połóż się i pozwól swojemu partnerowi chwycić Cię, przyciągnąć blisko i penetrować. Możesz po prostu położyć się wygodnie, zrelaksować i pozwolić mu wykonać całą pracę.\n\nDlaczego warto?: Jest to przyjazna pozycja seksualna, w której dobrze czują się zarówno mężczyźni, jak i kobiety, wymagająca niewielkiego doświadczenia akrobatycznego, elastyczności i siły.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/5.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Keeper",
            "translateTitlePL": "Keeper",
            "content": "Pull out your table and make sure it is tough because its going to need to be for this move. The Keeper Sex Position is sure to please both of you two and can get you one step closer to the big “O”.  And if you\u0027re a guy looking to please the ladies, this is a favorite sex position for females. Its angles are perfect for hitting her sensual spots. This sex position needs a tabletop, so be sure to break that out. Here\u0027s how to do it.\n\nHim: Stand in front of your lady with your hips slightly parted. Pick her up and put her ass on your tabletop. Grab her hips and grind into her as she lays back on the tabletop.\n\nHer: Brace yourself on the tabletop behind you and spread your legs slightly so he can enter you from the front.\n\nWhy It Rocks: The Keeper Sex Position is guaranteed to make her say “Oh My God!” What else is there to really say. Try it. You\u0027re welcome.\n",
            "translateContentPL": "Wyciągnij stół i upewnij się, że jest solidny, ponieważ będzie potrzebny do tej pozycji. Pozycja seksualna Keeper z pewnością zadowoli Was oboje i może przybliżyć Was o krok do wielkiego orgazmu. Jeśli jesteś facetem, który chce zadowolić kobietę, to jest to ulubiona pozycja seksualna kobiet.\n\nOn: Stań przed swoją kobietą z lekko rozchylonymi biodrami. Podnieś ją i połóż jej tyłek na blacie. Chwyć ją za kolana i wejdź w nią, gdy położy się na stole.\n\nOna: Połóż się na stole i lekko rozłóż nogi, aby Twój partner mógł wejść w Ciebie od przodu.\n\nDlaczego warto?: Pozycja Keeper gwarantuje, że kobieta krzyknie “O mój Boże!”. Cóż więcej można powiedzieć.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/422.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Superman",
            "translateTitlePL": "Superman",
            "content": "Superman is the hero to beat all heroes. And if you want to be a hero in the bedroom, then the superman sex position is the best move to use. That\u0027s right, this move will shock her to her core and giver her one sex session to remember. The superman sex move has all the bells and whistles a great sex move should. Maybe you\u0027re just looking for a lifting sex position, whatever your situation is, you\u0027ll love this move.\n\nHim: Stand up with your legs separated so you can carefully lift your partner. Bend your legs slightly. Grab your lady from behind, pick her up, and put her on your member. Hold onto her hips as tightly as possible as you grind into her from behind.\n\nHer: Relax and let your partner pick you up. Once he does, lift your legs backwards and wrap them around his hips.\n\nWhy It Rocks: The superman sex position is a great lifting sex position for exercise and it also makes you look like you could do anything. Who wouldn\u0027t want that?\n",
            "translateContentPL": "Jeśli chcesz być bohaterem w sypialni, to pozycja seksualna Superman jest najlepszym wyborem. Zgadza się, ta pozycja zszokuje ją do głębi i zapewni jej niezapomnianą sesję seksualną. Szybko ją pokochasz!\n\nOn: Stań z rozstawionymi nogami, abyś mógł ostrożnie podnieść partnerkę. Lekko ugnij nogi. Chwyć swoją kobietę od tyłu, podnieś ją i połóż na swoim członku. Przytrzymaj jej biodra tak mocno, jak to możliwe, wchodząc w nią od tyłu.\n\nOna: Zrelaksuj się i pozwól partnerowi podnieść Cię. Gdy już to zrobi, unieś nogi do tyłu i owiń je wokół jego bioder.\n\nDlaczego warto?: Pozycja Supermana jest świetną pozycją do treningu, a także sprawia, że wyglądasz, jakbyś mógł zrobić wszystko. Kto by tego nie chciał?\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/118.html",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Bulldog",
            "translateTitlePL": "Buldog",
            "content": "Get your doggie style on in a whole new way. The Bulldog Position is the ideal sex position for couples wanting to spice things up. This sex position with him on top keeps things sexy and tantalizing for both parties. So why is it called the Bulldog? Well, let us tell you.\n\nHer: Get on your hands and knees. Spread your legs a little wider than your hips. Twist backwards to make eye contact with your partner.\n\nHim: Climb on top of your partner with your knees hugging the sides of her hips and with your toes on your tips. Put your hands into a fist just like a bulldog. Give your girl a kiss right on the lips as you hump her like the dog you are.\n\nWhy It Rocks: Hands down this is one of the top sex positions with him on top. The bulldog position gives you the intimacy you crave with the dirtiness to keep things hot.\n",
            "translateContentPL": "Poznaj styl na pieska w zupełnie nowy sposób. Pozycja Buldoga to idealna pozycja seksualna dla par, które chcą urozmaicić swoje igraszki. Ta pozycja sprawia, że wszystko jest seksowne i kuszące dla obu stron. Dlaczego więc nazywa się Buldog? Cóż, pozwól nam powiedzieć.\n\nOna: Połóż się na rękach i kolanach. Rozłóż nogi nieco szerzej niż biodra. Obróć się do tyłu, aby nawiązać kontakt wzrokowy z partnerem.\n\nOn: Wespnij się na partnerkę z kolanami przytulonymi do jej bioder, stojąc na czubkach palców u stóp. Zaciśnij dłonie w pięści. Daj swojej partnerce buziaka prosto w usta, przytulając się do niej jak pies, którym jesteś.\n\nDlaczego warto?: Jest to jedna z najlepszych pozycji seksualnych z mężczyzną na górze. Pozycja Buldoga zapewnia intymność, której oboje pragniecie.\n",
            "category": "Kneeling Or Standing",
            "translateCategoryPL": "Klęcząc lub stojąc",
            "URL": "https://sexpositions.club/positions/68.html",
            "isRevealed": "false",
            "isFavourite": "false"
        }
    ]
}