{
    "table": "Positions",
    "positions": [
        {
            "title": "Seesaw Sex Position",
            "content": "Who said seesaws were just for kids? The seesaw sex position is a creative way to achieve pure orgasm while rocking back and forth into pleasure-filled wonder. Here\u0027s how to make it happen:\n\nHim: With seesaw sex, it\u0027s up to you to drill your dick deep into your woman as you press down on her. On all fours, place your hands to either side of her head with your legs spread, yet touching at the feet. Ease your cock into her vaginal canal and start to thrust.\n\nHer: Get ready to bend and move as you lay on your back with your legs direct in the air. Your man will press against them, hard, until you\u0027re bent in two, drilling into you as you hold onto the backs of his thighs.\n\nWhy It Rocks: This relatively easy sex position is a great fix up for women looking to feel a new kind of pleasure. With the seesaw position, rock and ride, just like when you were kids, until you both hit that sweet G spot.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Scorpion Sex Position",
            "content": "The scorpion sex position is a gentle rear entry sex position that will provide you and your partner with the quintessential pleasure that is only possible from sweet and dirty backside fucking:\n\nHim: As your woman lays down on her stomach, hugging her pillow, brush yourself up against her ass. Place your hands on either side of her for stability as your thrust your cock into her warm vagina, hidden by her soft ass cheeks.\n\nHer: Lay on your stomach, with a pillow beneath you, as you stabilize your upper half with your forearms. Spread your legs slightly so your man can easily enter you with a warm welcome.\n\nWhy It Rocks: Rear entry sex is an incredibly pleasure-filled sensation for both parties, providing the woman with control over penetration. Get ready to fuck like rabbits, simply atop a pillow.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Scissors Sex Position",
            "content": "Scissor your way into place for cock-to-vaginal penetration you\u0027ll never forget.\n\nThe scissors sex position is a unique take on a time-old lesbian way of love-making. With the scissoring sex position, connect your bodies at the middle as you do the dirty act until both parties are cumming:\n\nHim: As your woman lays on her back, snuggle your way in-between her legs with your one leg beneath her, and the other leg on top of her. Use your left arm to stabilize your torso as you wiggle your cock into her vagina.\n\nHer: Lay on your back, with your legs bent at your knees. Place your right leg on top of your man, and the left leg below him. Spread them wide to provide him with plenty of penetration room.\n\nWhy It Rocks: The sex position of scissoring provides both parties with the ability to intimately connect in the middle. Wiggle around until you get it just right – and trust us, you\u0027ll know when that happens.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Reverse Missionary Sex Position",
            "content": "The reverse missionary sex position is one of those creative sex positions that challenges both parties to think outside the box. So what is reverse missionary sex? Let\u0027s look at it below:\n\nHim: You\u0027re going to have to dig deep for this one, as you get on your stomach, lifting yourself up with your hands. You have to get on your woman after she\u0027s already laid down, facing away from her. With the right contortion, feeling the entry of her pussy with your cock.\n\nHer: This one is easier for you. Lay down completely with your legs together as you bend them at the knee. Be patient as your man positions himself on top of you. Help him find your vaginal entry and get ready for very interesting sex.\n\nWhy It Rocks: The reverse missionary position is a totally new take on a time old sex position classic. Definitely exercise patience in this one, because it will take some time to get it right.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Rear Entry Sex Position",
            "content": "Rear entry sex provides a kind of sexual penetration that is so euphoric feeling, you come crawling back for more. Rear entry sex position is no stranger to backside penetration, which is why you and your partner will definitely want to try it today:\n\nHim: Get ready to assume your manliness as you enter your woman from behind. Position yourself over her back with your arms used to stabilize yourself as you thrust away into her pussy. Sex from the rear feels absolutely amazing, there\u0027s no denying it.\n\nHer: Lay on your stomach, craning your knees so your legs are propped into the air. Use your arms to grab your legs, opening up your pussy to full rear entry penetration.\n\nWhy It Rocks: With a little patience, this puzzle-piece sex position from behind is a great way to achieve total pleasure in no-time. Take your time with it, because by the end, it\u0027s totally worth it.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Prone Bone Sex Position",
            "content": "The prone bone sex position is a great way to take your lover from behind while still making it comfortable and intimate. With prone bone sex, you can even make it your own with a little customization. Here\u0027s how to do it:\n\nHim: Wait for your woman to lay down as you spread your legs and gently sit on the back of her upper thigh. Stabilize yourself by grabbing her love handles as you spread her ass cheeks and sink your dick deeply into her warm and inviting pussy.\n\nHer: Lay down on your stomach, with your arms in front of you for stabilization. That\u0027s it! It\u0027s up to your man to position himself correctly behind you for perfect penetration.\n\nWhy It Rocks: The prone sex position is a great way to connect with just a flat surface or bed available. With prone bone sex, take your time to really position yourself correctly so that it feels amazing for all parties involved.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Normal Sex Position",
            "content": "There\u0027s something to be said for the normal sex position: it\u0027s easy, it\u0027s intimate, and it feels good. If you\u0027re into sex positions for “normal” people, here\u0027s how easy it is to make love the classic way:\n\nHim: Simply get on your knees, awaiting your woman as she lays down with her legs spread. Gently enter her as you connect your groin with hers, laying your body closely against her figure while you start to make sweet love to her. Support yourself with your arms in front of you.\n\nHer: Lay back, spread your legs, and get ready to greet your man intimately during the normal sex position. Hold his back and his buttocks while he slowly makes love to you.\n\nWhy It Rocks: There\u0027s nothing easier than the normal sex position, which is why it\u0027s a great starter position for you and your partner. If you\u0027re looking to deeply connect, this is one way to do it.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Mercenary Sex Position",
            "content": "Everyone around the world has either heard of mercenary sex, or has tried it out at one time or another. Since it\u0027s easy, direct, and pleasurable for both parties, it\u0027s no wonder the mercenary sex position is the preferred position for virgins wading into the world of sexy time.\n\nHim: You\u0027re in control with this one, while you edge up to your woman, with her legs spread and in the air. Ease in-between her legs as you sink into her pussy, stabilizing the upper half of your body with your arms planted on the bed or against the wall.\n\nHer: Simply lay back and get ready to ride with the mercenary position. Spread your legs, bend them at the knee, up in the air, while your man gets settled.\n\nWhy It Rocks: It doesn\u0027t get much easier than the mercenary sex position, which is why it\u0027s a super user-friendly option for you and your partner to test out during the beginning of intercourse. It\u0027s always good to start with the basics.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Legs Up Sex Position",
            "content": "This is another legs up sex position that provides the man with a direct angle for ultimate, creamy penetration.\n\nIf you\u0027re looking to take your sex life to the next level, the Legs Up Sex Position is a great way to make direct contact, with nothing stopping the penis from full, creamy vaginal penetration. Get yourself shifted and in legs up position for a crazy and wild night.\n\nHim: Tap into your animalistic side as your ease yourself into your woman, with your arms carefully planted on either side of your head for weight distribution. Spread your legs substantially at the knee so you are able to sink in deeply.\n\nHer: Lay on your back, put your legs in the air, and allow your man to use the pressure of your body to keep your legs pushed back into place. Hold onto his torso while he drills you so deeply, you\u0027ll be gasping for air.\n\nWhy It Rocks: If you like to bang in a sex position legs up stance, this easy sex act is one for you. Be patient while the woman\u0027s legs bend into place at the knee and remember to take in slow while everyone gets the right angle going.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Legs Over Shoulders Sex Position",
            "content": "If you like sexual penetration that is so thick and so deep you\u0027re left gasping for air, this is a sex position for you.\n\nLegs on shoulder sex sets the scene for an animalistic fucking routine that gets down and dirty where other people won\u0027t go. If you\u0027re ready for a Legs Over Shoulder Sex Position that is acrobatic, naughty, and direct, this one gets the job done.\n\nHim: Nothing feels better than direct and deep penetration, providing your cock with a total massage. Allow your woman to bend her legs up and over while you drill down, keeping her in place, as she screams for more.\n\nHer: Lay on your back, pull your legs up in the air, and place your hands on the backs of your thighs to keep your legs in place. Allow your man to ease onto you while he uses his hands to support the majority of his weight.\n\nWhy It Rocks: Legs on shoulder sex is a favorite sex position for most men out there, opening up the woman to total exposure. Remember to take it slow at first while her pussy breaks in and opens up for this kind of ramming.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Lazy Dog Sex Position",
            "content": "If you\u0027ve had a long day and want to take it from behind, the Lazy Dog Sex Position is an easy and cum-filled experience waiting for you.\n\nWe all know how tiring our days can be, which is why the Lazy Dog Sex Position is an easy way to plow from behind and scream into the night. The lazy dog sex act is actually how it sounds, and you\u0027re going to love it once you try it.\n\nHim: What guy doesn\u0027t love doggystyle sex? Aim over your woman as she lays on her stomach and use your left hand to support her abdomen underneath you. Balancing with your right hand, plow deep into her warm and open pussy while she waits for you to make sweet love.\n\nHer: Lay flat and forward, with your arms support your head and neck upwards. That\u0027s it! The rest is up to your man, and if you love taking it from behind, this is a lazy way to easily cum without doing very much at all.\n\nWhy It Rocks: Sometimes, we all need a lazy out, even if we\u0027re feeling super horny. This is a sex position everyone can do in a bed, or even on a floor. For the ladies, you really have to do nothing, while your man lights up your world.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Flat Iron Sex Position",
            "content": "The Flat Iron Sex Position is a classier doggystyle lovemaking act that leaves both parties incredibly satisfied.\n\nIf you are someone who loves sex from behind, then the Flat Iron Sex Position is a more elegant way to go about it. This is one of those new positions to try the next time you two are in the fucking mood.\n\nHim: Show off your pegging skills while you lower yourself onto your woman, supporting the majority of your weight with your hands on either side of her to the front. Enter her from the back and ease into it for ultimate pleasure.\n\nHer: Lay down on your front, submitting to your man, with your arms helplessly at either side of you. Spread your legs slightly, with a bend at the knee, so he can fondle and enter your wet and welcoming pussy.\n\nWhy It Rocks: Both men and women love sex from behind, and this position is one way to mix things up, requiring a bed or a hard surface to make it happen. For comfort, try placing a pillow between the woman and the bed so the angling isn\u0027t uncomfortable.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Eagle Sex Position",
            "content": "If you like deep, penetrative sex that leaves nothing to the imagination, get ready to fly like an eagle.\n\nThe Eagle Sex Position is a great way for couples to feel total, unadulterated, and pure penetration, digging deep until you both explode in a cumming scream.\n\nHim: The Eagle Position places you in a traditional military style pose, except this time, drilling down hard while you hover over your woman. Place your lady below you, with her legs pushed up and bent back. Give her some time to stretch into position as you ease your weight down, using her thighs to support you. Enter and get to work.\n\nHer: You get to lay on your back for this one. But, it does require some flexibility in the hamstrings region. Place your legs in the air and bend them back, using your man\u0027s weight to keep them back while he enters you.\n\nWhy It Rocks: This is a very easy sex position, taking the military pose to the next level, requiring just a flat service or bed to get it right. Get ready to dip deep.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Deck Chair Sex Position",
            "content": "The Deck Chair Sex Position is a must try, deep penetration position that enables the man to assume control and go in, full access. Requiring a flat surface and nothing else, it can be performed anywhere – perhaps, even outside on your deck? Let\u0027s see how:\n\nHim: Bending your women essentially in half, facing you, enter her from above, holding her tight and open with your hands while her legs wrap around your back. Be sure to keep your balance on your knees so your entire weight is not crushing her.\n\nHer: Lay on your back, legs up in the air and spread, while your man enters you. Wrap your legs around his back and allow him to position himself for ultimate, deep penetrative access. Go slow with this one while he breaks you in.\n\nWhy It Rocks: If you have the right patience to go slow with the deck chair position, this can be one of the most deeply penetrative positions out there. With a little time in the beginning, get your rhythm down and thrust away your cares and worries.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Cat Sex Position",
            "content": "You might be asking yourself: what is the cat position? This unique sex pose is essentially the opposite of the military sex position, placing the man\u0027s legs to the outside of the women\u0027s while he works his way into her. If you\u0027re interested in learning more about the Cat Sex Position, follow with us below:\n\nHim: The cat style position requires from flexibility on your end, as you lay on top of your woman, with your legs spread apart while hers fit snuggly between yours. This cat position requires some dexterity on your end to find the right angle to penetrate her without the convenience of her legs being spread apart.\n\nHer: What could be better than this pose? You can simply lay back and let the man to all of the work. Relax, close your eyes, and enjoy the ride, ladies!\n\nWhy It Rocks: This is an incredibly easy sex position for both parties to perform, requiring nothing but a bed or a surface. As for the ladies, you get to drift off into orgasmic heaven, never looking back!\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Cancer Sex Position",
            "content": "As a classic sex position on the stomach, the Cancer Sex Position is a more intimate and deeper penetrating version of doggystyle, with a closer embrace and deeper sex than other sex positions today. If you\u0027re ready to really immerse yourself in luxurious sexual pleasure, here\u0027s how:\n\nHim: This is an incredibly easy and comfortable sex position for you, requiring you to do nothing but plow from behind, using your hands as stabilization since you will be on all fours. Place your left leg inside her two legs, and your right leg to the outside. Get your balance, and go to town.\n\nHer: If you like easy sex positions that enable you to lay down, then the Cancer Sex Position is a perfect sex position for you! Simply lay down, bend your knees, and place your calves into the air. Hold the bed in front of you, sit back, and let the love making ensue.\n\nWhy It Rocks: This is a pleasurable sex position that is easy for any kind of lover to achieve. All you need is a bed, or even a surface, and some hot, steamy passion while you ride out the night.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Boat Sex Position",
            "content": "This is a more complex sex position, requiring agility, flexibility, and patience from both partners involved in the dirty act. Although it might not look beautiful to a bystander, this classically “lazy sex position” still requires some clever movement to get it right. Here\u0027s how:\n\nHim: You\u0027re going to need a surface or blanket to grab onto as you take your woman from behind. With her legs spread, place your left leg between hers, and your right leg on the outside of her right leg. Angle yourself correctly, grab the blanket for balance, and go to town.\n\nHer: Lay down on your stomach, bend your legs at the knees, and spread them while the man angles himself into you. For the best feeling, position yourself at the edge of the bed so you can hold onto it for support while he enters you. Take this one slow, you\u0027ll want to enjoy it.\n\nWhy It Rocks: The Boat Sex Position feels amazing for both partners, as a deep sex position that with the right angle, can be otherworldly. For the best results, do it on top of a bed so you can hang in there.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "21 Sex Position",
            "content": "Are you ready to get down and freaky, in a classic doggystyle love-making pose? Placing both lovers in a way that direct penetration can ensue, the 21 Position will give you that addictive feeling you crave. With little strength or flexibility required, here\u0027s how to get freaky:\n\nHim: Stand up against a bed or piece of furniture (kneeling can work well, too) and grab the woman\u0027s hips in front of you as she stands on all fours. Spread her legs so you can fit in-between, slowly penetrating from behind. Take it slow until she feels comfortable and ready to go.\n\nHer: Get on the bed, on all fours, looking downwards like it\u0027s about to be doggystyle. Allow the man to grab your legs and flexibly stretch them apart so he can press up against your backside. This position will require some flexibility on your end, so feel free to take it slow until you feel comfortable.\n\nWhy It Rocks: The 21 Sex Position is one step freakier than doggystyle, fun for both you and your partner without requiring too much physical strength or stretching. All you need is a bed or a piece of furniture. Remember to take is slow and enjoy the sex position; it\u0027ll feel good for both parties.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Splitting Bamboo Sex Position",
            "content": "They say that bamboo is one of the eco-friendliest woods in the world. But what about your wood? Well, the splitting bamboo sex position will test your wood against the world\u0027s greatest opponent, the female sex organ. So, if you want to try out the splitting bamboo sex position here is a quick rundown of how to do it and love it.\n\nHer: Lie on your back bracing yourself with your forearm on the bed. Kick up one leg into the air as far as it can go. Keep your other leg flat on the surface below you. Keep your head up and enjoy this special move.\n\nHim: Position yourself in between the legs of your partner and sit on the leg that is flat on the surface. Hold onto her leg that is positioned straight up in the air.\n\nWhy It Rocks: The splitting bamboo sex position rocks both of your world\u0027s and it is rather simple to do. Try it out with your partner and see how quickly it becomes your favorite move.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Speed Bump Sex Position",
            "content": "Speed bumps suck, but the speed bump sex position can be less of a nuisance and more of a way to kickstart your evening in. And what is good sex with out a good hump anyways? See what we did there? Yeah, we thought so. If you have ever wanted to know what the speed bump position consists of, then check out our brief overview below.\n\nHer: Lie on your stomach, like you do in many of our man on top positions. Arch your back over a pillow that pushes your hips up in the air. Also, lift one leg in the air as your male partner enters you from behind.\n\nHim: Climb on top of your female partner. Lay on top of her body from the top position. You\u0027ll want to be flesh with her body for the best result. Grind into her, rather than humping her body. Despite the name, the speed bump sex position isn\u0027t about humping, it\u0027s about grinding things out.\n\nWhy It Rocks: The speed bump position is super intimate, and it is pretty easy to do. Forget about humping, focus on the feeling and everything will turn out as it should.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Snow Angel Sex Position",
            "content": "Even in summer, you can be a snow angel! That\u0027s right, the snow angel sex position is a move anyone can add to their must-try list. I mean, maybe you shouldn\u0027t rush to it, because it is one of the more extreme sex positions, but it can get you closer to that sex god level. You don\u0027t have to be one yet to get it, but once you read about it you\u0027ll want to try it. Here\u0027s how to become a snow angel in the bedroom.\n\nHer: Lie on your back. Wrap your legs around your male partner\u0027s hips. Lean forward with your hands on his ass or lower back. Almost like you are doing an ab workout.\n\nHim: Lie on your stomach in the opposite direction of your partner. Scooch your hips back and over her hips and enter her from the opposite direction and on top. Let her wrap her legs around you and place your hands on your body. Get in sphinx pose with your forearms laying down in front of you.\n\nWhy It Rocks: The snow angel sex position is absolutely unique. You probably have never tried it before, but once you do it you\u0027ll learn that you can do more than you thought you could. Oh, and it feels great too!\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Scissor Sex Position",
            "content": "Sex not challenging enough? Getting her close to climax not giving you the opportunity to show off anymore? Then you need to try the scissor sex position. This hard sex position is definitely going to give you a run for your money. Challenges are fun, and when you tackle them with your favorite person in the world they\u0027re even better. Aw, right? Hold off on the sentimental\u0027s until you try this move…\n\nHer: Lie on your back with your head and neck twisted to the right. Kick your leg up in the air and open yourself up. Twist your hips in the opposite direction. Stare into your lover\u0027s eyes. Hold on to his hips with your hand.\n\nHim: Your job is a bit more difficult. Spread your legs with one leg inside her two legs and insert yourself in between her legs put one arm underneath her raised leg and the hold on to her face with your other hand.\n\nWhy It Rocks: The scissor sex position spices up your sex life like nothing else can. It also tests both of your ability to be flexible.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Missionary Sex Position",
            "content": "The missionary sex position is quite possibly the most popular sex position in the world. It is a man on the top move that is designed to get both partners closer to that precious O moment. But what is missionary sex position? How do you do the missionary sex position? Well, today we are going to help you out with nailing missionary style sex. And if you\u0027re wondering why it\u0027s called missionary, it has to do with the puritan notion behind this move.\n\nHer: Lie down on your back with your knees slightly bent and pulled up to your chest. Widen your hips enough for your man to fit completely between them.\n\nHim: Lie on top of your partner with your legs as wide as you can get them. Enter her from underneath and grind into her as you edge your way closer to that coveted moment.\n\nWhy It Rocks: Missionary style sex is always a good stand by for anyone who needs a few classic moves. It feels pretty good too.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Jockey Sex Position",
            "content": "You don\u0027t have to weigh 130 pounds or less to be a jockey! The jockey sex position can turn your dream of being a jockey into a reality. Now, your lady friend probably wouldn\u0027t like to be called a horse, so leave that out of the equation, but don\u0027t hesitate to give her a little slap (if she likes it) on the behind to keep things going. The sex jockey position is sure to become a favorite for you both! Here\u0027s how you do it.\n\nHer: Lay down on your stomach with your body flat on the bed or another surface. Spread your arms out in front of you to cushion your head.\n\nHim: Climb on top of your lady friend like you\u0027re climbing on top of an award-winning race horse. Grab ahold of her cheeks and grind into her. Give her a smack here and there and have a good time.\n\nWhy It Rocks: It\u0027s a sex jockey position, what is not to love? Climb on top and give her an O, you\u0027ll both love this move!\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Flatiron Sex Position",
            "content": "Ever heard of the flatiron sex position? If you haven\u0027t then this is definitely one you\u0027ll want to add into your mix. The flatiron position is super-hot and unique. It\u0027s a great twist on your traditional doggie style sex moves. Looking for a new way to keep her attention and keep things hot? Then you will love this sexy man from behind position.\n\nHer: Lie on your stomach with a pillow underneath your hips. Spread your legs to towards the sides of your bed. Arch your lower back slightly and relax.\n\nHim: Climb on top of her from behind, entering her slowly. Keep your legs flesh together and grab ahold of her hips with one hand and brace yourself on the bed with the other. Pound it out until you both are screaming in pleasure.\n\nWhy It Rocks: The Flatiron sex position is a tantalizingly fun, energetic and super sultry. What\u0027s not to like about doggie style, after all?\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Bumper Cars Sex Position",
            "content": "Beep Beep! Crash into each other with some super sweaty, sexy, and hot sex. The bumper cars sex position is hands down one of the most interesting positions you and your partner can get into. Those bumper cars at the local fair have nothing on this sex position. Try it out for a crazy sex position to try and add to your go-to moves.\n\nHer: Lie on your stomach with your legs spread out behind you. Perch yourself on your forearms like you\u0027re a sphinx. Back up to your man as he positions himself behind you.\n\nHim: Mirror your partner\u0027s moves. Lie on your stomach and spread your legs and then back up with your head looking the opposite direction. Put your legs over the back of your partner\u0027s legs. Grind it out until you both real in pleasure.\n\nWhy It Rocks: It\u0027s super unique and it is sure to get you both closer to that special point.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Anvil Sex Position",
            "content": "Looking for an amazing G-spot position? Then the Anvil Sex Position is sure to fit your bill. Get intimate, up close in personal with your partner as you look intensely in one another\u0027s eyes. It\u0027s also one of the best positions for deep penetration! Get a taste of your favorite meal with this penetrating, pulsating, and delicious leg up sex position. Here\u0027s how to nail it.\n\nHer: Lie on your back and pull your legs all the way up to your breasts and hold your legs as he enters you from on top. Wrap your legs around his neck once he\u0027s on top.\n\nHim: Climb on top of your partner with your legs slightly spread and then penetrate your partner from above. Use your arms to support yourself on either side of your partner.\n\nWhy It Rocks: It\u0027s the best position for deep penetration! Can you say “g-spot”? You won\u0027t have to if you try this move.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Variant Yawning",
            "content": "So many sex positions are boring, overdone, and simply don\u0027t add anything new to your sex life. But the Variant Yawning position is nothing like that. Ladies love sensual sex positions, and with good reason, they give you both a more intimate sex session. And with this move you don\u0027t have to be some flexible athlete. You just have to pay attention to her cues and make her happy. So here\u0027s what you gotta do to nail it.\n\nHer: Lay on her back with a fluffy pillow cradling your head. Spread your legs and put your feet on your partner\u0027s shoulders. Grab ahold of his thighs and enjoy the ride.\n\nHim: Get on your knees in front of her while you crouch over her body. Lean forward enough so you can give her nice, sexy kisses. Spread your hips wide enough so you can thrust into her.\n\nWhy It Rocks: It isn\u0027t one of your standard male dominant sex positions. It\u0027s hot, sexy, and gets you both where you want to go.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Love Train",
            "content": "You know how most dominant male sex positions make you think of Quakers having sex? Yeah, well this position won\u0027t. It\u0027s oh so delicious for both partners and it gives you something new to do in the bedroom. Who wouldn\u0027t want that? It isn\u0027t called the “Love Train” for nothing. And speaking of nuttin\u0027, here\u0027s what you have to do to get there…\n\nHer: Lay on your stomach, pressing your pubic bone into the surface of the bed. Stretch your hands out to the side of your body like a catus. Let him enter you from on top.\n\nHim: Lay on top of your lady sensually and as easily as possible. Don\u0027t belly flop on to her back, you could seriously injure her, ya freak. Position your hips so they align with hers and spread your legs a bit farther apart. Whisper into her ear as you slowly massage her with your male member.\n\nWhy It Rocks: It\u0027s a great twist on traditional dominant male sex positions. It gives you a chance to show her your best moves while you both enjoy the break from more acrobatic moves.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Second Posture of The Perfumed Garden",
            "content": "Have you ever had moments with your partner when you feel like time stops? If you haven\u0027t this man on top sex position is sure to get you there. The Second Posture of The Perfumed Garden sex position will get your toes to curl and your back to bend. Quite literally. Supposedly this man on top sex position is great for men with smaller than average penises, so it might be the right fit for you if you\u0027re looking for something to help get your partner to cross the bridge. Here\u0027s how you do it.\n\nHer: Lay on your back with your legs in the air. Grab onto your partner\u0027s hands and look into their eyes as they drill you into your bed.\n\nHim: Get on your knees and spread your legs as wide as you can as you enter your partner. Grab ahold of your lady\u0027s hands and use them to stabilize yourself as you thrust inside of her.\n\nWhy It Rocks: This man on top position is great for both partners because it infuses intimacy and pleasure at the same time.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Wrap-around Butt-Grab",
            "content": "Want to get your ass grabbed? This position might be your favorite. If you\u0027re looking for sex positions with the man on top, then this is the one to try out. The Wrap Around Butt Grab is a great way to get a handful of flesh for both of you. This position leads with the man on top and with the woman letting her hands wander wherever they may fall. But don\u0027t be shy, this position will get you going to places you didn\u0027t know you could experience. Assume the position with these tips.\n\nHer: Lay down on your back with your feet fairly close together. Wrap your hands around your man\u0027s ass to get a handful of goodness.\n\nHim: Lay on top of her and put your legs on either side of her. Put your pelvis on top of your partner\u0027s pelvis and go to town. Use your hand to hold her head up and kiss her intimately. It will feel amazing.\n\nWhy It Rocks: This position is possibly one of the most intimate positions in our category. You get the closeness you crave without sacrificing the hotness of some of our more jackrabbit positions. It\u0027s so hot!\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Arched Driver",
            "content": "You know those extremely flexible gymnasts who perform at the Olympics every few years? Yeah, this position is the only one we imagine they do. In our list of male dominant positions, this one takes the cake. Arched back, full access to all her best parts, and a fun take on man on top, what\u0027s not to like? Whether you\u0027re looking for a new position to try or have nothing better to do than spend a few hours in the ER post coital, you\u0027ll like this one.\n\nHim: Get on your knees, preferably on your bed or another soft surface. Thrust your pelvis forward and into your partner as her legs rest on your shoulders.\n\nHer: Become a gymnast. No really, brace your shoulders on your bed with your head cushioned by a pillow. Arch your back and thrust your hips forward into your partner\u0027s member.\n\nWhy It Rocks: If you want to add some male dominant positions to your sexual repertoire, this one\u0027s a goody. Men, you can pleasure your partner as she arches her back and ladies, you get a good once over while arched in a pretzel like shape. But hey, you burn extra calories too.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Back Bend Humping Like A Dog",
            "content": "There\u0027s nothing like having a whole roster of sexual positions to impress your woman. Luckily, the back bend humping like a dog position is sure to please both you and your woman. And if your lady happens to be a gymnast, well, bonus points! You\u0027ll both enjoy this position.\n\nHim: Bend down on your knees on a nice soft area, like a bed or some other soft surface. Put your partner\u0027s legs up on your shoulders and lean back slightly while thrusting your hips forward. Hold on to your partner\u0027s hips and get down.\n\nHer: Place your legs on your partner\u0027s shoulders and brace your own shoulders on the bed below you. Stabilize yourself on your bed with your arms and let the motion of the ocean take you to happy town.\n\nWhy It Rocks: It\u0027s fun, unique, and one of our top sexual positions to impress your woman. Get to work on those biceps, though, you\u0027re going to need them to pull this one off.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Seventh Posture Of The Perfumed Garden",
            "content": "Looking for some new sex positions to impress your woman? If so, the Seventh Posture of the Perfumed Garden is a great one to add to your list. It\u0027s hot, it\u0027s sensual, and it sounds like something out of Ancient Greece. And, well, it kinda is. Prepare to be intimate with your partner, this position demands it. Here\u0027s how you plow your partner like a Greek God.\n\nHer: Lay down on your bed on your side, either side is your choice. Spilt your legs in half, with one of your legs resting on your partner\u0027s shoulder. Brace yourself with your arm and let him lead the way.\n\nHim: Slide in between your partner\u0027s legs. Get on your knees with your legs on either side of her legs. Grab ahold of her leg as it rests on your shoulder and use it to grind into her.\n\nWhy It Rocks: It rocks because you\u0027re up close and personal with one another. It\u0027s ideal if you\u0027re looking for new sex positions to impress your woman.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Modified Winged Eros",
            "content": "You don\u0027t have to look far in our selection to find the best dominant male sex positions. Every time you have sex it should be better than the last, at least that\u0027s our motto. This position is particularly hot. It\u0027s animalistic. It looks like the same exact position wild wolves would get into to get crazy. Here\u0027s how you do it to make your woman howl like a wounded animal.\n\nHer: Get on your bed on her hands and knees. Spread your legs and arch your back. Lay back and enjoy the ride.\n\nHim: Climb up behind your partner with your legs laying over top your partner\u0027s legs. Enter her from behind her. Brace yourself with your hands on either side of her body on the bed. Arch over her body with your back curving inward.\n\nWhy It Rocks: The best dominant male sex positions are the sweatiest, or at least that\u0027s what we believe. The Modified Winged Eros gets you both to that ultra-sweet spot.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Traction Control",
            "content": "Want to try out a position that kind of looks like a workout routine? If so, then Traction Control is a good choice. Traction Control makes its way onto our list of male dominating sex positions because it\u0027s all about the man. But that doesn\u0027t mean the ladies don\u0027t get some killer oh and ah moments from “Traction Control.” It\u0027s a dual pleasure position that anyone can do.\n\nHer: Get on your knees on the bed with your hips arched upwards. Allow one leg to fall slightly off the bed, to make it easier on your man to enter you from behind. Let him grab one of your arms once he gets into position.\n\nHim: Climb up behind your lady with your knees slightly agape. Hold onto her hip with one hand and grab her hand with your other. Allow one leg to fall off the bed behind hers. Get going and take things to climax town.\n\nWhy It Rocks: Male dominating sex positions don\u0027t have to be boring. This sex position is a perfect example of that. It\u0027s sexy, animalistic, and makes great angles easy.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The New Mattress",
            "content": "Is there anything better than a brand new mattress? Maybe breaking one in. This sex positions with the man on top will definitely have you breaking in your mattress as fast as you can say, “go to the bedroom.” The good news is, you don\u0027t have to be a porn star to master this position. Just a good mattress and a partner (or blow up doll) is all you need.\n\nHer: Lay down on your back with one arm over your head and one arm grabbing onto your partner. Lift one knee up to your chest with your other leg straight. Let him work his magic and encourage him with soft moans—he\u0027ll love it!\n\nHim: Climb on top (this is a list of sex positions with the man on top, after all) with one leg straight and one knee bent—matching her bent knee. Grind into her for some fun time.\n\nWhy It Rocks: The New Mattress gives you easy access to the best parts of your partner and makes it easy to hit her g-spot. It\u0027s so hot!\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Ice Sculpture aka Double SowCow",
            "content": "You don\u0027t have to be Scott Hamilton (Olympic Gold Medalist) to nail this man on top position. It\u0027s got all the bells and whistles you could want from a sex position. It\u0027s easy to get into this position, it is perfect for angling towards the g-spot, and it looks amazing for the man in the duo. Oh, and it\u0027s got a cute name, what\u0027s not to love?\n\nHer: Get on your hands and knees on your bed. Lift your back leg up like you\u0027re doing kicks at the gym to work out that tight ass. Grind back on your man and get busy on his member.\n\nHim: Get on your knees behind your partner and hold on to her back leg. Thrust into her body as she grinds back into you.\n\nWhy It Rocks: This man on top position lets you both get involved with sex in a whole new way. It\u0027s a great twist on the traditional doggie style position and it feels a-ma-zing!\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Bad Doggy",
            "content": "Male dominant sex positions can be so boring sometimes. That\u0027s why we added this super feel-good position to our man-on-top category. This is one of those positions you do halfway through your sensual love making session and you\u0027re on the brink of exploding in all the best ways. For both of you, this position gives you the edge to reach that high point we are all after. Here\u0027s how you execute The Bad Doggy.\n\nHer: Get on your knees, kind of like a dog (as long as you feel comfortable, of course). Spread your hips wide and lean forward, bracing yourself on the edge of your couch. Keep yourself loose and open as your partner enters you from behind.\n\nHim: Bend down on to your knees behind her. Parallel her legs with your own. Use your hands to brace yourself and slightly thrust into her until you are both barking like the bad dogs you are.\n\nWhy It Rocks: Doggy style is the best. It feels the best, it looks the best, and it lets the best things happen. When it comes to male dominant sex positions, there aint nothing better.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Deep Stick",
            "content": "Looking for the best sex positions for deep penetration? If so, we\u0027ve got your back. The deep stick sex position is a great way to pin your partner with pleasure in all the best ways. Other sexual positions for deep penetration miss one vital component: connection. But not this one. It gets you both back in touch with one another, which makes it a great position for long-term partners. Here\u0027s how you stick the landing and get it right the first time.\n\nHer: Lay on your back with your legs up in the air as far as you can get them or on top of your man\u0027s shoulders. Rock your hips up towards the sky, rather than leaving them flat on the bed.\n\nHim: Get down on your knees in front of your female friend and spread your hips slightly wide. Lean forward over her and use your arms to get good leverage to amp up your thrust game.\n\nWhy It Rocks: This position rocks because it\u0027s a great way to get deep penetration for both partners. Deep penetration is ideal for earth shattering orgasms.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "He is Behind, She is Laying Flat",
            "content": "Every guy knows that doggy style is the best, but what if you wanted to impress someone new? Well, this move is perfect for you. It can be tough coming up with sexual positions to impress your woman, but if you do this one right you\u0027re sure to give her the biggest smile of her life. It\u0027s all about the movement, gentlemen. Here\u0027s how you do it.\n\nHer: Have her lay on her stomach grabbing the headboard or the edge of the bed/couch. Spread her legs slightly, just enough for you to fit in between them.\n\nHim: Get on top of her with your knees bent but fully lean over her back after you move inside her. Put your arms on either side of her and whisper sweet nothings into her ear.\n\nWhy It Rocks: It\u0027s actually a very intimate position. You both get to experience ultimate pleasure without any rigorous exercise. It\u0027s a good finishing move for that reason.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "First Posture of the Perfumed Garden",
            "content": "Looking for new sex positions to impress your woman? You\u0027re not alone, buddy. We\u0027ve covered quite a few positions of the perfumed garden, but this one might blow them all out of the water. It\u0027s super sensual and sure to please her need to get intimate with you. Oh, and it makes it very easy to get yourself to that coveted happy place too. Here\u0027s how you execute.\n\nHer: Let her lay on her back on that soft, cushiony bed you bought her. Have her bend her knees up to her chest with her legs spread. Let her wrap her arms around your neck to stabilize herself from all the motion of your ocean.\n\nHim: Squat down in front of her with your hips spread out enough between her legs to enter her. Rest your hands on either side of her body and get moving, she\u0027s going to expect some great thrusting out of this move.\n\nWhy It Rocks: It\u0027s intimate, it\u0027s hot, and it\u0027s a new sex position to impress your woman right from the start. A twist on a traditional move, it is sure to please both of you.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Eleventh Posture Of The Perfumed Garden",
            "content": "Listen guys, it isn\u0027t easy for women to have an orgasm. Some male dominating sex positions make it even more difficult to achieve. But the Eleventh Posture of the Perfumed Garden is different. It gives you both the edge to thoroughly enjoy your experience. The grinding, turning, thrusting and panting is enough to push anyone over the edge. So give her your best, with this killer male dominant sex position.\n\nHer: Have her lay completely flat on her back with her legs slightly tucked into together. She will naturally wrap her arms around you as you begin to give her unmeasurable pleasure.\n\nHim: Climb on top of her and lay flat out on top with your hands cradling her head, kissing her ever so softly. Widen your hips slightly to make it easier to move in and out of her.\n\nWhy It Rocks: This is one of those male dominating sex positions you both will love. It makes love making so much more intimate and gives you something different from the average dude on top position.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Doggy Style",
            "content": "Doggy style sex positions seem to be a dime a dozen, but this doggie style sex position is sure to please every member of your screw session. Wondering how to do the doggy style sex position? If so, this move is a good place to start. So pull out your leashes and collars, this doggy style sexual position will get you both ready to fetch.\n\nHer: Get on your hands and knees, kind of like a dog but with more dignity. Spread your legs hip width across and brace yourself for impact from behind you.\n\nHim: Straddle your lady\u0027s hips with one of your legs on the outside of one of her legs. Slightly open your hips and begin to go doggy style on her from behind. Hold onto her hips to brace yourself and keep things moving in the right direction.\n\nWhy It Rocks: Doggy style sex positions are the best. They give the lady some amazing angles to work with and give the man some super hot and sexy views to work with.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Cat of The Wife of Indra",
            "content": "Love felines? Then the Cat of The Wife of Indra could be one of your favorite sexual positions man on top. Say “meow” to a brand new sexual position that could make your partner scream in ecstasy. Who would have thought that pounding pussy would be this much fun? And for her, this position is a great way to hit some seriously awesome angles. Fantasize about how good this position feels or dream about your favorite celebrity, this is definitely a position to try out no matter how long you\u0027ve been together. Here\u0027s how to get into it.\n\nHer: Lay on your back with your legs spread up high in the air. Turn your neck slightly to the side and place your legs up on his shoulders for leverage. Sit back, relax, and enjoy the ride.\n\nHim: Get on your knees with your legs spread as far as possible. Brace yourself with your arms on each side of her body. Lean forward with your head down. Grind into her with your hips and make her say, “meow.”\n\nWhy It Rocks: Both partners get to experience the pleasure of some of the best angles.\n",
            "category": "Man On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Side Saddle Sex Position",
            "content": "Ready to try sideways sex? This kind of penetration entry might light up your world.\nSometimes, direct penetration facing one another, or facing away, can get boring. Why not mix it up and sit to the side while the other partner faces forward? Side saddle sex achieves that and so much more for you and your partner:\n\nHim: Lay down on your back, directly straight, with your legs out in front of you. Place one arm behind your back while your woman sits to the side, right on your dick. Allow her to position herself correctly before you start your thrusting.\n\nHer: Facing to the right or left, sit down on your man like he\u0027s a seat, with your arms used to stabilize yourself on his groin. Sink his cock into your vagina as you give him the go ahead to make love with passion.\n\nWhy It Rocks: Many people don\u0027t realize how pleasure-filled the side saddle sex position can be for both partners. See the sexual world from a whole new angle as you add in this new kind of fucking perspective.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Sex Swing Sex Position",
            "content": "The sex swing sex position is an easy-to-achieve state of bliss that requires nothing but a little balance from the woman. Lay down, close your eyes, and allow yourself to drift off in pure bliss:\n\nHim: You get to just lay there, completely flat, with your feet out in front of you. Get ready to stabilize your woman as she sits down on top of you, facing away, riding your dick dirty until you scream.\n\nHer: After your man lays down, to get the sex swing position just right, step down on either side of him, facing away, and ease yourself onto his dick. Once there, place one foot down between his legs, and the other on the bed. Get your stability before you start thumping.\n\nWhy It Rocks: This is a user-friendly reverse style sex position that is a great introductory into the world of fucking while sitting. Take our word for it!\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Riding Sex Position",
            "content": "Get ready to ride each other wild as you saddle up for the adventure of a lifetime.\nThe riding sex position is a great way to stare into each other\u0027s eyes, enjoy and view, and sink into deep and meaningful penetration on top. As one of the best sex positions for women on top, here\u0027s how to make it happen:\n\nHim: Lay back with your arms and legs spread as your place your head on the bed. Crane your head slightly up and stabilize yourself with your feet dug into the blankets as you get ready to thrust deeply in an upward fashion into your woman.\n\nHer: Do you know how to ride during sex? You\u0027re about to find out. Once your man assumes position, spread your legs and sit down on him, facing him, as you gently lower your pussy onto his cock. Once in position, get ready to thrust right alongside him.\n\nWhy It Rocks: This sex position provides every woman with serious control while she goes for the ride of her life on a totally exposed and accessible cock. Men, get ready for an awesome view as her tits bounce up and down during the pounding.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Reverse Sex Position",
            "content": "If you like a woman on top, then the reverse sex position is a great way to make it happen. Sometimes, we all need the deep penetration that comes with a sexual position on top, and here\u0027s why:\n\nHim: Lay down on your back, with your legs craned at your knees. Get ready to show-off your upper body strength and stability while you balance your woman as she rides your dick deeply into the night.\n\nHer: After your man lays down, facing away from him, spread your legs and gently sink your thighs around him while his erect cock slides deeply into your pussy.\n\nWhy It Rocks: Reverse sex position is an easy way to ride each other crazy through direct penetration. Plus, it provides the female with penetration control, ensuring everyone feels great the entire time.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Hot Seat Sex Position",
            "content": "The Hot Seat Sex Position is an easy chair sex act that requires nothing more than the will to try.\nIf you love having sex in a chair, the Hot Seat Sex Position is an easy way to make it happen, with comfortable back support for both parties.\n\nHim: Sit back in the loveseat, legs spread, with your arms behind your head so they are out of the way. That\u0027s it! This is a great hot seat position for you to feel ultimate pleasure without any extraneous movement.\n\nHer: The Hot Seat Sex Position is a great way for you to control penetration while you back onto your man\u0027s cock. Face away from him, legs together, as you slowly inch your way onto him, controlling penetration the entire time.\n\nWhy It Rocks: This is an incredibly comfortable sex position with a seated base that provides both parties with maximum pleasure and control. Try out this easy chair sex position together today.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Gemini Sex Position",
            "content": "Lay back, hands spread for support, and go at each other in the center, bodies connected as one in the Gemini Sex Position.\nThis is one of those lovemaking positions that provides direct eye contact and total control for both parties as they meet as one in the center, conjoined for ultimate pleasure. Because of its sex control, it\u0027s an easy way to reach an orgasm.\n\nHim: This golden gate sex position is comfortable for you, as you sit down, hands behind you for support, and legs spread mildly so your woman can fit inside. Get ready to angle your body just right so she\u0027s feeling maximum pleasure.\n\nHer: After your man is in place, ease onto him with your legs bent at the knee and spread around him. Use your hands to support your back and rest the remainder of your weight on the bed where his cock enters your body.\n\nWhy It Rocks: If you love to watch your partner scream while they orgasm, this lovemaking position provides the perfect control and vantage point. Plus, little flexibility is required!\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Face to Face Sex Position",
            "content": "Connect deeply with your lover while you gaze into each other\u0027s eyes, working towards a mutual orgasm that pleases you both.\nThe Face to Face Sex Position is an easy way to connect with one another while you penetrate each other\u0027s bodies, caressing the man\u0027s head at the breast in a sitting sex position. With total control, take this one slow for ultimate impact.\n\nHim: Simply sit down, legs spread, using your arms behind your back to provide your body with stability. Embrace your woman as she places her body between your legs, facing you, with one arm around your back. Suck her nipples good and deep to get her wet.\n\nHer: This is an intimate sitting lap sex position that provides you with speed and control. Bend your knees and connect with your man at your pussy, grabbing his back and pressing his face against your chest. Ease into it at a speed that is right for you.\n\nWhy It Rocks: There is something so connecting about having sex face to face, and this sex position gets it done. Requiring no agility, try and take it deeply and slowly for the best feelings possible.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Face Off Sex Position",
            "content": "If you\u0027re looking for a sex position that is sweeter and more intimate, the Face Off Sex Position has got you covered.\nFace Off Sex is honestly one of the sweeter, calmer, and nicer sex positions, placing both parties in control with complete eye contract. The Face Off Position is easily achieved if the man has a sitting surface, like a bed or a ledge, to make it happen.\n\nHim: Sit down comfortably at the edge of a bed, on a chair, couch, etc. and spread your legs slightly. Embrace your woman as she climbs onto you, facing you, legs spread around your back, with her arms wrapped around your shoulders. Pull her close while you sink deep, slowly, into her.\n\nHer: Climb onto your man, placing your feet on the surface for stability, opening your legs and slowly easing your way onto his cock while you push your breasts against his chest. Wrap your arms around his back and scratch your nails down his skin to get him going.\n\nWhy It Rocks: This sitting down sex position is an easy way to get romantic, providing both lovers with a way to connect while having illustrious and forbidden sex.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Erotic Sex Position",
            "content": "The Erotic Sex Position leaves little to the imagination as a reverse cowgirl style sex move with plenty to see.\nThe Erotic Sex Position is for couples looking to mix things up and get a new perspective on things. As a dirty sitting sex, get ready to watch ass cheeks clap and flail while pegging goes dark and deep.\n\nHim: You get to lay flat, legs spread forward, on this one. Get your positioning right, because it\u0027s up to you to stabilize your woman while she sits on you, facing away. Place your hands on her lower back, above her love handles, so you can steady her while she rides your dick deeply.\n\nHer: Approach your man, turn around, and sit down slowly on his cock, your legs spread to either side and bent at the knee. Use your hands behind your back to stabilize your body while you control how much or how little you sit atop his lovemaking tool.\n\nWhy It Rocks: This sex position requires little agility from either parties and provides the woman with total control over penetration. Go slowly until everyone is in the right position and ready to rock.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Crouching Tiger Sex Position",
            "content": "Ready to bring out your crouching tiger, hidden dragon? This is an exposing and intimate position that enables for parties to deeply connect, facing each other, gazing into one another\u0027s sex eyes while the dirty deed is done. Here\u0027s how to do the Crouching Tiger Sex Position right:\n\nHim: You get to lay down with the crouching tiger position, which makes it an awesome position for you. Lay down, legs slightly spread, ready to receive your queen. This is also a great breast viewing position for you, so get ready for the show.\n\nHer: Facing your man, spread your legs apart on either side of him and bend your knees, slowly lowering yourself onto him. Place your hands on his thighs for support, while he holds your knees, and get ready to ride him into the sunset.\n\nWhy It Rocks: If you\u0027re ready to get down, close, and intimate with your partner, this is an easy sex position that requires minimal flexibility. Although the woman does more of the heavy lifting, she is in control with regards to penetration so everyone is happy with the end result.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Cradle Sex Position",
            "content": "If you\u0027re into sitting sex positions, then the Cradle Sex Position has got you covered. All you need is a flat surface and a wall for the man to lean up against as the woman is slowly lowered, in a sitting position, on her man for ultimate, deep, and alluring penetration. Here\u0027s how to make it happen\n\nHim: The Cradle Sex Position will provide you with the opportunity to demonstrate your strength and manliness as you will be entirely supporting your woman. Sit down, legs in front of you, with your back against the wall. All your woman to approach you, facing away, lowering herself legs spread onto you. Grab under her thighs and lift her up entirely onto you, holding on as you thrust.\n\nHer: Your man\u0027s got this one covered as he holds you from the lower thigh, facing away, while he goes to town. Reach around behind you and hold his back for support.\n\nWhy It Rocks: This is an easy sex position, if the man is up for some heavy lifting, for both parties and requires no furniture – just a back support the for man. As a deep, penetrative position, go slow to ensure everyone is ready for ultimate thrusts.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Chair Sex Position",
            "content": "It\u0027s time to get wild and crazy with that loveseat sitting in your living room. The Chair Sex Position is a perfect sex pose for couples looking to mix things up, taking it out of the bedroom and into other parts of the house. Chair sex can be crazy and adventurous, using the structure of the chair to spice up your sex life. Here\u0027s how:\n\nHim: This is quite possibly the most comfortable sex position you will ever assume as a man. All you have to do is sit down and lay back in the curves of the chair, legs slightly spread and ready for your woman. What could be better?\n\nHer: Once your man has sat down, sit down on top of him, facing away from him, with your legs between his. Lower yourself onto him according to your pleasure, and grab onto his face while he takes you for a chair sex spin.\n\nWhy It Rocks: This chair sex position is easy to do, requires no strength or agility, and can feel incredibly pleasurable, helping you to mix up things by adding in some furniture support.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Capricorn Sex Position",
            "content": "The Capricorn Sex Position is a great way for women to control their love making and pleasure centers while riding their man long into the night. Easy to achieve and definitely considered a sex position that women love, here\u0027s how to make it happen:\n\nHim: Simply sit down, legs stretched out in front of you, with your arms behind your head for balance. You can lean against a wall, too. Wait for your woman to assume position. That\u0027s it!\n\nHer: This is a classic female on top sex position in which you are going to reverse cowgirl your man, legs spread apart. Lower yourself onto him at your leisure, controlling penetration until it feels perfect for you. Place your hands on his calves for stabilization, leaning forward slightly for the perfect angle of penetration.\n\nWhy It Rocks: The Capricorn Sex Position provides both partners with the ability to control their preferred amount of penetration and thrusting. With the right patience, you can both hit an orgasm seamlessly, without any physical strain.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Aries Sex Position",
            "content": "Are you ready to get down and dirty with the Aries Sex Position? Make sure you have a headboard or wall to rest against so this kind of sex is comfortable for both parties involved. Ease into it slowly, as this new kind of angling can feel different to the woman. But, trust us, it\u0027s worth it in the end.\n\nHim: Simply sit down, legs laying flat ahead of you, either on the floor against the wall, or on the bed against the wall. In order for it to be comfortable, you will want to be able to rest your back against support. Allow your woman to slowly ease onto you, providing her with control throughout the fucking time.\n\nHer: While your man sits there, legs ahead of him, reverse cowgirl yourself onto him, legs spread apart so his legs fit under you, facing away from him. This is one of the best girls on top sex positions going right now, providing you with the power to angle yourself so that it feels good for you.\n\nWhy It Rocks: This is an easy sex position for men to maintain, and one that empowers the woman to position herself so that the experience feels great from start to finish. Not to mention, it requires little strength, but it does demand some flexibility from the woman, which can be achieved with a little patience.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Amazon Sex Position",
            "content": "As arguably one of the freakiest sex positions in the game today, the Amazon Sex Position challenges both lovers to jump out of their comfort zones, switching positioning in a way that is empowering and even better feeling. This move is generally easy to maneuver and requires the male to have some flexibility, while the woman is able to ride on top according to her preference.\n\nHim: The Amazon fuck position requires the male to assume a fetal position typically reserved for the woman. You\u0027re going to get to relax this time, laying on your back and pulling your legs up far enough so the penis can penetrate the woman, sitting atop of you. See the world from her perspective with this one, allowing your body to relax while you focus on the best parts of love-making.\n\nHer: Get ready to ride on top with this Amazon style sex, with your partner\u0027s legs in front of you as you ease down slowly for a powerful, yet gentle fuck. Lean forward and support yourself on the bed, pillows, or wall to keep your balance so you can control a classic sex position that women love.\n\nWhy It Rocks: The Amazon sex position is something everyone can handle, and can be performed in any kind of setting. It\u0027s a move that is fun for both of you, and with a little patience, can feel even better once you get the angling down. Check out Amazon sex position videos to help you get it right.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Pearly Gates Sex Position",
            "content": "Get ready to head to the pearly gates with the pearly gates sex position. This is just one of those sex positions you must try if you want to expand your sex life. If you and your partner plan on sticking it out to the end of your life, or if you just want to have an orgasm in a whole new way, then the position of the pearly gate is something you should definitely try out. Here\u0027s how you do it.\n\nHim: Lie down on your back with your knees bent up in the air and reach your hand around to grab your partner, maybe even a handful of breasts if you like. Bend your legs so you can leverage yourself for better penetration.\n\nHer: Lie on top of your male partner mirroring his body with your knees bent and your arms straight out to either side of your body. Let him penetrate you from underneath.\n\nWhy It Rocks: The pearly gates sex position is a lazy person\u0027s way of having sex. If you like to be lazy, this is your move\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Butterfly Sex Position",
            "content": "Ever heard of the butterfly sex position? If you haven\u0027t, where the heck have you been? This twist on traditional “girl” on top\u0027 positions is a thrilling experiment in new sex positions. We\u0027ve partnered our take on the position with butterfly sex position images like the one you see above so you can see clearly what we\u0027re talking about. Stop googling “sexual position butterfly pics” and start reading more about it here.\n\nHim: Lay flat on your back on the bed with your legs flat on the surface. Try to lay as still as you eagerly anticipate your girl climbing on top and sliding herself over you.\n\nHer: The butterfly sexual position is best done if you climb on top of your man while he is laying flat on his back. Straddle his body on either side with your legs lying flat. Pleasure yourself and him as you fly like a butterfly over his member.\n\nWhy It Rocks: It\u0027s low-key and can be done anywhere, plus it feels amazing to everyone involved!\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Reclining In Opposite Directions",
            "content": "We love sex positions with the woman on top. Why? Because, well, it means less work for the guy! In all seriousness, this reclined position is incredibly fun to do. Like all of the best woman on top sex positions, this reclined position gets both partners full engaged and intimate.\nAlso, if you want to switch up the same ole sex positions with the woman on top like cowgirl, then this position could quickly become a favorite. So, how does it work? Well, we\u0027re glad you asked.\n\nHim: Sit on your bed, couch, floor, or sandy beach for your freaky hippies, with your butt on the ground. Spread your legs fairly wide with the heels of your feet anchored on the ground. Brace your upper body by placing your hands on the ground and position your hips upwards.\n\nHer: Get on top. Place your feet on either side of his hips spilling out to the sides. Use your arms to steady you with your eyes gazing straight into his eyes. Then start grinding it out!\n\nWhy It Rocks: This is by far one of the most sensual sexual positions in our category. Gaze straight into his/her eyes to spice it up. For women, it\u0027s great because it lets you fly free and go to town on his member.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Reverse Cow Girl",
            "content": "\n\nThe Reverse Cowgirl sex position is one of the world\u0027s favorite positions. While some might think that this position is all about fantasizing about another person besides your partner, we think it\u0027s all about dat ass. But what is the reverse cowgirl sex position, and how can you master it so that your partner falls in love, with it not you?\nIf you\u0027re searching for the reverse cowgirl sexual position, you\u0027ll get tons of results. Most of which overcomplicate this very simple, very amazing, position. So grab your cowgirl boots and hat, leave the spurs for the real animals, and climb on top—it\u0027s going to be fun a ride!\n\nHim: Lay down flat on your bed with your knees bent just enough to give her a saddle to ride. Then relax. Be sure to grab her hips and even hair—if she\u0027s into it—and start grinding on her from behind.\n\nHer: Climb on top of your male partner reverse style. Allow your hips to open and then lean slightly forward after he\u0027s entered you. Start riding him like your favorite horse, and enjoy the wild ride that follows.\n\nWhy It Rocks: Everybody gets a little bit of what they love all in one amazing sack session.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Lying Opposite and Face Down",
            "content": "Sensual, with a great view, sex positions for woman on top are the best. If you agree, then this position is sure to get your engine fired up. Get a view of that killer booty and kick back and relax, this super-hot position is sure to get your pulse racing and your, erm, body parts all sorts of kicked on. So make your bed, light a few candles and get ready for a great time. Here\u0027s how to master this amazing sex position.\n\nHim: Lie on the bed. Melt into the comforter. Spread your legs wide with your member out in the open ready to enjoy a great time. Relax your shoulders and your body. Place a pillow under your head or use your arms to brace your head as you lay there.\n\nHer: Climb on top like you are getting ready to ride the biggest, best dick of your life. Go full on reverse cowgirl and place his member inside you. Lean forward and place your hands on both of his ankles. Pin him to the bed and then begin moving your hips back and forth, front to back.\n\nWhy It Rocks: This is one of our favorite sex positions for woman on top because it is intimate, provides an amazing view for him, and feels oh so great for her. The angle also creates direct friction with her G-spot, which is a plus!\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Crab",
            "content": "The Crab Walk Sex Position has nothing to do with crabs, that we can assure you. But the crab sex position is a key position if you and your partner have been going at it for a while with fairly tame and boring sex under your wings. Embrace your inner crustacean with this simple to do, yet so hot and fun position.\n\nHim: Sit down on your ass with your legs spread as wide as you can get them to go. Grab your lover\u0027s hips and hold on to them for dear life. You don\u0027t want her waddling away from you!!\n\nHer: Straddle your man with your legs spread out to either side of his body. Widen your legs and hips as much as they can go. Brace yourself with your arms behind your back. Slightly bend your back to get that oh so perfect angle. Toss your head back and enjoy the ride.\n\nWhy It Rocks: It is so intimate yet so sexual that it makes missionary look like a dance move. The Crab Sex Position is definitely one of the hottest in the book and gives you a new take on traditional male on female moves.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Winged Back Chair",
            "content": "Just when you thought things couldn\u0027t get any hotter, this amazing position came into your world. We are always looking for the best possible sex positions with woman on top and this one came into our view and changed our world. It will probably do the same for you. All you need is a good sturdy bed and zero clothing, things are going to heat up quickly. Here\u0027s how to master this sultry sex position.\n\nHim: Lay back on your ass on the bed. Brace yourself with your arms on the bed with your hands turning back towards the wall. Bend your right knee ever so slightly, giving your girl a good “chair” shape to climb on top of.\n\nHer: Climb on top of your man as he sits in a bended chair like position. Spread your hips and legs wide enough to straddle your man on either side. As you do, slide him inside of you fully. Slide down on all the way on him so you are sitting his lap. Grasp his face in your hands and start doing the dirty, this one could cut your sex session short.\n\nWhy It Rocks: Intimacy! Of all the sex positions with the woman on top, The Winged Back Chair creates face-to-face hotness you cannot get with any other position out there.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Super Ball",
            "content": "Every now and again, a sexual position lights up our world and sneaks its way into our regular repertoire of sexual positions. This is one of those positions. We have done our research to list some of the best woman on top sexual positions out there, and this one really breaks the mold. Here\u0027s how you can enjoy it with your partner.\n\nHim: Lay down on the bed with your legs together so your partner to climb on top and get busy. Place a pillow or blanket beneath your hips for stability and extra leverage. Keep your back flat against the bed.\n\nHer: Climb on top of your partner as his legs are flesh together. Straddle him in reverse cowgirl position. Lean forward against his thighs and grab hold onto his shins, pulling his legs closer to your chest. Then use your hands to stabilize yourself as you move up and down on his member.\n\nWhy It Rocks: We call this one The Super Ball because the man is balled up like, well, a ball, and the bouncing caused by this position reminds us of a rubber bouncy ball. It\u0027s hot. That\u0027s all you need to know. Its hands down one of the best woman on top sexual positions there is.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Rocket Sled",
            "content": "You know when you\u0027re a kid and you have a sled that goes super fast in winter down a snow hill? Yeah, this position is kind of like that. We\u0027ve added it to our woman on top sex position category to give you a new take on the reverse cowgirl positions. Here\u0027s how to get busy with this move.\n\nHim: Sit on a bed/couch/chair with your fit planted firmly on the ground. Slightly raise your right foot and leg for leverage. Place your hands on the bed behind you to stabilize your position.\n\nHer: Get in a reverse cowgirl position on top of your partner as he sits on the bed. Allow your feet to straddle him on both sides. Next, lean forward and place your hands on his knees for stability. As you lean forward, begin to grind on him pushing your pubic bone farther down into his hips.\n\nWhy It Rocks: This is one of our top woman on top sex positions because it allows you freedom to touch the clit during penetration. Men can easily swing their hand around to the front of their partner and go to town on their best bits while the woman does the grinding. It\u0027s so hot!\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Riding the “T”",
            "content": "It isn\u0027t often that we come across amazing sex positions woman top side, but this one might take the cake. It\u0027s as simple as it is beautiful, and as long as you have a bed and a bit of time, it might become your favorite position yet. Get it on by following these simple steps.\n\nHim: Lay on the bed. Relax, and take your hands to your partners hips as she rides you. Slightly bend your head forward so you can take a great view of her breasts and body. This position is a crowd pleaser to be sure. Keep your hips slightly agape so your partner can fully feel you.\n\nHer: Get on top and straddle your partner. Lean forward so you can get the traction to your g-spot and your clit simultaneously.\n\nWhy It Rocks: Not many sex positions woman top side allow you the view that this one does. Couple that view with amazing angles that hit all the right spots, and this position is a crowd pleaser for both partners.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Magic Carpet",
            "content": "Kick back and relax, you\u0027re in for a magic experience. The Magic Carpet sex position is much more down to earth and normal than some of our other positions, making it a favorite for the average couple. Show her a whole new world, places she\u0027s never been too, with this super sexy move.\n\nHim: Lay on your back with your legs slightly parted. Hold onto your female partner\u0027s ankles and relax fully as she enjoys the ride.\n\nHer: Lay on top of your partner facing them with your knees bent and your legs spread completely. Brace yourself on partner\u0027s legs.\n\nWhy It Rocks: You don\u0027t have to be a professional porn star to enjoy this sex position. The Magic Carpet sex position is easy to do and gives him a great view. It gives her a great position to get that powerful O. Try out this move to amp up your sex life for good.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Squat Down",
            "content": "What guy doesn\u0027t want to see his girl do a squat? Even better, why not have her do a squat on top of you? Sure, you\u0027d love that. Well, this sex position is exactly that. The Squat Down involves your girl squatting down on to your member while she goes to town cowgirl style. Comfortable and low key, it\u0027s a sex position with a great view for him!\n\nHim: Lie on your back with knees slightly bent. Wrap your hands around your lover\u0027s waist and pull her closer to you as she rides you back and forth, up and down. Enjoy the view and the experience.\n\nHer: Sit down on top of your partner like you would in cowgirl style, with both legs on either side of his body. Place your feet up by his ears on either side. Brace yourself on his body and lean slightly back. Then move up and back, top to bottom until you both bubble over.\n\nWhy It Rocks: For him, it feels amazing with very little effort involved. For her, it allows for the best g-spot penetration with just a few strokes. It\u0027s a win-win!\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Edge Of Bed, On His Lap",
            "content": "You know those super sensual moments in your life where everything goes quiet and your focus narrows down to a single person? Well, this sex position is sure to please if so. The Edge of the Bed, On His Lap position gets you both to engage and shut off the world around you. Nothing else does it quite this way. So shut of your iPhone, tune into each other, and get one step closer to that orgasm you both crave.\n\nHim: Sit on the edge of your bed with your legs spread. Also, brace yourself on your bed. Hike your feet up onto your toes. You\u0027ll love this sexy position.\n\nHer: Climb on top of your man. Squat down on his junk and brace yourself on his thighs. Look him square in the eye and embrace this special moment.\n\nWhy It Rocks: The Edge of the Bed on His Lap sex position will get you both tuned into each other and closer to that special moment.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Italian Chandelier",
            "content": "The Italian chandelier sex position has nothing to do with décor, of that we can assure you. But the Italian chandelier position is pretty opulent if you\u0027re prepared. The Italian chandelier style position is sexy, sensual, and is sure to give you both one heck of a good time. Pair it with other moves like the PileDriver to amp up the pleasure. And if you\u0027re just curious what this move looks like, then check out the Italian Chandelier position picture we\u0027ve posted for you.\n\nHim: Lay down flat on your back stable. Let her do all the work for you as you sit there, relaxing into the passion of the move.\n\nHer: The Italian chandelier sex position is all about her. Climb on top of your partner and position yourself in the opposite direction. Bend your knees and brace yourself with your hands on either side of his body.\n\nWhy It Rocks: The Italian chandelier position is a pretty lazy move for him, but for her, it involves a bit of work. Either way, it feels absolutely incredible for both of you.\n",
            "category": "Woman On Top",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Raging Bull Sex Position",
            "content": "Sometimes, it\u0027s fun to mix up oral sex and create a new position that adds a whole new perspective to tongue fucking. With the raging bull sex position, any woman will be raging in screams for more, more, more:\n\nHim: Get ready to show off your tongue skills as you get on your knees, using your arms to support your woman in a bridge-shape position in front of you. Sink your tongue into her open and gaping pussy.\n\nHer: This requires some work on your end, but if you get it right, boy is it worth it. As your man puts his thighs on his shoulder to stabilize your lower half, use your hands to support your upper half while he moves his mouth right into your wet vagina.\n\nWhy It Rocks: With some patience, the new sex position of the raging bull is a great way to take oral sex to the next level. Take your time getting into your role, and over time, you\u0027ll be screaming for more.\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Pisces Sex Position",
            "content": "The Pisces sex position is one of those creative ways to eat out a woman until she\u0027s coming and screaming for mercy. Requiring some flexibility from the female, get ready for an all-you-can-eat buffet.\n\nHim: Get ready to show off your tonging skills as you bury your mouth deep into your woman\u0027s pussy. Presented open, high, and accessible to you, get to work pleasing her the right way.\n\nHer: Lay on your back, and lift your lower half at the hips up into the air. Stabilize your legs as the dangle above your head, presenting your vagina in an open and accessible manner to your man. Use your hands to stabilize your lower back and provide support while you\u0027re eaten out.\n\nWhy It Rocks: This is great sex position that provides entirely new angles to oral sex. If you\u0027re ready to bury your face deep into vaginal cum, the Pisces position will make it happen.\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Hucklebuck Sex Position",
            "content": "If you want to 69 in a way that is more open, exposed, and raw, the Hucklebuck Sex Position will surely get you there.\n\nWho doesn\u0027t love to 69? For the men who want a better view, and perhaps the ability to eat out some ass at the same time, the Hucklebuck Sex Position is a clever and creative 69 facing position that will leave both parties moaning.\n\nHim: Simply lay down and put your legs in a frog position, knees bowed out so your cock is open and ready for sucking. Otherwise, get comfy and lip your lips as you sink your teeth into some gaping pussy and ass.\n\nHer: Climb on top of your man and bend down facing him, with your head at his legs, and your ass open and ready for munching at his face. Place your feet at his elbows, and put your hands under your body, challenging you to really go all in with dick sucking.\n\nWhy It Rocks: This is a fun twist on 69ing that provides both parties with more of a direct eating approach, which can result in some of the best climaxes out there. Plus, it\u0027s not that hard to do!\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Mexican Halloween Sex Position",
            "content": "Feeling a little festive? If so, the Mexican Halloween sex position will replace your fear with fiery sex. This move is not for the faint of heart, either. Our sex position sketch shows you how dangerous it can be also. If your man is on the heavier side or if you\u0027re on the smaller side, it might not be the best position for you. So, dawn your skull mask and get the bed ready, this Mexican Halloween sex position is sure to please.\n\nHer: Lie down on your back with your knees wrap your arms around your man\u0027s stomach and put your head on a pillow. Lick and suck your way to his man bits.\n\nHim: Lie down gently on your lady\u0027s stomach with your back and head positioned on her legs. Spread your legs far enough so she can fit her head between them. Brace yourself with your arms on each side of your body.\n\nWhy It Rocks: The Mexican Halloween sex position is the ideal move if you want something new to spice up your sex life!\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Jackhammer Sex Position",
            "content": "Get your hardhat and construction vest on gentlemen, this position will make a construction worker yet. How many times have you heard in the bedroom, “Can you ease off the jackhammering”? Likely more than once. Well, this position should fulfil your fantasies. The Jackhammer sex position lets you be yourself. But what is the jackhammer position? How can you do the jackhammer sex move without making her mad at you again? Here\u0027s how…\n\nHer: Get down on the floor on your butt. Spread your legs slightly and bend your knees to stabilize yourself. Put your man\u0027s member into your mouth as he stands over you and plays with his other jewels.\n\nHim: Put yourself into the jackhammer sex position by standing on top of your lady friend and bending your knees slightly. Let her go to work on your member as you enjoy yourself.\n\nWhy It Rocks: The jackhammer sex position is comfortable for her and oh so much fun for him! No more creak in your neck while you give your man a BJ, and he\u0027ll love it because you\u0027ll be pleasuring all his favorite parts!\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Fire Hydrant Sex Position",
            "content": "You know, they say men can act like dogs, and the Fire Hydrant Sex Position is a great way for men to let that part of them show. Not to mention that this is a way different oral sex position than what most of you are used to. If you want to spice things up with your man or just want to act like the dog you are, you\u0027ll like this move.\n\nHer: Take things down to the floor with your butt on the ground and your hands wrapped around your man\u0027s upper thighs. Grab a hold and give him the best blowjob of his life.\n\nHim: Stand in front of your lady and slightly spread your legs so she can get in there for the total package. Relax, and enjoy everything that she has to offer.\n\nWhy It Rocks: The fire hydrant sex position is a different move for oral sex that so many people are losing out on. Try it out for an exciting time for both of you.\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Hummingbird",
            "content": "When you\u0027ve got things to do but can\u0027t stop thinking about getting off, this makes for one of the best positions for oral sex. Who has time for foreplay? Forgetta\u0027 bout it! All you need is a good solid surface, floor, bed, day bed, or poolside furniture, and a man who can master this move. Of course, the position alone won\u0027t make you tweet like a bird, but if he\u0027s got the mouth moves you\u0027ll be in heaven.\n\nHer: Lay back on your desired surface, bracing your upper body with your forearms. Split your legs, lifting them as high as his shoulders for leverage. Grind into his sweet face until you start to chirp!\n\nHim: Lay flat on your stomach on the rest of the bed and hold onto her thighs or butt with your hands. Pull her close to your mouth and give her head she won\u0027t ever forget.\n\nWhy It Rocks: Um, it\u0027s one of the best positions for oral sex and it feels amazing for her. For him, well, let\u0027s just say he won\u0027t be hungry again soon.\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "69 Sex Position",
            "content": "Looking for better blowjob sex positions to give your man a seriously good night? Well, we\u0027ve got you covered. This Classic 69 sex position is sure to please you both. Giving it to your lover the right way cannot be underestimated. Literally, marriages have lasted for years because of good head. The beauty of this blowjob and oral sex position is its simplicity. It\u0027s easy and fun to do. Haven\u0027t done it before? Well, here\u0027s how to start.\n\nHim: Lay down on your back. Spread your legs slightly. Grab a few pillows to prop up your hips. Go to town on her bits as soon as they hit your face, and oh how they will.\n\nHer: Climb on top of your man in a reverse position with your mouth hovering over his member. Slide your body parts into his mouth delicately as you do the same with his. Pleasure each other until you both climax.\n\nWhy It Rocks: There\u0027s not much to say, it rocks because you both get some damn good oral sex.\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Face Seat",
            "content": "There is only one time in life when becoming an object for sex is inviting, and this is one of those times. The Face Seat is one of the few ideal oral sex positions for women. You might get off faster than you ever have before much to your partner\u0027s excitement. Nothing says orgasm quite like sitting on your partner\u0027s face either. If you\u0027re looking for a new way to get off when your man goes down, you might want to share this move with him. Here\u0027s how it\u0027s done.\n\nHim: Lay on your back on your bed with your knees slightly bent. Hold on to your lady with her hands, and maybe wander around her body grabbing onto other super sexy parts. Use your tongue, lips, and face to give her the best orgasm of her life.\n\nHer: Get on top of your man and sit on his face in reverse cowgirl position. Spread your knees as far as you can get them and lean back slightly by bracing yourself with your fingertips on the bed. Move if it feels good.\n\nWhy It Rocks: This is one of our favorite picks for oral sex positions for women. It takes her to pleasure town quickly and easily. What\u0027s not to like?\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "On Your Knees",
            "content": "Have you ever watched an action flick, you know the ones with A-List action stars, and heard the line, “Get On Your Knees”? Well, this is kind of like that, except there\u0027s a dick in your mouth. We love to offer our visitors pictures of oral sex positions in this category so you can see exactly what we\u0027re talking about. In this move, you\u0027ll see our mannequin assuming the position and you\u0027ll notice our male mannequin is blankly staring off into space. Rest assured, this position will NOT make you stare off blankly into space unless that\u0027s your go-to when you\u0027re getting the best pleasure of your life.\n\nHim: Stand up tall perhaps leaning against a wall or other object.\n\nHer: Get on your knees in front of your man, almost in a doggie style position. Grab ahold of his member and place it in your mouth. Use your hands and mouth to give him one hell of a good time.\n\nWhy It Rocks: Our picture says it all, this sex position is great for him because he\u0027s getting a blowjob, and it\u0027s easy for her because it\u0027s direct access to his member.\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Put Your Butt in The Air Baby",
            "content": "Have you ever face planted into the dirt? This is one of those positions for oral sex that feels like that, but instead of dirt, you face plant into your lady\u0027s special parts. All you need is some damn good stamina and an ability to levitate, at least according to our model. But in all seriousness, this one is super fun for both sides and if you do it right it can make your orgasm all the better. Forget about boring positions for oral sex. This move will get your heart pumpin\u0027 in more than one way.\n\nHer: Arch your back and put your legs on your partner\u0027s shoulders. Keep your back as straight as possible while bracing yourself with your forearms on the bed.\n\nHim: Get on your knees on your bed and slowly slide her legs over your shoulders. Brace your body with your arms and give her the best damn oral sex that she has ever had.\n\nWhy It Rocks: It\u0027s a great move if you want to impress your partner and it\u0027s perfect access to all her best parts.\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Lazy Boy",
            "content": "Let\u0027s face it, sometimes you don\u0027t feel like doing much at all besides getting a blowjob. Luckily, The Lazy Boy is one of those blowjob sex positions that lets you do exactly that. You literally don\u0027t have to do anything but kick back and enjoy everything she\u0027s doing. Every tongue twist, every suck, every flick of the tongue, you will be able to feel it all as you lay back in your favorite bed. Want to know how it\u0027s done?\n\nHim: Lay down on your back on your bed, couch, or favorite lazy boy chair. Basically, act as though your body is paralyzed and let her work her magic on your member.\n\nHer: Crouch down on top of your man, holding his knees in place by putting your feet on top of them. Pin him to the bed and then hold onto his hips as guide your mouth over the top of his member. Up and down you go until he cannot take it once second longer.\n\nWhy It Rocks: The Lazy Boy is one of those blowjob positions that\u0027s simple but makes him feel amazing. It\u0027s also super easy to do.\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Oral Sex On Her",
            "content": "Looking for better positions for oral sex? Yeah, we thought so. Good news, this oral sex move is sure to have her cumming in no time. Whether you\u0027ve got just a few minutes to get her off or are ready to put the work in to give her your Olympic best, this position helps you get to work. We call it “Oral Sex On Her” because that\u0027s exactly what it is. It\u0027s a position that gives you access to her fun parts without all the demanding neck, back and arm work. So, here\u0027s how you get it done.\n\nHer: Lay on your back with your legs spread and knees bent. Relax into the moment and let him do his best.\n\nHim: Bend down in between her legs with your knees bent and your hands placed on her hips. Place your tongue and lips over her pussy and give it your best.\n\nWhy It Rocks: It\u0027s super hot and sensual for her and happens to be one of the best positions for oral sex if you\u0027re going down on your female partner.\n",
            "category": "Oral",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Happy Triangle",
            "content": "Nothing is happier than a triangle of people sucking each other off.  Luckily, your search for mff threesome positions is over. The Happy Triangle keeps everyone happy in your threesome. Simple, yet, unique, this position will have you chowing down on each other\u0027s happy bits like you\u0027re at an eating competition while moaning for more. Here\u0027s how it\u0027s done.\n\nMan: With mff threesome positions, it can be tough to get everyone aligned correctly. This position makes it pretty easy. He gets down on his hands and knees and pleasures the person in front of him, typically the woman. Don\u0027t worry, you\u0027ll get your pleasure from the person behind you as you form the triangle.\n\nWoman one: Get down on your hands and knees and start giving oral to the man in front of you while the guy behind you gives you oral. Heaven!\n\nWoman two : See instructions for the woman above. Yes, it really is this simple!\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Low Hanging Fruit",
            "content": "Threesomes are amazing, but if you don\u0027t have an inventory of mmf sex positions ready to go, you might lose out on some serious fun. Good thing you found this position. Low Hanging Fruit is all about catching that “fruit” that tastes so sweet. If you\u0027re the lady in this threesome, you\u0027ll love this position.\n\nMan one: Hey Man one, lay on your back on your bed. Start pleasuring the lady in this equation as she straddles your face. Use your hands, tongue, and mouth to do all the good things you can imagine to that pretty little lady.\n\nWoman: Lay on top of Man 1 and go to town on his member. Suck that member like your life depended on it as he 69\u0027s you from underneath. Oh, but there is one more surprise in this position. The other man will penetrate you from behind.\n\nMan two: Stand behind the lady in your equation and insert your “fruit” into her anus for a good ole time.\n\nWhy It Rocks: Everyone gets to feel something truly amazing. Licking, sucking, and fucking is all the rage in this position.\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Cowgirl and The Cattle Rustler",
            "content": "Yeehaw! We\u0027ve got some super fun FFM threesome positions for y\u0027all! This one is designed for everyone to have a damn good time. It\u0027s like a superhero version of reverse cowgirl. Seriously, no cowgirl has ever had more fun or will have more fun. Here\u0027s the setup.\n\nMan: Lay down on your bed with your back flat. Create the best surface for your cowgirl to climb on top of. That\u0027s it!\n\nWoman one: Climb on top of your man partner and get in a reverse cowgirl position. Grind on his member like a saddle horn when you were just a horny cowgirl teenager.\n\nWoman two: Get on your knees underneath woman one and start going to town on the man\u0027s nether regions. Suck, lick, and tease his balls and his ass for a truly exhilarating experience for both him and you.\n\nWhy It Rocks: For him, this position couldn\u0027t be better. Seriously, you won\u0027t find FFM threesome positions that get you off faster. For the ladies, especially woman one on top, this position gives direct access to the g-spot and clit. For woman two, this position is a great way to make your partners happy.\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Old Faithful",
            "content": "Have you been waiting your entire life to experience a threesome? If you\u0027re like most people, you would answer “yes”. But when your dream comes true will you be ready? One way to get ready is to explore some 3some sex positions. One of our favorites is the Old Faithful position. This is ideal for 2 woman and one man. Here\u0027s how to enjoy it.\n\nMan: Lay down on your back. Go to work on one of the girl\u0027s as she lays on top of you with her legs spread and her has in your face. Let your imagination go wild.\n\nWoman one: Lay on top of your male partner with your legs spread and your stuff in his face. Suck, lick, and do all the things to his stuff as you straddle him.\n\nWoman two: Start licking and sucking your male partner as he enjoys himself with both you lovelies going down on him.\n\nWhy It Rocks: Because everyone is involved! No one will feel left out with this move, unlike some other 3some sex positions. Get “Old Faithful” up and running with this fun position.\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Two Men, One Hand",
            "content": "If you\u0027re lucky enough to find yourself in a three-way, this position might just be what you\u0027re looking for. It is a no-touch kind of move. In fact, it is more of you two dudes watching your lady friend enjoy herself. But let\u0027s be honest, that\u0027s what most guys are looking for in a threesome anyways. So, if you hate the idea of touching another dude or touching the woman in your sex position, the Two Men, One Hand sex move could be just what you\u0027re looking for.\n\nHer: Lie on your stomach on the surface of your bed or the floor, wherever you happen to be. Allow your one hand to tease yourself from underneath. Don\u0027t worry about your two dude partners, they\u0027ll take care of themselves.\n\nDudes: Just watch your lady friend enjoy herself and do the same with your own two hands. You\u0027re adults, you can figure it out.\n\nWhy It Rocks: It\u0027s a low-pressure kind of environment. Just lay back, relax, and enjoy yourselves. It will feel great because you\u0027re doing it!\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Woman Sandwich",
            "content": "Hungry? You will be after you see this sex position. It is sure to tantalize a different set of tastebuds to be sure. If you are involved in a threesome with two dudes and one lady, then you have to try this move. But leave your apprehensions of touching another guy at the door. This move is not for the faint of heart or the totally straight. Here is what you need to do to execute this move.\n\nMan one: Lie on your back with your hips slight parted and your arms out to your side.\n\nHer: Lie on top of Man 1 all the way forward, with your body flesh with his. Your legs should be slightly bent and then pushed backwards onto the hips of Man 2. Do your part to ride him like he deserves to be ridden. Expect Man 2 to enter you from behind.\n\nMan two: Climb on top of the lady in your partnership and enter her from behind, in her behind. Prop yourself up with your arms on either side of man 1. Make her into a delicious sandwich you both get to take a bite out of.\n\nWhy It Rocks: Everyone is getting that sensual pleasure they crave. It\u0027s not a sandwich you\u0027ll want to put down anytime soon.\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Lady Show",
            "content": "You know those moments in life where you feel kind of useless? Well, this sex move kinda puts you into one of those moments. The Lady Show is a peep show for him and a damn good time for both of those ladies. You see, it\u0027s basically 69 for them and a jerk off festival for you. Want to know more? Then read on below.\n\nLady one: Lie on your back with your legs spread apart. Put your tongue where it belongs on your lady partner. Be sure to moan naturally to give him a good show.\n\nLady two: Lie on top of lady 1 and give her your tongue while she goes to town on you from behind and below.\n\nMan: Just stand there as useless as ever and watch the amazing show taking place right in front of you. You won\u0027t regret it!\n\nWhy It Rocks: Well, it is a killer move for those two ladies and it looks great, making it super fun for him. Try it out to see what all the fuss is about.\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Saw Horse",
            "content": "We\u0027re no experts on sex etiquette, but the Saw Horse might be one of the best three some positions you can think of. Just like the name implies, the Saw Horse gets the guys on each end (where the fun bits are) of their lady friend allowing them to go to town. Every body gets to enjoy themselves simultaneously. Just remember, no eye contact dudes. How it\u0027s done:\n\nWoman: Lay on your back with your legs spread and your mouth open. Lay still, but don\u0027t be afraid to have some fun with what\u0027s in your mouth. It\u0027s more fun that way.\n\nMan one: Stand where her mouth is and insert your member. Thrust gently at first and then faster as she allows. Pay attention to her cues.\n\nMan two: Stand at the other end of her body and enter her. Grab her hips to keep her in place.\n\nWhy It Rocks: Because everyone gets to enjoy themselves! The best three some positions allow everyone to have a bit of fun.\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Man Sandwich",
            "content": "What\u0027s better than a couple of pieces of delicious baked bread on either side of a big ole piece of sandwich meat? Nothing! That\u0027s why The Man Sandwich is one of the best ffm sex positions in our category. You don\u0027t have to be a brain surgeon to figure out why. Lady on top, man in the middle, more on the other side. Delicious!\n\nWoman one: Lay on your back on the bed with your legs spread so your man partner can enter you from top. Missionary is the closest position.\n\nMan: Get on top of woman 1 and enter her from the top like you would in missionary. Start grinding it out for a super delicious, and sweaty, time.\n\nWoman two: Climb behind your male partner and sit on top of the other lady in this sandwich. You can either use a dildo to enter him/her from behind/above or you can simply pleasure her with your fingers while you\u0027re on top.\n\nWhy It Rocks: You\u0027ve got to enjoy yourself if you\u0027re in a threesome. The good news is, there are plenty of ffm sex positions to check out like The Man Sandwich. This position makes for a toe-curling time for the man and one woman, while the other gets to explore her partner\u0027s bodies.\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Double Sucks",
            "content": "So you\u0027ve got a girl ready to be apart of your hot threesome, and she just so happens to have a boyfriend who\u0027s game. Now you have to find some good threesome positions to make it happen. That\u0027s where our Double Sucks position can help. Get raunchy and wild and explore your fantasy with friendly folks who don\u0027t mind looking at you naked. This Double Sucks position makes for a fun time for at least two of the partners at a time. Here\u0027s what you can expect.\n\nWoman: The woman gets on her knees on a bed and grabs one of the members standing in front of her. She sucks, and sucks, and she blows his “house” down. Then repeat with the other man.\n\nMan one: Stand in front of your lady friend and stay hard. That\u0027s your job. That\u0027s it.\n\nMan two: Stand in front of your lady friend and avoid your male counterpart\u0027s penis at all costs.\n\nWhy It Rocks: It a good threesome position because both guys get a bit of sucking, but you gotta be patient. Wait your turn and this position is great.\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Bro Bang",
            "content": "When it\u0027s bangin\u0027 time, you have to get on the same page as your bro. That\u0027s why we recommend The Bro Bang position. In fact, we consider it one of the best threesome sex positions out there. The Bro Bang requires a bit of physical fitness and a willingness to work together, but once you get the swing of it, it is one heck of a ride. Here\u0027s how to do it.\n\nWoman: Lay down on your bed on your back with your legs in the air. One guy will enter you from the bottom and the other guy at the top will enter your mouth as you go to town.\n\nMan one: Stand at the top of the woman as she lays down on her back. Enter her mouth with your member and grind into her mouth.\n\nMan two: Stand at the bottom where the woman\u0027s legs are spread open and enter her. Go to town as much as she\u0027s comfortable for one heck of a time for everyone. Also, avoid eye contact with your male counterpart.\n\nWhy It Rocks: Literally everyone is getting genital pleasure with very little effort on their part, which is why its one of the best threesome sex positions.\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Ride and Blow",
            "content": "You know those videos of whales in the ocean blowing water through their blow hole? This position is kind of like that, except instead of water it\u0027s ejaculate, and instead of a whale it\u0027s a woman doing the blowing. But for real, the “Ride and Blow” is a delicious threesome position. It also has one of the best threesome sex position names, amirite? This position is ideal for two guys and a girl, and here\u0027s how ya get it done.\n\nMan one: Lay on your back on the bed with your knees bent at the edge of the bed with your feet flat on the ground. Hold on to your female partner and go to town.\n\nWoman: Climb on top of man one in reverse cowgirl position. Open wide and go to town on man two\u0027s member.\n\nMan two: Stand in front of man one facing the lady in your midst. Insert penis and enjoy yourself. Just stay away from the other bro when that time comes…\n\nWhy It Rocks: It\u0027s easy, it\u0027s effective, and it has one of the best threesome sex position names! What\u0027s not to love?\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Twice As Nice",
            "content": "Is anything more sensual than a woman going down on another woman? We think not, which is why we think this is one of the best mff threesome positions in the book. Just imagine yourself pleasuring one woman as she pleasures another woman. How fast would you come? This position might just make that a reality for you. Here\u0027s how it\u0027s done.\n\nWoman one: Lay down with your feet in the air and your face underneath woman 2. Perform oral on her as the man in your threesome gives it to you downtown.\n\nWoman two: Swat down above woman 1 with your legs straddling her face. Brace your body with your arms and lay back in ecstasy.\n\nMan: Pull woman 1\u0027s legs up to your chest, get on your knees, and bend slightly forward to penetrate her. Brace your arms on the bed and watch the view.\n\nWhy It Rocks: No other top rated mff threesome position will bring you to your knees quite as quick as this one. Everybody is getting off and it looks amazing.\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Kneeling Double Penetration",
            "content": "If you\u0027re looking for some of the best positions for a threesome, this one might just need to be added to your book. What\u0027s amazing about this one is that it can also be added to your threesome positions for MFF and not just work for two guys and a girl. Here\u0027s how you do it and knock your own socks off.\n\nWoman: Place your knees on a bed or on the floor, wherever you prefer. Give one of your male counterparts some love and attention facing him with your legs relaxed and get ready for man two to enter you from behind.\n\nMan one: Face your partner and insert her from the front. You get the vagina while man two gets her behind.\n\nMan two: Enter your female partner from behind. Be gentle enough that she can feel relaxed and enjoy the sensations. Once she\u0027s good to go, keep going and don\u0027t stop. She\u0027ll love it.\n\nWhy It Rocks: Well, aside from slightly awkward business with the two dudes, you can thoroughly enjoy this crazy position since everyone is getting the loving that he/she craves. It\u0027s intimate, but nonetheless a good place to start your threesome position fantasies.\n",
            "category": "Threesome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Happy Gang",
            "content": "Forget about unhappy lovers, The Happy Gang sex position makes foursomes a breeze. Every single person involved gets to experience ultimate pleasure without all the annoying run-ins with the male member (for the guys). Everyone gets what they\u0027re looking for in one go, and it is ultra hot.\n\nMan one: Lay down on your back with your hips spread wide enough for woman 1 to climb on top. Give woman 2 mouth pleasure while she\u0027s squatting on top.\n\nWoman one: Ride man 1 like the dirty cowboy he is all while enjoying the view.\n\nWoman two: Get on your hands and knees as you straddle man 1\u0027s face. Go to town on Man 2\u0027s member for a thrill neither of you will forget.\n\nMan two: Stand on the outside of the bed while graciously receiving the oral sex you crave.\n\nWhy It Rocks: No one gets left out! This truly is the best way to keep the entire gang happy.\n",
            "category": "Foursome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The “Bed Breaker” Foursome",
            "content": "Who says sex has to be limited to two people? This position defies the odds and gives new meaning to the word foursome. Two guys and two girls can go to town on each other without any hesitation or room for judgement. Just pleasure, fun, and everything that comes with it. The Bed Breaker move is sure to put some pressure on your king sized mattress, but in the best possible way. Here\u0027s how it\u0027s done.\n\nMan one and Woman two: The lady in the equation bends over on her hands and knees, bracing herself for impact from behind. Man 1 scoots up behind her to insert his member. Doubling over her, he leans forward to hit all the right spots.\n\nMan two and Woman one: Just behind couple 1, man 2 and woman 2 are going to work on each other. Same position, doggie style, with hips wide and bodies pulsating with pleasure, this is a double team effort that won\u0027t go unnoticed.\n\nWhy It Rocks: Two women, two men, doggie style. Does anything else need to be said?\n",
            "category": "Foursome",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Side by Side Sex Position",
            "content": "The side by side sex position is a great way to connect with your partner deeply while you make love. Laying on both sides, this sex position side by side will challenge the two of you to hold gaze while you make each other scream.\n\nHim: For this side sex position, lay down on your left side, facing your woman, with your left arm stretched out above your head. Allow her to grab you with both arms and shimmy her way onto your cock. Once in position, start slowly and deeply thrusting.\n\nHer: Facing your man, wrap your arms around his back and your legs around his groin, while he enters you with slow, meaningful thrusts that will leave you wet and wild.\n\nWhy It Rocks: This is a super comfortable and easy side by side position that will bring you two together in a deep, intimate embrace while you make love into the wee hours of the morning.\n",
            "category": "Spooning",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Sideways Sex Position",
            "content": "The sideways sex position will turn your world upside down. Not really, but it will give you a new perspective on your sex life for sure. Sex positions from the side can be uncomfortable if you don\u0027t do them right, but if you do them the right way it can become a beautiful move. So, this side by side sex position is one you want to add to your roster.\n\nHer: Lie on your back and spread your legs wide with your knees bent and your body turned almost on one hip. Enjoy the ride and the orgasm to come with this sideways sex position.\n\nHim: Lie behind your partner with your ankles crossed. Enter her from behind and underneath and hold on to the leg that is up in the air. Brace yourself up on one arm on the bed. Then hit it with this side by side sex position.\n\nWhy It Rocks: If you\u0027re looking for sex positions from the side, this one might just take the cake. It\u0027s pretty easy and it feels great for both partners.\n",
            "category": "Spooning",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Spooning, With Her Leg Up",
            "content": "Sex should feel good. Sex should make you crave more. This spooning sex position does that. It\u0027s hot, it\u0027s intimate, it doesn\u0027t involve being some sort of amazing gymnast. It has all the best details. And if you\u0027ve ever woken up with a sexy itch to scratch it\u0027s the perfect transition into sexy time. Start off spooning and before you know it, oh, you\u0027re having sex. Sounds good, right? Here\u0027s how to make that happen next time you\u0027re spooning the one you love.\n\nHer: Lay down on your side with your arm bracing your body or use a pillow to keep yourself in place. Wrap your top leg back and around your man\u0027s top leg. Let your free hand wander down to your clit and use it to make yourself feel good.\n\nHim: Spoon your girl from behind. Enter her after spreading your legs slightly apart. Place your hands on her shoulders for support, and then once you\u0027re in the groove let them wander where they may.\n\nWhy It Rocks: This spooning sex position gives her easy access to her clit and him a great angle to kill it.\n",
            "category": "Spooning",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Cow Girl Gaze",
            "content": "They say that the eyes are the windows to the soul. Who knows if that\u0027s true, but what we do know is you both will “O” so much more quickly if you look longingly into each other\u0027s eyes. Luckily, this is a spoon position sex addicts like you will love. It\u0027s all about that gaze, hence the name “The Cowgirl Gaze.” So grab your boots and get ready for a good ole fashion stare down, this move is going to make you say “yeehaw!\n\nHim: Lay with your back flesh with the bed or floor. Grab onto your partner\u0027s hips and try not to stare too long into her eyes. We all know what happens when you do.\n\nHer: Climb on top of your partner in the reverse cowgirl position. Brace your hands behind your back next to his body and twist your gaze ever so slightly behind and into his eyes.\n\nWhy It Rocks: No other spoon position sex move lets you stare at each other, but this one does. This gets you one step closer to that magical moment.\n",
            "category": "Spooning",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Ninth Posture Of The Perfumed Garden",
            "content": "There\u0027s nothing quite like spooning on your knees. When it comes to sex positions spooning moves, this one takes the cake. It\u0027s a great combination of doggie style without being full on doggie. It could turn into that if she twists her hips in the right ways. Great views, great sex, great pleasure—this one has it all. Here\u0027s how you master it.\n\nHer: Use a bed, chair, or couch to prop yourself up on. Get on your knees and bend completely in half. Spread your hips slightly so your man can enter you from behind.\n\nHim: Get on your knees behind your partner and grab onto her hips. Enter her from behind and begin to thrust. It will feel amazing.\n\nWhy It Rocks: When it comes to sex positions spooning moves, doggie style is always at the top of the list. It feels great and looks even better, what\u0027s not to like?\n",
            "category": "Spooning",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "He is Spooning Behind Her",
            "content": "Looking for a better spooning position sex move? The “He\u0027s Spooning Behind Her” position is a fun and tantalizing position that is sure to get your heart thumping. It\u0027s also incredibly romantic. It\u0027s what we imagine could have saved Jack\u0027s life when the Titanic sunk. Sensual, intimate, and oh so good feeling, you won\u0027t want to miss making this sex position a part of your routine.\n\nHer: Lay on your side with your legs closed and your upper body slightly twisted so you can gaze into your lover\u0027s eyes. Grab his hands and move them over your body for the ultimate in pleasure.\n\nHim: Spoon her from behind with your legs and hips paralleling hers. Enter her from behind and move slightly above her so you can stare into her eyes. Stare down into her eyes and give it to her the best way you can.\n\nWhy It Rocks: This move is super intimate. No other spooning position move gives you the same level of intimacy. Try it out, you won\u0027t regret it.\n",
            "category": "Spooning",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Fifth Posture Of The Perfumed Garden",
            "content": "Simple, sexual, and almost animalistic, the Fifth Posture of the Perfumed Garden is everything you could want from a spoon position in sex. Once you and your partner are laying together in bed, all bets are off. Use that romantic cuddling to become your gateway to a super-hot sex session. Here\u0027s how to make the Fifth Posture of the Perfumed Garden your next favorite position with these sexy tips for both of you.\n\nHim: Start cuddling your partner from behind. As things turn to a make out session, pull her underneath you and wrap your legs around hers in a sort of pretzel shape. Enter her from the front and kiss her as things escalate.\n\nHer: Warmly welcome his initiation and wrap your legs around his, and spread your legs slightly so he can easily enter you and work his magic.\n\nWhy It Rocks: It\u0027s the best spoon position in sex. Hands down. It\u0027s convenient, easy, and very intimate.\n",
            "category": "Spooning",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Coitus From The Back",
            "content": "This sex position spoon move is all about the back door. You enter from the back and that\u0027s typically where you stay. This move makes that process even sweeter. It\u0027s an ideal position for G-spot stimulation. That oh, so perfect angle is so hot when she starts to moan and he starts to sigh. So hit it right and get it tight, this move is bound to make you smile.\n\nHer: Lay face down on your bed with your legs slightly spread. Make it easier for him to enter you by placing a pillow underneath your hips. Turn your head to look back towards him for an even more sensual experience.\n\nHim: Climb on top of her from behind, bracing yourself with your hands on either side of her body. Position your hips behind hers and break out your deepest penetration move.\n\nWhy It Rocks: This sex position will get you both to climax if you do it right. It\u0027s hot for both of you!\n",
            "category": "Spooning",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Octopus Sex Position",
            "content": "If you\u0027re looking for a new sex position that challenges you and your partner to connect in a twisted kind of way, the octopus sex position will get it done. Sliding and slipping, here\u0027s how to make it work:\n\nHim: This one is easy for you, as you sit down with your legs spread, supporting your weight with both of your arms behind your body. Position your erect cock for the taking.\n\nHer: The octopus position is a little more challenging for you. Slip your legs between your man\u0027s, with one under him, as you lay on your side. Position his cock between your legs while you use one arm to stabilize your body in the sensual sex position.\n\nWhy It Rocks: When it comes down to the nuts and bolts, if you have the patience, this sex position is doable by most people. Thanks to the side entry, it\u0027s a great way to achieve deeper, more meaningful penetration by the time it\u0027s all said and done.\n",
            "category": "Spooning",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Monkey Bars Sex Position",
            "content": "The monkey bars sex position involves a pull up bar prop to get into the rhythm. Requiring the man to have enough strength to hang from the bar while thrusting into the woman, if you\u0027re up for the challenge, then this will be sex you\u0027ll never forget:\n\nHim: Grab the top of the pull up bar with a strong grip, as you\u0027re going to dangle from it while pegging your woman. Bend your legs at the knee and lift them off the ground.\n\nHer: Back up slowly onto your man, with his penis erect, as you place it into your pussy gently and slowly. Once you find a height that works for the two of you, help your man with gentle thrusting while you trying this sex position standing up.\n\nWhy It Rocks: This is one of those crazy fun sex positions that will provide you with some serious bragging rights when it\u0027s all said and done. All you need is a pull up bar!\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Mermaid Sex Position",
            "content": "If you\u0027re looking for a sex position that comes with bragging rights, then the mermaid sex position can definitely deliver. Mermaid sex is named for the incredible flexibility that needs to come with the female, as well as the core strength to stabilize the whole act. Here\u0027s how to pull it off:\n\nHim: This one is easy for you. All you do is lay down, completely flat with your legs straight out in front of you, while you get ready to stabilize the entirety of your woman\u0027s weight above your groin.\n\nHer: Get ready to pull out all the moves. Sit down on top of your man at his groin and slowly bend your torso, as well as your legs, into the air. Use your arms to stabilize your weight by grabbing the back of your knees, relying on your core to stay stable. Wiggle yourself into perfect cock placement.\n\nWhy It Rocks: This is definitely a sex position that will spice things up for you and your lover. If you\u0027re a woman with yoga, athletic, or flexibility experience, exercise extreme patience in getting this one right.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Hand Stand Sex Position",
            "content": "The Hand Stand Sex Position is only for the flexible, agile, and daring women who are ready to get pegged standing on their hands.\n\nNot many people can pull off the Hand Stand Sex Position, which means if you want to give it a go, you\u0027re one of the wild ones. Handstand sex is not easy or carefree, but, it\u0027s totally worth it once in place.\n\nHim: You get to stand up straight in this one, showing off your biceps while you support the entirety of your woman. Holding onto her thighs while she balances on her hands, provide the balance she needs to keep steady through the fucking.\n\nHer: It\u0027s up to you if this handstand fuck position is going to work or not. Practice a few times without the fucking to get your balance, then ease onto your man, facing away from him, while he holds your legs. Find a good way to support your weight so you can remain calm through the wild and ravenous fucking.\n\nWhy It Rocks: If the woman is up for the challenge, this is one of those sex positions that comes with serious bragging rights.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Golden Gate Sex Position",
            "content": "Not everyone can Golden Gate, which is why for the women who can, it\u0027s a serious 69 feat they should brag about for the rest of their lives.\n\nEveryone loves a good 69. Dicks sucked, pussies eaten, and maximum pleasure at the same time. The Golden Gate Sex Position takes 69ing to a whole other level as the woman\u0027s body essentially makes the top of a bridge with the man below her.\n\nHim: This couldn\u0027t be easier for you. Simply lay there and get ready to embrace a wet and dripping pussy while your woman performs a seriously impressive acrobatic act above your face.\n\nHer: If you have extreme flexibility and athletic dispositions, this 69 sex position is worth a try. Sit down on your partner\u0027s face, facing forward, legs spread around his head. Bend backwards slowly to create an arch with your body until you are facing his erect penis. It\u0027s time to get to work.\n\nWhy It Rocks: Not many people can pull off the Golden Gate Sex Position. It all comes down to the female\u0027s flexibility. But, if you\u0027re one of the lucky ones, it\u0027s one of the most insane ways to 69.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Brute Sex Position",
            "content": "Few sex positions are as complicated, freaky, and challenging as the Brute Sex Position, requiring both parties to bend, twist, and turn in an unnatural way. However, if you manage to conquer the brute position together, what could feel more rewarding? Talk about bragging rights! Here\u0027s how to attempt it:\n\nHim: Once your woman is in place, slowly squat down atop her, facing away from here, with a stiff bend in your knee. Lower yourself into her, arch your back, and use your hands for stability with her thighs and lower hip region. This is going to burn in your quads – get ready!\n\nHer: Lay on your back and place your arms under your lower back to elevate the bottom half of your body. Bring your pleasure center into the air, legs apart and bent over your face. Hold still while your man lowers himself into position facing away from you.\n\nWhy It Rocks: The pleasure sensation that ensues from the brute sex position is like nothing you have ever felt, which is why if you\u0027re up for the flexible challenge, it is incredibly rewarding by the end. Talk about bragging rights!\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "96 Sex Position",
            "content": "It\u0027s time to get freaky standing up! The 96 position requires a little more strength and agile positioning to get it right than traditional sex poses. In order to keep the 96 position intact, both parties need to be ready to get dirty and show off their physical strength. But in the end, the difficulty is worth it in the feeling – just you wait and see. So how does the 96 sex position stack up for all parties involved?\n\nHim: This is a nice position for you, as you get to remain standing with a bend in the knee the entire time. However, this is no walk in the park, which is why you need to be ready to support the lower half of your lover while she stands on her hands for you. Angle yourself correctly so that it is pleasurable for her, too. Grab her legs, wrap her calves around your back, and hold on tightly to her thighs.\n\nHer: Get ready to put in some work for this one, standing on your hands while the male wraps your legs around him, holding your thighs. The balance of his body will make this easier than it looks, although you\u0027ll want to be prepared to support the upper half of your body while. Once in position, relax your tension, and let him do the work.\n\nWhy It Rocks: In all 96 position images, check out the different forms of acrobatics in motion, depending upon the strength and flexibility of both partners involved. No bed or furniture is needed to perform this kind of must-try sex position, known as a preferred stand and carry sex position when couples are looking to mix things up.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Waterfall Sex Position",
            "content": "Don\u0027t go chasing waterfalls, except and unless it is the waterfall sex position—sorry TLC. But in all seriousness, sex does not have to be boring, and the waterfall position is anything but boring. You don\u0027t have to have tremendous flexibility, but you should be able to touch your toes to do this move. If you\u0027re thinking about doing the sex position “waterfall” then consider our tips below.\n\nHim: Get on your knees in front of your lady friend. Spread your hips. Grab her by the hips and pull her onto your member. Stay stable so she is safe during the act. Give her an O. This your job, so do it!\n\nHer: Wrap your legs around your man\u0027s body and then bend yourself backwards and stabilize yourself with your hands on the ground. Bend it all the way as far as you can go and let him do the rest.\n\nWhy It Rocks: The waterfall sex position is sure to please you both if you do it right. Put in the work and it will get you where you both want to go.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Spider Sex Position",
            "content": "Hate spiders but love sex? Good news, the spider sex position has nothing to do with arachnids. The spider sex position is all about getting freaky and imitating the best nature has to offer. Spider sex style is absolutely a good time if you know how to do it. But if you haven\u0027t done it before you might be intimidated. Don\u0027t be. Here is how to master this sex move.\n\nHim: Get down on your back and arch your back like you\u0027re moving into bridge pose Yoga style. Keep your hips level with the rest of your body and brace yourself with your arms on the bed.\n\nHer: Mirror your partner\u0027s position with your hips over your partner\u0027s hips. Put him inside of you and then bump and grind down onto his member as you enjoy yourself.\n\nWhy It Rocks: The spider sex position is super fun to try at least once.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Overpass Sex Position",
            "content": "Ever heard of the overpass sex position? You probably haven\u0027t because it\u0027s one of those almost impossible sex positions. But if you have the time and the desire, this could be a rewarding position to learn how to do. The sex position called “overpass” is a great way to get your cardio and stretching in also. So how do you do it? Follow along boys and girls.\n\nHer: Lie on your back and bend your legs back over your head almost like you\u0027re trying to do a backflip. Grab ahold of his hips above you to keep yourself stable while he penetrates you from above.\n\nHim: Squat down on top of your girl with your hands on the ground or surface in front of you as you bend forward. Penetrate her from the top and start gently to avoid any awkward angles. And if you nail the overpass sex position, she\u0027ll be so happy to know you.\n\nWhy It Rocks: If you can do the overpass sex position you can do almost anything! It\u0027s nearly impossible, so don\u0027t be afraid to try it out.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "London Bridge Sex Position",
            "content": "The London Bridge is Falling Down, Falling Down, Falling Down… actually no, things are getting much firmer. The London bridge sex position is sure to arch your bridge like nothing else. And good news, you don\u0027t have to be from the UK to understand the London bridge sex move. The bridge sex position does require a bit of flexibility and stamina, so be prepared to do it right. Grab your partner, have a cup of tea, and then get ready for some back-bending fun for you both.\n\nHer: Get on your back on your bed or another surface. Then begin arching your back slowly while keeping your feet flat on the ground. Use your arms to stabilize yourself.\n\nHim: For the London bridge sex position, hover on top of your partner. Grab her around the waste and pull her closer to you. Enter her from between her open knees and keep your legs together. Stabilize yourself with one arm on the bed and go to town!\n\nWhy It Rocks: The bridge sex position is a great workout and gives you perfect access to all the best parts of each other.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Helicopter Sex Position",
            "content": "Go buck wild with the helicopter sex position. “Get to the chopper” takes on a whole new meaning with the helicopter sex move. You probably haven\u0027t heard of this move before, let alone used it in your sex life. So, if you haven\u0027t, then you have to try it out. Here\u0027s what you need to know to nail on your first go.\n\nHer: Lie on her stomach and grab ahold of your partner\u0027s feet as he goes to town on you like a helicopter landing on a launch pad.\n\nHim: Lie on top of her in the opposite direction. Grab ahold of her feet and kiss and lick her feet. Enter her from the top by laying the opposite way. Arch your back slightly and enter her from behind.\n\nWhy It Rocks: The helicopter style sex position is one hell of a way to get it on. It\u0027s unique, sexy, and totally hot. You\u0027ll love the way it makes you both feel.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Butter Churner Sex Position",
            "content": "Churn her butter like a pro with the butter churner sex position. Whether you just love awkward sex positions or want to spice things up, this position will you both make your own butter. Grind it out like they do in the movies, with this one of a kind truly unique sex position. Grab a paper and pen, you\u0027re going to want to take notes…\n\nHer: First, lie on the bed on your back, then arch your back and put your feet up into the air so your partner can grab your feet. Stabilize yourself with your forearms on the bed.  Kick your feet backwards and enjoy the ride.\n\nHim: Sit on top of your partner and grab her legs, pushing them slightly forward. Enter her from on top and churn that butter until she gets exactly what she\u0027s looking for.\n\nWhy It Rocks: The Butter churner position is not only hot it\u0027s also awkward — maybe that\u0027s why its hot? Explore each other like never before.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Turning – Three Eyed Turtle",
            "content": "When your roll in the hay turns into an acrobatic dance, pull out this move. Gentlemen, it is one of the  most difficult moves to pull off, but if you can do it without your penis snapping off you\u0027ll prove us all wrong. It\u0027s the fourth position in a four-posture sex position, and this final move involves turning all the way around. And as for the turtle, well, we\u0027ll let you use your imagination to figure out what they meant. Here\u0027s how to make the three eyed turtle your b****.\n\nHer: Lay down flat on your back, keep your legs together and even lay one foot on top of the other. The objective is to stay as flat as you possibly can while your man does his thing. Wrap your arms around his  back and feel free to explore.\n\nHim: Lay flat on top of her, your bodies pressed together like the perfect panni. Enter her from the top and give her what she wants. Twist your body all the way around while you stay inside her. Go ahead, try it, we dare you.\n\nWhy It Rocks: The Three Eyed Turtle is as unique as it is intimate. You can\u0027t get much closer than begin flesh with the one you find oh so hot.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Rainbow Arch",
            "content": "The pot of gold at the end of this rainbow is oh so much sweeter than just gold itself. It\u0027s a hot, sweaty, sticky bucket of goodness. The Rainbow Arch sexual position gives you both what you want, the perfect angle and a killer view. Getting intimate with the one you love or just a one night stand just got a whole lot better thanks to this position. Here is how you can master it no matter what situation you find yourself in.\n\nHer: Lay on your side with a slight back bend. Turn your neck to look over your shoulder and let your arms spill out where they may go or take one of your hands and start rubbing yourself. It will feel amazing. Spread your legs almost Indian style.\n\nHim: Enter your girl from behind and to the side. Brace yourself with your arm and slightly separate your legs, putting one in between her legs. Then get busy. Use one of your hands to rub her off while you penetrate her for the perfect touch.\n\nWhy It Rocks: Easy access to all the fun bits and it gives everyone a great view!\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Race Of The Member",
            "content": "Ever watched a horse race? If ya have, then this position will look familiar. Race of The Member is a great twist on woman on top, and it makes for something of an experiment if you\u0027re into that. It lets you both explore areas of your body you might not have. A word of caution: it is a physically demanding position, so be ready to get your sweat on.\n\nHim: Lay your back and bring your legs to your chest. Your legs will then form a “V” shape that your lady friend can sit on top of like a saddle. Your work is pretty much done at this point. Play horsey, it\u0027s fun.\n\nHer: Straddle your man\u0027s legs and squat down on top of his penis. You get to control all the thrusting by flexing at your knees, like you would if you\u0027re riding a horse.\n\nWhy It Rocks: The position creates a great angle that increases friction between your naught bits. It\u0027s also a fun take on traditional positions.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Tenth Posture of The Perfumed Garden",
            "content": "Nothing sounds quite as exotic as the Tenth Posture of the Perfumed Garden. This one-of-a-kind sexual position is so intimate and so hot they had to give it a six word name. But we have to admit, you\u0027ll want to stop and smell the roses with this super hot sex position. Here\u0027s how you do it like the pros.\n\nHim: Lay on your back on the bed. Pull your knees closer to your chest and put your hands on her behind or hold onto your headboard behind you for added leverage. Let her go to town on your member while you enjoy an up-close-and-personal view of her chest.\n\nHer: Straddle your man with your legs bent in a butterfly position. Slide down on his penis and slightly arch your back. Place your hands on either side of his head and begin to ride him like he\u0027ll never forget.\n\nWhy It Rocks: The combination of titties in the face and total control going over to the lady, makes this sex position everything a good sex session should be.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Pretzel",
            "content": "Fluffy, fresh pretzel\u0027s might be the best thing you can eat with an ice cold beer. Similarly, this sex position is sure to get your mouth watering. Sensual, but requires a bit of extra effort on both partners\u0027 parts, you can\u0027t nail this position unless you have some core strength. Get wrapped up in a hot sex session with this killer sex position. Get busy with these instructions:\n\nHim: Kneel down with your toes curled up and grab your partner by the upper back. Wrap your arms around her and penetrate her as slowly as possible to start. Once she is worked and rearing to go, get busy on her body.\n\nHer: Kneel down facing your partner. Lift one of your legs up to allow your man to enter you from underneath and slightly bend your back. Wrap your lifted leg around your partner to get the full affect of his member inside of you.\n\nWhy It Rocks: It is a new take on the same ole man on top sex position. Ladies love the way it feels and of course so do the guys.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Ass In The Air",
            "content": "Get your daily work out in and climax with the “Ass in the Air” sexual position. Perfect for male and female relationships, this deliciously sensual position will get your juices flowing like nothing else. Plus, it works out those coveted abdominal muscles for a yummy combination that everyone will love. Here\u0027s how you do it.\n\nHer: Lay on your back and put your legs in the air. Grab ahold of your man\u0027s upper thighs as he penetrates you. Relax and place your legs on either side of your man\u0027s head.\n\nHim: Squat in front of your woman as she places her legs on top of you. Spread your hips and brace yourself with your fist on the bed. Lean forward and plow your partner until she can\u0027t take it anymore.\n\nWhy It Rocks: It rocks because one, you are getting laid so of course it rocks, and two, you get to longingly gaze into your partner\u0027s eyes while you watch them move and moan.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Chair",
            "content": "Chairs are a great place to sit. Everyone likes to sit. You\u0027ll like to sit even more with The Chair sex position. If you have a good deal of balance, and if you don\u0027t mind sitting while you screw, then this position is sure to please. Stop googling “sex position the chair” and start getting busy with our complete breakdown of this tantalizing position.\n\nHim: Squat down on your knees. Make sure your member is fully erect because in this position it has to be. Be sure to balance yourself as best you can so you can hold on to your partner\u0027s hips as she rides you from the front.\n\nHer: Squat down on to your partner\u0027s member until he penetrates you fully. Rock up and down on his member for a totally great time.\n\nWhy It Rocks: Not only do you get to experience some spine-tingling pleasure, but the chair sex position also gives you both a great workout.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Froggy Style",
            "content": "If you love amphibians, then you love this froggy style sex position. Seriously, all you need is some webbed toes and a pond. Wait, do frogs have webbed toes? Who cares, all that matters is this is one fun and sexy sex position. You don\u0027t have to be a pro to do this sex position froggy style, so spread your legs and get busy, you will love this position.\n\nHer: Lay on your back with your feet up in the air. Put your hands on either side of his legs. Bend your legs slightly as you rest your legs on top of his shoulders.\n\nHim: Sit down on your butt with your legs spread out. Slide into your partner easily and gently rock back and forth and move her up and down on your member. Bend over slightly to get the angle right.\n\nWhy It Rocks: You can hit it from whatever angle feels best for you both and you get easy access to the front of her body.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Fourth Posture Of The Perfumed Garden",
            "content": "There is nothing quite like pleasuring your partner. Luckily, the Fourth Posture of the Perfumed Garden sexual position makes it easy to do exactly that. Explore your partner\u0027s “garden” so-to-speak with a penetration posture that is a great finisher for a fun romp in bed together. Male and female relationships will definitely benefit from this position.\n\nHer: Lay on your back with your legs in the air and spread fairly wide. Once your partner gets on top, position one leg on each side of his head resting your feet on his shoulders. Grab ahold of his arms and stare up at him with all the love you can muster.\n\nHim: Climb on top of your partner with your hips meeting her ass as move in and out. Brace your arms on either side of her shoulders and let the motion of the ocean carry you away to happy town.\n\nWhy It Rocks: It\u0027s all about angles baby, angles. You can\u0027t reach the spots that you can with this sexual position. Get grinding and moving, your partner will love it!\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Eigth Posture Of The Perfumed Garden",
            "content": "Looking for tighter, hotter, and more intimate sex? Then The Eight Posture of the Perfumed Garden position is sure to get things flowing rather nicely. Exciting enough for just about any new couple, this position pleases the senses while tantalizing the nether regions. Some people also call it “the pry-bar” and if you do it you will find out why. Here\u0027s how to do this sexual position the right way without ending up in the emergency room.\n\nHer: Lay down flat on your bed/surface. Prop your head up on a pillow. Keep your legs flesh together and touch your partner wherever you fancy as he goes to town on you.\n\nHim: Straddle your lady partner with your knees positioned on both sides of her. Enter her from top and then buck like a wild cowboy. Brace yourself with one hand on her back thigh and one hand on the top half of her delicious body.\n\nWhy It Rocks: This sexual position is awesome because it gives you free reign with your hands. It can be difficult to pull off and depending on the size of the man\u0027s member it can be impossible. But if you can do it, it certainly is hot.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Crazy Upside-Down Squat",
            "content": "You know those street performers, the ones who you watch do crazy things and think to yourself “I could never do THAT”, well this sexual position is kind of like that. The Crazy Up Side Down Squat requires strength, patience, and an open mind to pull off. But if you do it right, it can bestow the pleasure of the gods upon you. Grab your favorite F buddy and go crazy with this crazy squat sex position. Here\u0027s how to do it.\n\nHim: Lay on your back and lean back with your legs in the air until you are almost doing a half backwards flip. Grab ahold of your partner\u0027s hands for stability.\n\nHer: Squat down backwards on your partner\u0027s junk. Squat on top of him and slide up and down while holding his hands to brace yourself. Keep him in place with your legs and your ass as you grind it out until he explodes.\n\nWhy It Rocks: This sexual position is almost a novelty position. But if you follow these steps, you can get incredible pleasure.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Crazy Criss-Cross",
            "content": "It doesn\u0027t get much crazier than this. Just kidding, but for real this position is not for people who don\u0027t like feet. It\u0027s intimate with one of the smelliest parts of the human body. Or, maybe you have feet that smell like roses who knows. But whatever the case, the Crazy Criss Cross is sure to test your ability to pleasure your partner. It almost looks like UFC manoeuvre, we\u0027ll let you judge.\n\nHim: Lay back with your legs spread out. Pull your partner\u0027s leg on top of you while her other leg spills out underneath you and to the side. She\u0027ll lie back giving you total access to her clit and other fun parts. Start going to town to enjoy some truly sensual sex.\n\nHer: Put one leg on top of your partner from a laying down position. Allow your other leg to lay slightly bend and relaxed. Let your man penetrate you like the pro he his.\n\nWhy It Rocks: Since you\u0027re both laying down it doesn\u0027t require a ton of physical exertion.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Winged Eros",
            "content": "You never know how hot your love life is until you start looking at sexual positions named after Greek Gods. If you\u0027re weird enough, then The Winged Eros sexual position is sure to fit your style. And you have to hand it to the Greeks, they knew a thing or two about making love. This sex position is named after the god of Love and son of Aphrodite. Here\u0027s how get down like the Gods.\n\nHim: Sit down on your but and prop yourself up on your arms with your legs completely spread as wide as you can get them. Basically, spread all four of your “wings”.\n\nHer: Mirror his position and sit on top. Except, put your legs up and over his legs while you stare lovingly into his eyes. Grab hold of his neck to stabilize yourself and let him go to town on you from underneath.\n\nWhy It Rocks: It\u0027s intimate and named after Greek Gods. What else could you possibly want?\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Space Monkey",
            "content": "Are you strong? Fit? Healthy enough to work out regularly? If so, then The Space Monkey is a great move for you to try out. Oh, we forgot to ask if you were also a superhero, we knew there was something we left out. So yeah, if you\u0027re a Marvel character or Game of Thrones hero, this move is a great option for you. You\u0027ll see what we mean if you read on…\n\nHer: Get in the downward dog position. If you\u0027re not familiar, put your ass up in the air with your hands flat on the ground in front of you. Lean back and let him go to town on you.\n\nHim: Slide yourself over her ass from the opposite position and hope your member falls in between her legs and into her lady parts. Hold on to her legs and kick your legs straight out in the air.\n\nWhy It Rocks: It only rocks if you can actually do this move. If you can, then it is one of the men on top positions. You\u0027ll be a superhero if you can kill it.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Daisy Chain",
            "content": "Ever imagine doing something that is totally ridiculous and completely unnecessary? If so, this is the right sex position for you and your lover. We have to say up front, if you aren\u0027t in to Yoga, Gymnastics or some sort of superhuman workout regime, this is NOT the sex position for you. Seriously, you need to be an expert in athletics to even look at this image. If you do dare to test your strength and flexibility, here\u0027s what you need to know about this position.\n\nHer: Basically do a back flip with your body completely stretched out behind you with your legs spreading and his member meeting you in the middle of the air. Let your legs hang there while he penetrates you.\n\nHim: Get into a head stand and then hold your legs out half way in an upside down “L” shape. Hold your headstand with your arms and shoulders on the floor.\n\nWhy It Rocks: It\u0027s hard to argue this sex position rocks. But it does make for a good story if you both can do it!\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Cross Legged Mutant",
            "content": "If you find mutants sexy, then you will definitely like this sex position. And you most certainly have to be a mutant to like the cross legged mutant position. Just kidding, but you do have to be strong, flexible, and willing to try something a bit challenging in the bedroom. You won\u0027t soon forget your encounter with this move. So, without further ado, here\u0027s how to master the mutant in your bedroom.\n\nHim: Stand straight up and pick up your female partner. Lean slightly backwards. Grab your partner by the hips and stare into her eyes and penetrate her from underneath.\n\nHer: Let your partner pick you up and wrap your legs around his neck but cross them before they do. Wrap your arms around his neck and relax as he gives it to you.\n\nWhy It Rocks: If you can pull this one off, you\u0027ll be a god and goddess. Truly. Both of you will be badasses who have our total respect.\n",
            "category": "Acrobatic",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Screwdriver Sex Position",
            "content": "The screwdriver sex position is one of those quirky sex positions that challenges both parties to mix up a classic sex position. With the screwdriver position, get ready to bend and twist until ultimate penetration is achieved:\n\nHim: As your woman opens her lips to you, facing away, approach her from behind and place your leg leg over her upper thigh. Using your right leg for stability beneath you, hang onto her love handles while you gently plow into her.\n\nHer: Get on all fours like you\u0027re ready for doggystyle sex. Spread your legs wide, arch your back, and pop your pussy high into the air so your man can wiggle his way in.\n\nWhy It Rocks: This rear entry sex position is a twisted take on doggystyle, providing both parties with ultimate control and pleasure. With some patience, maneuver into place for total penetration.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Sagittarius Sex Position",
            "content": "This standing up sex position will challenge both of you to wiggle your way into place.\n\nThe Sagittarius sex position is not for the faint of heart, especially if you\u0027re a woman. Requiring the man to exercise extreme strength, this standing up sex position provides intense, direct penetration that will raise eyebrows:\n\nHim: You get to stand regularly during this one, although you\u0027re going to be tasked with stabilizing and supporting your woman. Grab her waist with your left hand as she swings her right leg over your right thigh. Pick up her right thigh and position her perfectly atop your cock.\n\nHer: Backwards, snuggle up next to your man as he puts you in place. Put your left hand behind your head for stability, and get ready for some serious penetration that will certainly wake you up.\n\nWhy It Rocks: This is a flexible way to achieve deep, mind-numbing penetration that can be done anytime, anywhere. Just remember to be patient while the woman gets into proper position!\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Prison Style Sex Position",
            "content": "Named for the little space required to get it right, the prison style sex position is a simple, yet challenging way to fuck deep and hard right out in the open. You can make it work just about anywhere, and here\u0027s how:\n\nHim: You get to simply walk up and assume your woman from behind, grabbing her love handles for stability during the dirty prison style sex.\n\nHer: You have to assume a more flexible position here, which is why stretching out your hamstrings ahead of the devious act might be a good idea. Back onto your man, facing away from him, while you position his cock and bend over as far forward as possible. Bonus points if you can get your head to touch your legs.\n\nWhy It Rocks: The prisoner sex position can be done anywhere, on a plane, at work, at home, in your kitchen, or yes, even in prison. It\u0027s a great standing up sex position to try when you get some time.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Nirvana Sex Position",
            "content": "The nirvana sex position takes missionary style sex to the next level, with a deeper penetration that will feel amazing to both parties. With just a little flexibility, here\u0027s how you can make it happen:\n\nHer: Lay down on the bed with your head down. Get ready to bend your legs straight at a 90-degree angle. Have your man pick up your legs and place them against his body for stability while he gets ready to peg you deeply.\n\nHim: Once your woman lays down, get on your knees and approach her body, placing her legs straight against you. Position yourself so you can drill your cock deep into her lady garden as she playfully plays with her tits in front of you.\n\nWhy It Rocks: Nirvana sex is named so for the pleasurable state of nirvana that is instantaneously achieved. If you\u0027re up for the challenge, the nirvana position will challenge both of you to see sex from a new angle.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Leap Frog Sex Position",
            "content": "This clever standing position places the woman in a frog like stance while deep and illustrious plowing takes place from behind.\n\nIf you love standing sex, the Leap Frog Sex Position is a fun and easy way to achieve total penetration, feeling good for both parties involved. Get into position, legs and hands planted, and open up for backside fucking.\n\nHim: You get to show off your strength in this one, simply standing with your legs slightly spread while you support your woman at her hips. As she backs onto you, help her position herself perfectly, leap frogged and ready to go.\n\nHer: Back onto your man, pussy popped up high, with your legs in-between his, as you bend down forward and use your fingertips to support the upper half of your body. As you get in the rhythm, you\u0027ll start to assume the shape of a frog leaping for joy, begging for more.\n\nWhy It Rocks: This is a generally easy standing sex position that doesn\u0027t require too much flexibility from the woman. Also a backside penetration opportunity, if you take the time to get the angles right, it will feel amazing for both parties.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Lap Dance Sex Position",
            "content": "This is a mutually pleasure-filled sex position that will drive men and women crazy, begging for more.\n\nIf you like to add a little something extra to your sex-making experience, the Lap Dance Sex Position takes it to the next level for both men and women. With extra fondling, double attention, and penetration that is direct and sincere, it\u0027s an easy to achieve lap sex position you\u0027ll want to try this week.\n\nHim: Simply sit down with your legs bent at your knees to either side of you, lean back, and present your cock out and proud for your lady. As she gets onto you, facing away, legs apart, hold her from the front, hanging onto her tits for dear life while she bounces around on top of you.\n\nHer: It\u0027s time for some lap dance sex! Back yourself onto your man slowly, penetrating at your leisure, with your legs spread out to either side. Your hands are free to use in this one, so play with yourself or hold the cock to the right angle down below you while your man fondles your breasts.\n\nWhy It Rocks: If you\u0027re a woman who likes extra foreplay while fucking, or a man that wants to immerse himself in breasts any chance he can, this easy sitting sex position requires a flat surface and that\u0027s it! Give it a spin.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Kneeling Sex Position",
            "content": "The Kneeling Sex Position is a new kind of lovemaking sex position that\u0027s easy, intimate, and achievable just about anywhere!\n\nIf you want to face your love while you make deep love, the Kneeling Sex Position is an easy and comfortable way to make it happen. All you need is a bed or a hard surface and some time.\n\nHim: Simply get on your knees, with your legs gently tucked under you, and embrace your woman as she approaches you, tits out, hair down, and pussy ready for the taking.\n\nHer: Approach your man and ease yourself onto him, with your legs spread to either side of him. Use your right arm for stability, and grab him with your left arm to control the amount of penetration you receive as you get going.\n\nWhy It Rocks: This is an incredibly easy and user-friendly lovemaking sex position that can work for anyone. It requires zero flexibility or even that much strength, and with a little patience, can feel incredibly rewarding for both parties involved.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Elephant Sex Position",
            "content": "Facing each other in a delicate arrangement, hold on tight while you thump and thud your way to cumming heaven.\n\nThe Elephant Sex Position is one of those wild, crazy, and intimate love making positions that will put you face to face with your love while you ride each other deep and enchantingly.\n\nHim: You get to show off your strength and manliness in this move. Support your woman on your thighs while you wrap her legs around your back, holding her tight at her ass. With your strength enter her, over and over again, supporting her stance while getting really manly.\n\nHer: Let your man carry you, support you, and make love to you the sex position elephant style. Wrap your legs around his back and place your hands behind his neck, holding on tightly while the pleasure ensues.\n\nWhy It Rocks: So long as the man is able to support the weight of the woman, this is an intimate and eye-to-eye lovemaking position that will bring the two of you closer than ever before.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Eiffel Tower Sex Position",
            "content": "This is a perfect standing sex position that provides couples with a way to make love hard while whisking off to Paris.\n\nWhat does the Eiffel tower mean sexually? If you like having sex standing up, the Eiffel Tower Sex move is an easy way to make it happen, requiring nothing but a little flexibility from the lady. The Eiffel Tower Position enables great pleasure for both parties, with a doggystyle entrance from behind.\n\nHim: You get to stand and simply grab your woman\u0027s hips from behind, plowing her hard and providing her balance while she bends forward.\n\nHer: This requires a little bit of limber movement in your legs and back as you bend forward to create an arch with your body. As you assume position and create Eiffel tower sex definition, plant your palms firmly on the ground while your man does the rest.\n\nWhy It Rocks: The Eiffel Tower Sex Position requires no furniture, wall, or space to get it right. If the woman is willing to be head down, after some patience and stretching, it can be a relatively comfortable fucking experience.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Downward Dog Sex Position",
            "content": "Every man\u0027s favorite position is probably downward dog sex, grabbing his woman from behind with primitive force while pleasuring her into the wee hours of the morning. With the Downward Dog Sex Position, this kinky and dominatrix style domination leaves the woman helplessly screaming for more. Here\u0027s how:\n\nHim: Of all the different doggystyle positions, this one places you in ultimate control as you enter her from behind. For ultimate penetration, place her face down on the bed while you kneel on the floor, grabbing her arms and locking them to her back so she can\u0027t move.\n\nHer: Get on your knees on the ground and lay your torso on the bed, face down. Allow your man to enter you, grabbing your arms behind your back so you can\u0027t move or resist. This downward dog sex style will leave you sexually helpless and begging for more.\n\nWhy It Rocks: Every man loves doggystyle sex – it\u0027s a known fact. If you\u0027re a woman looking to be dominated and punished for the bad girl you\u0027ve been, this is an easy position that requires an elevated surface. Otherwise, get to work!\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Dolphin Sex Position",
            "content": "The Dolphin Sex Position is perfect for couples looking to mix things up while trying a classic stand and carry sex pose. Dolphin style sex is perfect for those wishing to join the mile-high club, requiring little space or furniture – just some kind of support rest to keep your balance while the thrusting ensues. Here\u0027s how:\n\nHim: You\u0027re in charge of keeping your woman balanced while supporting her right leg as it bends upward above yours. Grab her leg at the knee and use your opposite hand to grab her ass for stability while you drill into her, standing up.\n\nHer: Once your man grabs your right leg, tilt your body halfway away from him, using the wall with your left hand to stabilize your balance. The dolphin sex position does require some agility on your part, so don\u0027t be afraid to go style while you get your balance.\n\nWhy It Rocks: The dolphin position is an easy way to bust into love thrusting anytime, anywhere. If you have the patience to get the twisting into position for perfect dolphin style sex, the reward is definitely worth it.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Corkscrew Sex Position",
            "content": "The Corkscrew Sex Position is one of those classic “porn” sex positions plastered around the Internet today. It makes for quite the show, and opens the female up for full, deep exposure. Slightly animalistic, there\u0027s something delicious and alluring about it. Here\u0027s how to make it happen:\n\nHim: Get down on your knees and grab your woman from an angle, facing away from you. Place her right leg atop your hip, opening her up while her other leg remains relax at your knees. As she grabs your back, from the side, enter her slowly until you get the rhythm moving.\n\nHer: This pose requires some agility on your end. Place your right leg over your man\u0027s hip, facing away from him, opening up while your left leg remains on the bed. With your right arm, grab onto his back and hold on tight.\n\nWhy It Rocks: This is a deep sex position for ultimate pleasure that places both parties in direct contact with one another. If taken slow with patience, you\u0027ll experience some of the best sex in your life. Get ready to hang on tight and remember to keep your body relaxed.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "CEO Sex Position",
            "content": "You\u0027re probably wondering right now: what is the CEO sex position? We\u0027re glad you asked! The CEO Sex Position is a naughty two-player move that allows for deep and lustrous penetration, without any furniture required. Here\u0027s how to make it happen.\n\nHim: The CEO position is a great way for you to grab and dominate your woman from behind, controlling your thrusts while you deeply enter her. Allow her to bend at a 45-degree angle, pussy up and out, ready for the taking. Grab onto her love handles and get to work.\n\nHer: Face away from your man and bend your abdomen to a 45-degree angle. Allow him to grab you from behind and position himself perfectly, hanging onto your waist throughout the experience.\n\nWhy It Rocks: The CEO Sex Position is incredibly easy to perform and requires little strength or agility from both parties. It can be easily done in a bathroom, office, or bedroom, making it one of those dirty little secrets that many a CEO has performed in their office behind closed doors.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Carrying Sex Position",
            "content": "Who\u0027s ready for some good, old fashioned stand and carry sex? The Carrying Sex Position is one of those classic standing sex poses you have probably seen in movies and TV shows. It\u0027s loving, intimate, dirty, and sexy all at once, and here\u0027s how to make it happen:\n\nHim: Are you ready to lift your girl entirely off the ground? This is a sex position that enables you to flex your strength and really show off your physical fitness. If you\u0027ve been going to the gym, give it a whirl.\n\nHer: It\u0027s up to your man to support you throughout this pose. Allow him to pick you up. Wrap your legs around him, facing him, with your arms around his neck. Provide him with guidance as he enters you, ensuring the feeling is mutually pleasurable for everyone involved.\n\nWhy It Rocks: This is one of the best sex positions to satisfy a man, putting him in control while women ride it out, being held and caressed through the act. It might be old fashioned and intimate, but it\u0027s a great way to connect while fucking each other into oblivion.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Bicycle Sex Position",
            "content": "This is certainly a creative sex position, one that is relaxing and easy for the man to maneuver. As for the ladies, get ready to get in some back stretches, while you arch your body into a perfect position for deep and illustrious sex. Here\u0027s how:\n\nHim: Bicycle sex is awesome for guys, requiring them to do nothing except stand up straight and hold onto their women, at the hips, through the motion. Show off your arm strength in this position, providing her with support while you take her from behind.\n\nHer: Form an arch with your body, balancing your front with your hands while you look down. Your man will grab you from behind, with his legs spread out around yours, entering you with ease and poise. Hold still and let it rock and roll.\n\nWhy It Rocks: The Bicycle Sex Position requires no bed or furniture to make it happen. That way you can assume position anywhere, anytime, requiring little agility to achieve that perfect synergy.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Bent Over Sex Position",
            "content": "When we say bent over, we mean it with this pose. Try out bent over sex in a whole new way, exploring the new angling that will rejuvenate your sex life – for both of you. Here\u0027s how:\n\nHim: Every guy loves from behind sex positions, and the Bent Over Sex Position is no different. This is a sex pose for you, as your woman does all the work, simply plow her from behind to her liking. Hold her lower back steady while you take her.\n\nHer: Time to get in your stretching. Keep your legs together and bend forward, stabilizing yourself with your hands on the ground. This requires some flexibility to keep it fun for you, so keep that in mind while you warm up.\n\nWhy It Rocks: What\u0027s better than bend over positions? This must try sex position is an easy way to get the job done, requiring no bed or furniture. Do it in the bathroom, on a plane, or in a tent. It\u0027s that easy!\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Ballerina Sex Position",
            "content": "This stand and carry form of sex requires both parties to be agile, flexible, and ready to assume awkward physical positions for maximum pleasure. This one is not for the faint of heart, and if you don\u0027t like exerting yourself during sexy time, then you\u0027re not going to like this split sex position. Here\u0027s how to make the Ballerina Sex Position come to life:\n\nHim: Lucky for you, you simply need to maintain a tall, erect pose so your woman can dance around you. She will be using your neck as the rest for her hand and ankle, where she grabs her foot to create the ballerina stance that opens her up for direct penetration.\n\nHer: Get ready to pull out all of the moves. You will need a furniture piece for balance. Gently lift one leg above your lover\u0027s head, grabbing it with the hand on the same side of the body. Stabilize yourself with the other hand, and let him do the rest.\n\nWhy It Rocks: If you have the strength and agility to hold the ballerina position, get ready for some of the most amazing sex in your life. Due to the position, enjoy deep, meaningful penetration that will produce screams by the end.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Backshot Sex Position",
            "content": "Are you ready to get down and dirty with this super hot back shot position? Get ready to be taken from behind doggystyle, adding more thrust and passion to this movement that will leave both parties moaning for more. Here\u0027s how to get this doggy style look alike right the first time:\n\nHim: Lean up against your woman, with your legs spread out equally over hers, taking her from behind while you rest both of your hands on her back to keep her steady and inline with your thrusts. Since back style shots prevent deep penetration, go to town on her body.\n\nHer: Get on all fours, legs spread, and ass popped so your man can inch up against you and penetrate as deeply as possible in this position. Hold yourself on all fours and let him do the rest. Relax, and enjoy the ride!\n\nWhy It Rocks: Back shot sex is notoriously one of the best sex positions for pleasure in women. Similar to the doggystyle pose, enjoy this new angling of pleasure that feels incredible for both parties, earning it the title as one of the “perfect sex positions” in the game today.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Aquarius Sex Position",
            "content": "This is one of those fun sex positions for girls, placing all of the heavy lifting on the guy. It\u0027s a great starter sex position for couples looking to experiment, as it requires minimal strength or flexibility from both parties. Spend some time getting the angling right so you both feel like it\u0027s working for you.\n\nHim: Saddle up cowboy and grab your woman like a man. This is a great sex position in bed in which you can show her your manliness, spreading her legs and allowing her lower half to rest on the support of your thighs. Grab onto her hips to keep her steady.\n\nHer: If you love sex positions in which you feel like you are being dominated, the Aquarius sex style is right for you. Lay back, and allow your partner to grab you like a man, pull you close, and penetrate you in style. You can simply lay back, relax, and let him do all the work.\n\nWhy It Rocks: This is a user-friendly sex position that feels good to both men and women, requiring little acrobatic experience, flexibility, or strength to get it right. With a little practice, find the angle that works for the both of you, and ride the night away.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Tabletop Sex Position",
            "content": "Pull out your table and make sure it is tough because its going to need to be for this move. The tabletop sex position is sure to please both of you two and can get you one step closer to the big “O”.  And if you\u0027re a guy looking to please the ladies, this is a favorite sex position for females. Its angles are perfect for hitting her sensual spots. This sex position needs a tabletop, so be sure to break that out. Here\u0027s how to do it.\n\nHim: Stand in front of your lady with your hips slightly parted. Pick her up and put her ass on your tabletop. Grab her hips and grind into her as she lays back on the tabletop.\n\nHer: Brace yourself on the tabletop behind you and spread your legs slightly so he can enter you from the front.\n\nWhy It Rocks: The tabletop sex position is guaranteed to make her say “Oh My God!” What else is there to really say. Try it. You\u0027re welcome.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Superman Sex Position",
            "content": "Superman is the hero to beat all heroes. And if you want to be a hero in the bedroom, then the superman sex position is the best move to use. That\u0027s right, this move will shock her to her core and giver her one sex session to remember. The superman sex move has all the bells and whistles a great sex move should. Maybe you\u0027re just looking for a lifting sex position, whatever your situation is, you\u0027ll love this move.\n\nHim: Stand up with your legs separated so you can carefully lift your partner. Bend your legs slightly. Grab your lady from behind, pick her up, and put her on your member. Hold onto her hips as tightly as possible as you grind into her from behind.\n\nHer: Relax and let your partner pick you up. Once he does, lift your legs backwards and wrap them around his hips.\n\nWhy It Rocks: The superman sex position is a great lifting sex position for exercise and it also makes you look like you could do anything. Who wouldn\u0027t want that?\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Bulldog Sex Position",
            "content": "Get your doggie style on in a whole new way. The Bulldog Position is the ideal sex position for couples wanting to spice things up. This sex position with him on top keeps things sexy and tantalizing for both parties. So why is it called the Bulldog? Well, let us tell you.\n\nHer: Get on your hands and knees. Spread your legs a little wider than your hips. Twist backwards to make eye contact with your partner.\n\nHim: Climb on top of your partner with your knees hugging the sides of her hips and with your toes on your tips. Put your hands into a fist just like a bulldog. Give your girl a kiss right on the lips as you hump her like the dog you are.\n\nWhy It Rocks: Hands down this is one of the top sex positions with him on top. The bulldog position gives you the intimacy you crave with the dirtiness to keep things hot.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Standing, He is Behind",
            "content": "If you\u0027ve ever watched a sex scene in a movie, you\u0027ve probably seen this standing sex position. It\u0027s classic, allows you both to enjoy yourself, and is super convenient. Let\u0027s face it, when you\u0027re hot and bothered you can\u0027t be bothered to figure out what standing up sex position is right for you. Instead, you want to get right to the source. This position gets you there. It allows you both to throw off your clothes and get right to business. Forget about foreplay, just stand up and get going to town on one another, you\u0027ll be glad you did.\n\nHim: Stand behind your partner and enter her from behind. This position is also great for anal. Grab ahold of her hips and make her happy.\n\nHer: Stand in front of your partner and grab his head from behind you. Lift one foot slightly to make it easier for him to enter you.\n\nWhy It Rocks: It\u0027s a great standing sex position for both of you when you\u0027re ready to get busy.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Belly To Belly",
            "content": "Nothing says passion like a sex position standing up. We picked this stand and carry sex position because we\u0027ve seen it so many times in movies we thought it just made sense to include it. Intimacy is hot, especially for the ladies, and the Standing Belly to Belly position has plenty of it. You don\u0027t have to be in amazing shape to do this position either, all you have to have is a strong and passionate approach to your love life. And if you made your way to our website you probably have the latter. So our goal is to give you quality positions to work with. To nail this sexual position, read the following.\n\nHer: Stand in front of your partner and drape your leg around his hip. Pick up your knee as high as possible and wrap your arms around his neck. Let him grab your hip and go to town on your lady parts.\n\nHim: Stand in front of your lady and press yourself into her. Kiss her neck, shoulders, and body to up the sensual pleasure for both of you.\n\nWhy It Rocks: It\u0027s intimate and fairly easy to do.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Classic Kneel",
            "content": "You know how football players are taking a knee in the United States in protest? Well, this kneeling sex position is kind of like that but better, and it is definitely way more fun. The Classic Kneel sex position kneeling move is ideal if you want the ultimate in sexual pleasure. No other position gives you access to the backside of your lady quite like this move, and for her, it feels amazing thanks to a killer angle. Before we have you salivating at the mouth, here\u0027s how to nail this move the next time you have sex.\n\nHer: Bend down on your knees with your legs tight together. Lean forward as far as it feels comfortable and hold onto his hips with your hands.\n\nHim: Get onto your knees behind your partner and spread your hips as wide as possible. Grab ahold of her hips with your hands and hold on tight. Lean back slightly and keep her in place while you both enjoy the experience.\n\nWhy It Rocks: It\u0027s a kneeling sex position that\u0027s pretty easy to execute and feels oh so good for both of you.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "He is Standing Next To The Bed",
            "content": "When you\u0027ve run out of sex ideas, this position might reignite the flame. It is one of the best sex positions for standing up in our selection. And if you\u0027re thinking it is too difficult or requires too much work, let us stop you right there. It\u0027s one of the easiest standing sexual positions you can do. With the right bed and cushioning, you can enjoy a sexy night in with the one you love. Not sure how to do it? Here are our tips:\n\nHer: Kneel on the bed with your legs spread as wide as they can go. Lean back into your lover\u0027s arms and let him touch you in all the best places. Relax and enjoy the experience.\n\nHim: Stand behind her off the bed. Enter her from behind and let your hands wander to her breasts and to her most beautiful body part. Revel in the ecstasy of the moment.\n\nWhy It Rocks: It is hands down the most sensual among our best sex positions for standing up.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Driving The Peg Home",
            "content": "Like being pinned against the wall? There\u0027s no doubt about it, being pinned down can be super-hot, if the right person is doing the pinning, of course. This is one of those standing sexual positions that connects you with your partner in a whole new way. It\u0027s exciting, makes for the perfect eye contact, and nothing else will get you going quite like it. If you\u0027re looking for some of the best sex positions for standing up, this one should top your list. It\u0027s called Driving The Peg home for a reason.\n\nHim: Stand up in front of your girl and pick her up. Move over to a wall to brace her and yourself up against. Begin to thrust and move inside her but try to really pin her up against the wall to stabilize your movements.\n\nHer: Allow your man to pick you up and pin you against the wall. Wrap your legs tightly around his waist and keep them there as long as you can.\n\nWhy It Rocks: What other sex position will make you feel like you\u0027re starring in a romantic comedy? None other than this one. Brace yourself for some hard core love making, this one will get you hot.\n",
            "category": "Kneeling Or Standing",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "G Whiz Sex Position",
            "content": "Although the G Whiz Sex Position can be used for direct vaginal penetration, it\u0027s also a perfect pose to try out deep and mind-changing anal sex.\n\nIf you\u0027re ready to become a G spot wizard, the G Whiz Sex Position provides total penetration that is front and center, hard to escape. Take it one step farther and slip it into the anal cavity, trying out a new form of lovemaking.\n\nHim: The G Whiz position allows you to show off your thrusting skills as you support the backside of your woman, lifting her pussy and ass into the air with your hands on her hips. As she wraps her feet around your neck, peg her hard and deep in every opening.\n\nHer: Lay on your back and let your man do the heavy lifting, supporting your body by holding onto his thighs while you wrap your legs around his neck. Get ready for some screams, because this sex position goes deep.\n\nWhy It Rocks: This is one sex position that provides direct penetration opportunities, which is why the man needs to go slow at first before getting in a G spot groove.\n",
            "category": "Anal",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Bad Dog Anal",
            "content": "Whether you\u0027re looking for the best position for first time anal sex or just want to spice up your boring sex life with new positions for anal sex, the Bad Dog Anal sex move is sure to please. It\u0027s time to bring anal out of the dark. It is perfectly safe, fun, and feels amazing if you do it right. This position makes it easy for everyone to enjoy themselves. A slow introduction to this seemingly weird sex move is sure to please both of you. Here\u0027s how to do it right the first time.\n\nHer: First, find something to brace yourself against. Stretch your hands out on a couch, bed, or chair. Get on your knees with your legs and hips spread as wide as you can get them. Take some deep breaths as your man enters your most sensitive area.\n\nHim: Get on your knees behind your partner. Help her spread her legs by positioning yourself in between them. Brace yourself by putting your hands on her lower and upper back. Slowly enter your partner and listen to her cues.\n\nWhy It Rocks: The best part of this position is the use of a bed or couch. It allows her to relax into the moment so it\u0027s fun for everyone.\n",
            "category": "Anal",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Deep Anal",
            "content": "Deep Anal is the most comfortable position for anal sex if you\u0027ve done it once or twice. A good move if you\u0027re ready to feel your partner deep within you, this one might be best left to the pros. In our list of sex positions for anal, we are focused on adding sensual pleasure to your life in the best possible ways. IN a few deep breaths, you could experience untold pleasure without any extra effort on your part. When your partner is ready to add a new position into the mix, switch it up with this bad boy. Here\u0027s how to do it:\n\nHer: Lay down on a bed or couch with your legs stretched out on top of your partner\u0027s shoulders. Relax, taking at least three deep breaths before he enters you.\n\nHim: Straddle your partner like you would if you were about to get into missionary. Pick her up by tossing her legs on top of your shoulders. This helps lift her hips and gives you access to her back door.\n\nWhy It Rocks: It\u0027s comfortable for both people and helps her relax to enjoy the position like she\u0027s never experienced it before.\n",
            "category": "Anal",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Classic Anal",
            "content": "Keep things classy, with this move. It\u0027s the easiest position for anal sex because the area back there is thoroughly exposed. Similar to doggie style, but not quite, Classic Anal keeps things in check in all the best ways. When you\u0027re ready to try something timeless and truly amazing, all you have to do is assume the position, you\u0027ll love the way this move makes you feel. No other position gets both of you quivering in pleasure quiet like this anal position. Here\u0027s how to do it.\n\nHer: Get on your hands and knees with your legs spread out as wide as possible. Don\u0027t quite rest your head on the bed but relax enough to let your man ease into you.\n\nHim: Get on your knees behind your partner and grab ahold of her hips, holding them tight. Gaze down at your partner with pleasure as you give her the classic anal position.\n\nWhy It Rocks: It\u0027s classy, it\u0027s relaxing, and it feels oh so good.\n",
            "category": "Anal",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Anal Sex Spoon",
            "content": "You never have to settle for just standard anal sex positions. Instead, choose amazing anal sex positions like our “Anal Sex Spoon” move. Spooning anal has long been the favorite to those who do it regularly. After all, you\u0027re already back there, you might as well go to town on the parts that you\u0027re eyeing. There are better ways to do it than just sliding in. This position lets you get down with the right style, intimacy, and hotness. Here\u0027s what you need to know.\n\nHer: Lay down on your side. Position one hip farther forward than the other. This gives your main squeeze the ability to slide in between your thighs to hit the sweet spot.\n\nHim: Lay behind your lady in a spooning position. Place one hip and leg on top of her back leg and squeeze yourself into her behind. Grab ahold of her breasts and other fun bits to keep things spicy for you both. Move slowly in and out of her for a fun time she won\u0027t soon forget.\n\nWhy It Rocks: It\u0027s convenient, simple, and feels amazing for both of you!\n",
            "category": "Anal",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Lying Down Anal Sex",
            "content": "Finding good anal sex positions can be a pain in the you know what. But when you do find one, it\u0027s like a light at the end of the tunnel. Lucky for you, we have assembled the best anal sex positions for beginners and experienced folks alike. One of our favorite positions for beginners is the Lying Down Anal Sex move. It allows you both to relax if you haven\u0027t done anal before, and it provides pretty easy access to that region of her body. Here\u0027s the best way to do this position.\n\nHer: Lay down flat on your stomach with your legs flat on the bed. Turn your head slightly to one side. Place your hands out in front of you.\n\nHim: Lay on top of your partner with your legs straddling her on both sides. Enter her while on top and press your arms over her arms to keep her calm. Listen to her cues and enjoy the ride.\n\nWhy It Rocks: It\u0027s hot, easy to do, and helps you both relax. No pressure, all pleasure.\n",
            "category": "Anal",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Wheelbarrow Sex Position",
            "content": "Ever used a wheelbarrow for some yardwork? Yeah, the wheelbarrow sex position is kind of like that except it feels way better than doing yardwork. The good news is, you definitely don\u0027t need a wheelbarrow or any weird equipment to nail this position down. But what is the wheelbarrow position? Here is what you need to know to try it out with your favorite bedroom partner.\n\nHim: Stand up with your legs slightly bent. Hold onto your lady with your hands wrapped around her waist. Bend slightly at the hips and lean forward over her body. Hold on to her tightly to guarantee she doesn\u0027t fall.\n\nHer: Let your man hold on to you from behind. Wrap your legs around your man from behind and brace yourself on the surface below you to guarantee your safety. Let him enter you from behind and enjoy yourself.\n\nWhy It Rocks: The wheelbarrow sex position is sure to give you both one of the best orgasms of your life. Nothing else needs to be said.\n",
            "category": "Animated",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Praying Mantis Sex Position",
            "content": "You likely haven\u0027t envisioned yourself as an insect, but by the time you\u0027re done reading about the Praying Mantis sex position, you might just wish you were a part of the insect world. The praying mantis position sounds weird because it is weird. So, it\u0027s your turn to get weird. Embrace your inner insect. Grab an eager partner and do your stretches, this pray mantis sex position is sure to test your stamina.\n\nHer: Crouch down on your knees on your bed with your hips slightly apart. Stretch one of your legs back all the way. Stretch one of your arms out in front of you.\n\nHim: Climb behind your partner horizontally. Enter her from behind and at an angle. Hold on to her ass with one hand and brace yourself with your other hand on the bed. Lift your other leg above her ass like you\u0027re doing your business on a fire hydrant.\n\nWhy It Rocks: It\u0027s fun, it\u0027s weird, its like role playing! The praying mantis sex position is one of those moves you have to try at least once.\n",
            "category": "Animated",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Lotus Sex Position",
            "content": "Nothing says meditation quite like sex. Luckily, there\u0027s a new position to help you do both. The Lotus sex position creates an intimate atmosphere for you and partner like never before. Engage with intense eye contact and penetrate more than each other\u0027s bodies—go straight to your soul. The lotus position in bed is fairly easy to do but does require some flexibility. Check out the lotus flower sex position by following our tips below.\n\nHim: To get into the lotus position for sex, sit on your bed with your legs crossed one on top of the other. Wrap your hands around the outside of her thighs to make things even more intimate. Stare into her eyes as you penetrate her.\n\nHer: To do the lotus position for sex, sit on your man\u0027s lap. Place your legs on his shoulders and stare intimately into his eyes. Old onto his face as he penetrates you from underneath.\n\nWhy It Rocks: The Lotus sex position is wholly unique. It\u0027s both a spiritual and a sexual experience. You\u0027re going to love it!\n",
            "category": "Animated",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Full Nelson Sex Position",
            "content": "Give your lady the full nelson sex move—you know she wants it! The full nelson sex position is a crowd pleaser and sure to get you both to that special moment you crave. A word to the uninitiated, however, this move does require some flexibility and strength. Here\u0027s how ya get it done…\n\nHim: stand up and grab hold of your lover. A good idea is to pick her up on the bed while she is in doggie style position. Wrap your arms underneath her legs from behind to pick her up. Move in and out of her while holding her.\n\nHer: Relax and let him do most of the work, you do enough. Oh, and be sure to wrap your arms around his as he cradles you and screws you.\n\nWhy It Rocks: The full nelson sex move is fun for both of you if you can nail it. But take things slow and don\u0027t rush into the move. Otherwise, it might not be as much fun as it could be.\n",
            "category": "Animated",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Captain Sex Position",
            "content": "Captain your ship with this captain sex position—guaranteed to make things a bit wetter! The best and most intimate sex positions give you direct access to each other\u0027s fun bits and eye contact you can\u0027t move away from. This move is sure to please both of you in all the right ways.\n\nHer: Lie on your back and spread your legs as far as they can go. Let your hands wander down to your nether regions to get down in the best ways.\n\nHim: Climb on top of her but with your knees bent on the bed. Hold on to her legs with your hands and enter her from below. Become the captain of your ship when you take control of the motion of the ocean.\n\nWhy It Rocks: It\u0027s hot, sensual, and allows you both to look intensely into one another\u0027s eyes and gives her easy access to her special spot.\n",
            "category": "Animated",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Banana Split Sex Position",
            "content": "Everyone\u0027s favorite treat is also everyone\u0027s favorite best feeling sex position! That\u0027s right, a banana split is not just banana, ice cream, chocolate and whipped cream—well at least not that kind of whipped cream… But in all seriousness, this is one of the best sex positions for g spot stimulation. The banana spilt position is far and a way a fun, exciting, and sensual position that you both will fall in love with.\n\nHer: Lay on your stomach and spread your legs as far as they can go, preferably into a “split” position. This is the banana split position, after all. Grab your pillow in front of you and curve your neck back slightly.\n\nHim: Get on top of your partner from behind. Keep your legs fairly close to one another. Brace yourself on the bed with your hands and slide up and over her from behind. She has the split and you have the banana!\n\nWhy It Rocks: Hands down this is one of the best sex positions for g spot stimulation. Give her what she wants while you enjoy everything, with the banana split position.\n",
            "category": "Animated",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Animated Reverse Cow Girl",
            "content": "Giddy-up, grab your boots and get ready to buck like you\u0027re on a bronco, this move will test your stamina. This animated reverse cow girl sketch is designed to inspire you to jump in the saddle, backwards. Whether you\u0027ve landed here because you were looking for anime sex positions or you just want to explore reverse cow girl in a serious of steps, this move is sure to please you both!\n\nHim: Lie on your back with your knees slightly parted. Grab ahold of your partner\u0027s hips and grind forward and upwards into her to get the full effect. See our sex position anime above to see what we mean.\n\nHer: Lie on top of your partner in a reverse cowgirl position facing the same way he is facing. Use one arm behind you brace yourself as you grind with your partner.\n\nWhy It Rocks: This animated reverse cow girl position ups the ante on reverse cow girl. Check out our full animation above to see exactly how this works.\n",
            "category": "Animated",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The PileDriver",
            "content": "Do you watch wrestling? If you do, then you\u0027ll already know all about the PileDriver sex position. But if you don\u0027t then you might be wondering, what is the pile driver sex position. The good news is, the pile driver position will give you a very fun night in. Here\u0027s what you need to know about the piledriver sex move to prevent any damage being done to your partner. Trust us, it\u0027s worth all the effort…\n\nHer: Get on the ground and brace yourself and your shoulders on the surface. Put your hips and legs well up into the air and split your legs as far as you can get them to go. Point your toes to flex your muscles and hold it all together while he grinds into you.\n\nHim: Stand above your partner with one leg on each side of her body. Hold on to her legs with one hand on each ankle. Penetrate her from above and grind into her to make her scream. Stabilize her with your legs to make it safer.\n\nWhy It Rocks: The PileDriver sex position is not for the faint of heart. Do it only if you feel safe but if you do it right, it will feel amazing!\n",
            "category": "Animated",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Traction Control – Rear Drive",
            "content": "The best off-road vehicles have all wheel drive, but some have rear drive control, this man on top sex position is kind of like that. It gives you total control of your partner and her pleasure—so don\u0027t abuse it! Instead, give it to her the right way, the way that makes her moan your name. You don\u0027t have to be an expert, but you do have to give it your all. Here\u0027s how.\n\nHer: Lay on your side with upper body twisting back towards your partner. Slightly separate your legs with your top leg folding forward and up towards your body. Look back at your partner to make that ultra hot connection.\n\nHim: Get on your knees behind your partner. One of your legs will be slightly behind her far leg while your other leg will be just to the side of her body. Grab ahold of her ass and stabilize yourself while you take it to pound town.\n\nWhy It Rocks: This man on top sex position will give him a great view and her some killer angles that get you both to that happy place.\n",
            "category": "Animated",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Shaking The Change",
            "content": "You know those old school high school movies where the bullies pick up a nerd and shake them like they have thousands of dollars in their pockets? Well, this sexual position with the man on top is kind of like that, minus the bullying part, unless you\u0027re into that kind of thing. And nothing says sex quite like legs up in the air and hips going to fun town. This move is great whether you\u0027re just starting a relationship or trying to get your favorite person to stick around longer. Here\u0027s how you master it and get ALL the change out of your partner.\n\nHer: Lay on your back with your legs well up in the air. You\u0027re almost doing a headstand, depending on your partner\u0027s strength. Use your arms to brace your body, and stare straight up into your partner\u0027s loving eyes.\n\nHim: Get on your knees under her from behind, pull her up by the hips, and get busy on her sweetness while you hold on to her body.\n\nWhy It Rocks: It\u0027s different from your standard sexual position with the man on top. It gets the blood rushing in all sorts of ways for her, and for him, well, he gets the best view in the world.\n",
            "category": "Animated",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Doggie Style Sex Position",
            "content": "When you\u0027re searching for the best sex position for fat people, you might run into some, well unrealistic positions. That\u0027s what we are here to put an end to. We have one of the best sexual positions for fat people right here in our selection. Doggie style sex position just makes sense for everyone involved. There\u0027s no unnecessary holding up your partner or trying to figure out where things go. It\u0027s just good, fun, sex. Doggie style is pretty self-explanatory, but if you haven\u0027t tried out this position before, it\u0027s going to change your sex life. Here\u0027s how to do it.\n\nHer: Get on your hands and knees on your bed or selected surface. Spread your hips wide to allow your man to enter you from behind.\n\nHim: Follow suit and get on your knees behind your partner with your legs in between hers. Brace yourself with your arms on either side of her body on the bed and begin going to town.\n\nWhy It Rocks: It gives everyone involved easy access to each other without the drama of trying to hold up each other\u0027s weight. It\u0027s a win-win!\n",
            "category": "Animated",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "The Big L",
            "content": "Just when you thought sex couldn\u0027t get any hotter, we have developed a selection of different sex positions for fat people. That\u0027s right, big is beautiful, and this sex position is sure to please both of you. We think it is one of the best sex positions for overweight people because it goes right to the source. When you need an orgasm in the worst way, The Big L has you covered. And that\u0027s not just a play on words. It really is the Big one. Here\u0027s how you can try it out with your partner tonight.\n\nHer: Lay on your side and get as comfortable as possible. Brace yourself with one arm under your neck and your other arm holding onto your partner. Lift one of your legs as high as possible, dropping onto his shoulder if you can. Let him do most of the thrusting, but don\u0027t be afraid to get groovy with it.\n\nHim: Slide in between your partner\u0027s legs after bending down on your knees. Straddle the leg that\u0027s laying horizontal on the bed and grab ahold of the leg that\u0027s up in the air. Hold on to it and take things up a notch with a little bump and grind.\n\nWhy It Rocks: It\u0027s called the Big L because of the way her leg lifts high into the air. It\u0027s great because it gives everyone access to each other with no added weight.\n",
            "category": "Larger People",
            "isRevealed": "false",
            "isFavourite": "false"
        },
        {
            "title": "Missionary",
            "content": "You don\u0027t have to be a preacher to fall in love with this sexual position for fat people. It\u0027s the perfect sex position for overweight people and it feels amazing. No more pulling, tugging or struggling to get the right angle. Just hot, sweaty, amazing sex that both sides will be begging to do again. All you need is a bed and a partner to do it right, and maybe a couple of glasses of red wine. Without further ado, one of our top sexual positions for overweight people.\n\nHer: Lay on your back with your legs spread as far as you can get them to go. Reach up to your man and grab ahold of his neck to inch up the pleasure meter.\n\nHim: Climb on top of your partner with your hips spread as wide as you can get them. Take her to pound town with a few quick thrusts followed by a few slow ones. Alternate for the ultimate pleasure in this position.\n\nWhy It Rocks: It\u0027s easy to get into this position, regardless of your size. It also gives you both a great view of one another adding to the intimacy. It\u0027s one of our favorites!\n",
            "category": "Larger People",
            "isRevealed": "false",
            "isFavourite": "false"
        }
    ]
}