{"table": "WomanOnTop", "positions":[{"title": "Side Saddle Sex Position", "content": "Ready to try sideways sex? This kind of penetration entry might light up your world.\nSometimes, direct penetration facing one another, or facing away, can get boring. Why not mix it up and sit to the side while the other partner faces forward? Side saddle sex achieves that and so much more for you and your partner:\n\nHim: Lay down on your back, directly straight, with your legs out in front of you. Place one arm behind your back while your woman sits to the side, right on your dick. Allow her to position herself correctly before you start your thrusting.\n\nHer: Facing to the right or left, sit down on your man like he\u0027s a seat, with your arms used to stabilize yourself on his groin. Sink his cock into your vagina as you give him the go ahead to make love with passion.\n\nWhy It Rocks: Many people don\u0027t realize how pleasure-filled the side saddle sex position can be for both partners. See the sexual world from a whole new angle as you add in this new kind of fucking perspective.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/side-saddle-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Sex Swing Sex Position", "content": "The sex swing sex position is an easy-to-achieve state of bliss that requires nothing but a little balance from the woman. Lay down, close your eyes, and allow yourself to drift off in pure bliss:\n\nHim: You get to just lay there, completely flat, with your feet out in front of you. Get ready to stabilize your woman as she sits down on top of you, facing away, riding your dick dirty until you scream.\n\nHer: After your man lays down, to get the sex swing position just right, step down on either side of him, facing away, and ease yourself onto his dick. Once there, place one foot down between his legs, and the other on the bed. Get your stability before you start thumping.\n\nWhy It Rocks: This is a user-friendly reverse style sex position that is a great introductory into the world of fucking while sitting. Take our word for it!\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/sex-swing-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Riding Sex Position", "content": "Get ready to ride each other wild as you saddle up for the adventure of a lifetime.\nThe riding sex position is a great way to stare into each other\u0027s eyes, enjoy and view, and sink into deep and meaningful penetration on top. As one of the best sex positions for women on top, here\u0027s how to make it happen:\n\nHim: Lay back with your arms and legs spread as your place your head on the bed. Crane your head slightly up and stabilize yourself with your feet dug into the blankets as you get ready to thrust deeply in an upward fashion into your woman.\n\nHer: Do you know how to ride during sex? You\u0027re about to find out. Once your man assumes position, spread your legs and sit down on him, facing him, as you gently lower your pussy onto his cock. Once in position, get ready to thrust right alongside him.\n\nWhy It Rocks: This sex position provides every woman with serious control while she goes for the ride of her life on a totally exposed and accessible cock. Men, get ready for an awesome view as her tits bounce up and down during the pounding.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/riding-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Reverse Sex Position", "content": "If you like a woman on top, then the reverse sex position is a great way to make it happen. Sometimes, we all need the deep penetration that comes with a sexual position on top, and here\u0027s why:\n\nHim: Lay down on your back, with your legs craned at your knees. Get ready to show-off your upper body strength and stability while you balance your woman as she rides your dick deeply into the night.\n\nHer: After your man lays down, facing away from him, spread your legs and gently sink your thighs around him while his erect cock slides deeply into your pussy.\n\nWhy It Rocks: Reverse sex position is an easy way to ride each other crazy through direct penetration. Plus, it provides the female with penetration control, ensuring everyone feels great the entire time.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/reverse-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Mermaid Sex Position", "content": "If you\u0027re looking for a sex position that comes with bragging rights, then the mermaid sex position can definitely deliver. Mermaid sex is named for the incredible flexibility that needs to come with the female, as well as the core strength to stabilize the whole act. Here\u0027s how to pull it off:\n\nHim: This one is easy for you. All you do is lay down, completely flat with your legs straight out in front of you, while you get ready to stabilize the entirety of your woman\u0027s weight above your groin.\n\nHer: Get ready to pull out all the moves. Sit down on top of your man at his groin and slowly bend your torso, as well as your legs, into the air. Use your arms to stabilize your weight by grabbing the back of your knees, relying on your core to stay stable. Wiggle yourself into perfect cock placement.\n\nWhy It Rocks: This is definitely a sex position that will spice things up for you and your lover. If you\u0027re a woman with yoga, athletic, or flexibility experience, exercise extreme patience in getting this one right.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/mermaid-sex-position.jpg", "category": "Acrobatic, Woman On Top", "isRevealed": "false"},{"title": "Lap Dance Sex Position", "content": "This is a mutually pleasure-filled sex position that will drive men and women crazy, begging for more.\nIf you like to add a little something extra to your sex-making experience, the Lap Dance Sex Position takes it to the next level for both men and women. With extra fondling, double attention, and penetration that is direct and sincere, it\u0027s an easy to achieve lap sex position you\u0027ll want to try this week.\n\nHim: Simply sit down with your legs bent at your knees to either side of you, lean back, and present your cock out and proud for your lady. As she gets onto you, facing away, legs apart, hold her from the front, hanging onto her tits for dear life while she bounces around on top of you.\n\n\nHer: It\u0027s time for some lap dance sex! Back yourself onto your man slowly, penetrating at your leisure, with your legs spread out to either side. Your hands are free to use in this one, so play with yourself or hold the cock to the right angle down below you while your man fondles your breasts.\n\nWhy It Rocks: If you\u0027re a woman who likes extra foreplay while fucking, or a man that wants to immerse himself in breasts any chance he can, this easy sitting sex position requires a flat surface and that\u0027s it! Give it a spin.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/lap-dance-sex-position.jpg", "category": "Kneeling Or Standing, Woman On Top", "isRevealed": "false"},{"title": "Hot Seat Sex Position", "content": "The Hot Seat Sex Position is an easy chair sex act that requires nothing more than the will to try.\nIf you love having sex in a chair, the Hot Seat Sex Position is an easy way to make it happen, with comfortable back support for both parties.\n\nHim: Sit back in the loveseat, legs spread, with your arms behind your head so they are out of the way. That\u0027s it! This is a great hot seat position for you to feel ultimate pleasure without any extraneous movement.\n\nHer: The Hot Seat Sex Position is a great way for you to control penetration while you back onto your man\u0027s cock. Face away from him, legs together, as you slowly inch your way onto him, controlling penetration the entire time.\n\nWhy It Rocks: This is an incredibly comfortable sex position with a seated base that provides both parties with maximum pleasure and control. Try out this easy chair sex position together today.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/hot-seat-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Gemini Sex Position", "content": "Lay back, hands spread for support, and go at each other in the center, bodies connected as one in the Gemini Sex Position.\nThis is one of those lovemaking positions that provides direct eye contact and total control for both parties as they meet as one in the center, conjoined for ultimate pleasure. Because of its sex control, it\u0027s an easy way to reach an orgasm.\n\nHim: This golden gate sex position is comfortable for you, as you sit down, hands behind you for support, and legs spread mildly so your woman can fit inside. Get ready to angle your body just right so she\u0027s feeling maximum pleasure.\n\nHer: After your man is in place, ease onto him with your legs bent at the knee and spread around him. Use your hands to support your back and rest the remainder of your weight on the bed where his cock enters your body.\n\nWhy It Rocks: If you love to watch your partner scream while they orgasm, this lovemaking position provides the perfect control and vantage point. Plus, little flexibility is required!\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/gemini-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Face to Face Sex Position", "content": "Connect deeply with your lover while you gaze into each other\u0027s eyes, working towards a mutual orgasm that pleases you both.\nThe Face to Face Sex Position is an easy way to connect with one another while you penetrate each other\u0027s bodies, caressing the man\u0027s head at the breast in a sitting sex position. With total control, take this one slow for ultimate impact.\n\nHim: Simply sit down, legs spread, using your arms behind your back to provide your body with stability. Embrace your woman as she places her body between your legs, facing you, with one arm around your back. Suck her nipples good and deep to get her wet.\n\nHer: This is an intimate sitting lap sex position that provides you with speed and control. Bend your knees and connect with your man at your pussy, grabbing his back and pressing his face against your chest. Ease into it at a speed that is right for you.\n\nWhy It Rocks: There is something so connecting about having sex face to face, and this sex position gets it done. Requiring no agility, try and take it deeply and slowly for the best feelings possible.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/face-to-face-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Face Off Sex Position", "content": "If you\u0027re looking for a sex position that is sweeter and more intimate, the Face Off Sex Position has got you covered.\nFace Off Sex is honestly one of the sweeter, calmer, and nicer sex positions, placing both parties in control with complete eye contract. The Face Off Position is easily achieved if the man has a sitting surface, like a bed or a ledge, to make it happen.\n\nHim: Sit down comfortably at the edge of a bed, on a chair, couch, etc. and spread your legs slightly. Embrace your woman as she climbs onto you, facing you, legs spread around your back, with her arms wrapped around your shoulders. Pull her close while you sink deep, slowly, into her.\n\nHer: Climb onto your man, placing your feet on the surface for stability, opening your legs and slowly easing your way onto his cock while you push your breasts against his chest. Wrap your arms around his back and scratch your nails down his skin to get him going.\n\nWhy It Rocks: This sitting down sex position is an easy way to get romantic, providing both lovers with a way to connect while having illustrious and forbidden sex.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/face-off-sex-position.jpg", "category": "Kneeling Or Standing, Woman On Top", "isRevealed": "false"},{"title": "Erotic Sex Position", "content": "The Erotic Sex Position leaves little to the imagination as a reverse cowgirl style sex move with plenty to see.\nThe Erotic Sex Position is for couples looking to mix things up and get a new perspective on things. As a dirty sitting sex, get ready to watch ass cheeks clap and flail while pegging goes dark and deep.\n\nHim: You get to lay flat, legs spread forward, on this one. Get your positioning right, because it\u0027s up to you to stabilize your woman while she sits on you, facing away. Place your hands on her lower back, above her love handles, so you can steady her while she rides your dick deeply.\n\nHer: Approach your man, turn around, and sit down slowly on his cock, your legs spread to either side and bent at the knee. Use your hands behind your back to stabilize your body while you control how much or how little you sit atop his lovemaking tool.\n\nWhy It Rocks: This sex position requires little agility from either parties and provides the woman with total control over penetration. Go slowly until everyone is in the right position and ready to rock.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/erotic-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Crouching Tiger Sex Position", "content": "Ready to bring out your crouching tiger, hidden dragon? This is an exposing and intimate position that enables for parties to deeply connect, facing each other, gazing into one another\u0027s sex eyes while the dirty deed is done. Here\u0027s how to do the Crouching Tiger Sex Position right:\n\nHim: You get to lay down with the crouching tiger position, which makes it an awesome position for you. Lay down, legs slightly spread, ready to receive your queen. This is also a great breast viewing position for you, so get ready for the show.\n\nHer: Facing your man, spread your legs apart on either side of him and bend your knees, slowly lowering yourself onto him. Place your hands on his thighs for support, while he holds your knees, and get ready to ride him into the sunset.\n\nWhy It Rocks: If you\u0027re ready to get down, close, and intimate with your partner, this is an easy sex position that requires minimal flexibility. Although the woman does more of the heavy lifting, she is in control with regards to penetration so everyone is happy with the end result.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/crouching-tiger-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Cradle Sex Position", "content": "If you\u0027re into sitting sex positions, then the Cradle Sex Position has got you covered. All you need is a flat surface and a wall for the man to lean up against as the woman is slowly lowered, in a sitting position, on her man for ultimate, deep, and alluring penetration. Here\u0027s how to make it happen\n\nHim: The Cradle Sex Position will provide you with the opportunity to demonstrate your strength and manliness as you will be entirely supporting your woman. Sit down, legs in front of you, with your back against the wall. All your woman to approach you, facing away, lowering herself legs spread onto you. Grab under her thighs and lift her up entirely onto you, holding on as you thrust.\n\nHer: Your man\u0027s got this one covered as he holds you from the lower thigh, facing away, while he goes to town. Reach around behind you and hold his back for support.\n\nWhy It Rocks: This is an easy sex position, if the man is up for some heavy lifting, for both parties and requires no furniture – just a back support the for man. As a deep, penetrative position, go slow to ensure everyone is ready for ultimate thrusts.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/cradle-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Chair Sex Position", "content": "It\u0027s time to get wild and crazy with that loveseat sitting in your living room. The Chair Sex Position is a perfect sex pose for couples looking to mix things up, taking it out of the bedroom and into other parts of the house. Chair sex can be crazy and adventurous, using the structure of the chair to spice up your sex life. Here\u0027s how:\n\nHim: This is quite possibly the most comfortable sex position you will ever assume as a man. All you have to do is sit down and lay back in the curves of the chair, legs slightly spread and ready for your woman. What could be better?\n\nHer: Once your man has sat down, sit down on top of him, facing away from him, with your legs between his. Lower yourself onto him according to your pleasure, and grab onto his face while he takes you for a chair sex spin.\n\nWhy It Rocks: This chair sex position is easy to do, requires no strength or agility, and can feel incredibly pleasurable, helping you to mix up things by adding in some furniture support.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/chair-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Capricorn Sex Position", "content": "The Capricorn Sex Position is a great way for women to control their love making and pleasure centers while riding their man long into the night. Easy to achieve and definitely considered a sex position that women love, here\u0027s how to make it happen:\n\nHim: Simply sit down, legs stretched out in front of you, with your arms behind your head for balance. You can lean against a wall, too. Wait for your woman to assume position. That\u0027s it!\n\nHer: This is a classic female on top sex position in which you are going to reverse cowgirl your man, legs spread apart. Lower yourself onto him at your leisure, controlling penetration until it feels perfect for you. Place your hands on his calves for stabilization, leaning forward slightly for the perfect angle of penetration.\n\nWhy It Rocks: The Capricorn Sex Position provides both partners with the ability to control their preferred amount of penetration and thrusting. With the right patience, you can both hit an orgasm seamlessly, without any physical strain.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/capricorn-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Amazon Sex Position", "content": "As arguably one of the freakiest sex positions in the game today, the Amazon Sex Position challenges both lovers to jump out of their comfort zones, switching positioning in a way that is empowering and even better feeling. This move is generally easy to maneuver and requires the male to have some flexibility, while the woman is able to ride on top according to her preference.\n\nHim: The Amazon fuck position requires the male to assume a fetal position typically reserved for the woman. You\u0027re going to get to relax this time, laying on your back and pulling your legs up far enough so the penis can penetrate the woman, sitting atop of you. See the world from her perspective with this one, allowing your body to relax while you focus on the best parts of love-making.\n\nHer: Get ready to ride on top with this Amazon style sex, with your partner\u0027s legs in front of you as you ease down slowly for a powerful, yet gentle fuck. Lean forward and support yourself on the bed, pillows, or wall to keep your balance so you can control a classic sex position that women love.\n\nWhy It Rocks: The Amazon sex position is something everyone can handle, and can be performed in any kind of setting. It\u0027s a move that is fun for both of you, and with a little patience, can feel even better once you get the angling down. Check out Amazon sex position videos to help you get it right.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/12/amazon-sex-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "Pearly Gates Sex Position", "content": "Get ready to head to the pearly gates with the pearly gates sex position. This is just one of those sex positions you must try if you want to expand your sex life. If you and your partner plan on sticking it out to the end of your life, or if you just want to have an orgasm in a whole new way, then the position of the pearly gate is something you should definitely try out. Here\u0027s how you do it.\n\nHim: Lie down on your back with your knees bent up in the air and reach your hand around to grab your partner, maybe even a handful of breasts if you like. Bend your legs so you can leverage yourself for better penetration. \n\nHer: Lie on top of your male partner mirroring his body with your knees bent and your arms straight out to either side of your body. Let him penetrate you from underneath. \n\nWhy It Rocks: The pearly gates sex position is a lazy person\u0027s way of having sex. If you like to be lazy, this is your move\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/08/pearly-gates-position.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "shesontopher", "content": "Ever heard of the butterfly sex position? If you haven\u0027t, where the heck have you been? This twist on traditional ‘girl on top\u0027 positions is a thrilling experiment in new sex positions. We\u0027ve partnered our take on the position with butterfly sex position images like the one you see above so you can see clearly what we\u0027re talking about. Stop googling “sexual position butterfly pics” and start reading more about it here. \n\nHim: Lay flat on your back on the bed with your legs flat on the surface. Try to lay as still as you eagerly anticipate your girl climbing on top and sliding herself over you. \n\nHer: The butterfly sexual position is best done if you climb on top of your man while he is laying flat on his back. Straddle his body on either side with your legs lying flat. Pleasure yourself and him as you fly like a butterfly over his member. \n\nWhy It Rocks: It\u0027s low-key and can be done anywhere, plus it feels amazing to everyone involved! \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The_Butterfly_Sexual_Position_The_Cowgirl_Position-1.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "recinopdir", "content": "We love sex positions with the woman on top. Why? Because, well, it means less work for the guy! In all seriousness, this reclined position is incredibly fun to do. Like all of the best woman on top sex positions, this reclined position gets both partners full engaged and intimate. \nAlso, if you want to switch up the same ole sex positions with the woman on top like cowgirl, then this position could quickly become a favorite. So, how does it work? Well, we\u0027re glad you asked.\n\nHim: Sit on your bed, couch, floor, or sandy beach for your freaky hippies, with your butt on the ground. Spread your legs fairly wide with the heels of your feet anchored on the ground. Brace your upper body by placing your hands on the ground and position your hips upwards. \n\nHer: Get on top. Place your feet on either side of his hips spilling out to the sides. Use your arms to steady you with your eyes gazing straight into his eyes. Then start grinding it out! \n\nWhy It Rocks: This is by far one of the most sensual sexual positions in our category. Gaze straight into his/her eyes to spice it up. For women, it\u0027s great because it lets you fly free and go to town on his member. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/Reclining_In_Opposite_Directions-1.jpg", "category": "Animated, Woman On Top", "isRevealed": "false"},{"title": "reverse-cowgirl-sex-position", "content": "\n\nThe Reverse Cowgirl sex position is one of the world\u0027s favorite positions. While some might think that this position is all about fantasizing about another person besides your partner, we think it\u0027s all about dat ass. But what is the reverse cowgirl sex position, and how can you master it so that your partner falls in love, with it not you?\nIf you\u0027re searching for the reverse cowgirl sexual position, you\u0027ll get tons of results. Most of which overcomplicate this very simple, very amazing, position. So grab your cowgirl boots and hat, leave the spurs for the real animals, and climb on top—it\u0027s going to be fun a ride! \n\nHim: Lay down flat on your bed with your knees bent just enough to give her a saddle to ride. Then relax. Be sure to grab her hips and even hair—if she\u0027s into it—and start grinding on her from behind. \n\nHer: Climb on top of your male partner reverse style. Allow your hips to open and then lean slightly forward after he\u0027s entered you. Start riding him like your favorite horse, and enjoy the wild ride that follows. \n\nWhy It Rocks: Everybody gets a little bit of what they love all in one amazing sack session.\n\n\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/Reverse_Cowgirl.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "lyinopandfac", "content": "Sensual, with a great view, sex positions for woman on top are the best. If you agree, then this position is sure to get your engine fired up. Get a view of that killer booty and kick back and relax, this super-hot position is sure to get your pulse racing and your, erm, body parts all sorts of kicked on. So make your bed, light a few candles and get ready for a great time. Here\u0027s how to master this amazing sex position.\n\nHim: Lie on the bed. Melt into the comforter. Spread your legs wide with your member out in the open ready to enjoy a great time. Relax your shoulders and your body. Place a pillow under your head or use your arms to brace your head as you lay there.\n\nHer: Climb on top like you are getting ready to ride the biggest, best dick of your life. Go full on reverse cowgirl and place his member inside you. Lean forward and place your hands on both of his ankles. Pin him to the bed and then begin moving your hips back and forth, front to back.\n\nWhy It Rocks: This is one of our favorite sex positions for woman on top because it is intimate, provides an amazing view for him, and feels oh so great for her. The angle also creates direct friction with her G-spot, which is a plus!\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/Lying_Opposite_and_Face_Down-1.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "crabfestival", "content": "The Crab Walk Sex Position has nothing to do with crabs, that we can assure you. But the crab sex position is a key position if you and your partner have been going at it for a while with fairly tame and boring sex under your wings. Embrace your inner crustacean with this simple to do, yet so hot and fun position. \n\nHim: Sit down on your ass with your legs spread as wide as you can get them to go. Grab your lover\u0027s hips and hold on to them for dear life. You don\u0027t want her waddling away from you!!\n\nHer: Straddle your man with your legs spread out to either side of his body. Widen your legs and hips as much as they can go. Brace yourself with your arms behind your back. Slightly bend your back to get that oh so perfect angle. Toss your head back and enjoy the ride. \n\nWhy It Rocks: It is so intimate yet so sexual that it makes missionary look like a dance move. The Crab Sex Position is definitely one of the hottest in the book and gives you a new take on traditional male on female moves. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The-crab.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "winbacchair", "content": "Just when you thought things couldn\u0027t get any hotter, this amazing position came into your world. We are always looking for the best possible sex positions with woman on top and this one came into our view and changed our world. It will probably do the same for you. All you need is a good sturdy bed and zero clothing, things are going to heat up quickly. Here\u0027s how to master this sultry sex position. \n\nHim: Lay back on your ass on the bed. Brace yourself with your arms on the bed with your hands turning back towards the wall. Bend your right knee ever so slightly, giving your girl a good ‘chair\u0027 shape to climb on top of. \n\nHer: Climb on top of your man as he sits in a bended chair like position. Spread your hips and legs wide enough to straddle your man on either side. As you do, slide him inside of you fully. Slide down on all the way on him so you are sitting his lap. Grasp his face in your hands and start doing the dirty, this one could cut your sex session short. \n\nWhy It Rocks: Intimacy! Of all the sex positions with the woman on top, The Winged Back Chair creates face-to-face hotness you cannot get with any other position out there. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The-Winged-Back-Chair-1.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "supbalpos", "content": "Every now and again, a sexual position lights up our world and sneaks its way into our regular repertoire of sexual positions. This is one of those positions. We have done our research to list some of the best woman on top sexual positions out there, and this one really breaks the mold. Here\u0027s how you can enjoy it with your partner. \n\nHim: Lay down on the bed with your legs together so your partner to climb on top and get busy. Place a pillow or blanket beneath your hips for stability and extra leverage. Keep your back flat against the bed. \n\nHer: Climb on top of your partner as his legs are flesh together. Straddle him in reverse cowgirl position. Lean forward against his thighs and grab hold onto his shins, pulling his legs closer to your chest. Then use your hands to stabilize yourself as you move up and down on his member. \n\nWhy It Rocks: We call this one The Super Ball because the man is balled up like, well, a ball, and the bouncing caused by this position reminds us of a rubber bouncy ball. It\u0027s hot. That\u0027s all you need to know. Its hands down one of the best woman on top sexual positions there is. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The-Super-Ball-Position-1.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "rocketsled", "content": "You know when you\u0027re a kid and you have a sled that goes super fast in winter down a snow hill? Yeah, this position is kind of like that. We\u0027ve added it to our woman on top sex position category to give you a new take on the reverse cowgirl positions. Here\u0027s how to get busy with this move.\n\nHim: Sit on a bed/couch/chair with your fit planted firmly on the ground. Slightly raise your right foot and leg for leverage. Place your hands on the bed behind you to stabilize your position. \n\nHer: Get in a reverse cowgirl position on top of your partner as he sits on the bed. Allow your feet to straddle him on both sides. Next, lean forward and place your hands on his knees for stability. As you lean forward, begin to grind on him pushing your pubic bone farther down into his hips. \n\nWhy It Rocks: This is one of our top woman on top sex positions because it allows you freedom to touch the clit during penetration. Men can easily swing their hand around to the front of their partner and go to town on their best bits while the woman does the grinding. It\u0027s so hot!\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The-Rocket-Sled-1.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "ridingt", "content": "It isn\u0027t often that we come across amazing sex positions woman top side, but this one might take the cake. It\u0027s as simple as it is beautiful, and as long as you have a bed and a bit of time, it might become your favorite position yet. Get it on by following these simple steps.\n\nHim: Lay on the bed. Relax, and take your hands to your partners hips as she rides you. Slightly bend your head forward so you can take a great view of her breasts and body. This position is a crowd pleaser to be sure. Keep your hips slightly agape so your partner can fully feel you. \n\nHer: Get on top and straddle your partner. Lean forward so you can get the traction to your g-spot and your clit simultaneously. \n\nWhy It Rocks: Not many sex positions woman top side allow you the view that this one does. Couple that view with amazing angles that hit all the right spots, and this position is a crowd pleaser for both partners.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/Riding-the-T-1.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "notifshehass", "content": "Kick back and relax, you\u0027re in for a magic experience. The Magic Carpet sex position is much more down to earth and normal than some of our other positions, making it a favorite for the average couple. Show her a whole new world, places she\u0027s never been too, with this super sexy move. \n\nHim: Lay on your back with your legs slightly parted. Hold onto your female partner\u0027s ankles and relax fully as she enjoys the ride. \n\nHer: Lay on top of your partner facing them with your knees bent and your legs spread completely. Brace yourself on partner\u0027s legs. \n\nWhy It Rocks: You don\u0027t have to be a professional porn star to enjoy this sex position. The Magic Carpet sex position is easy to do and gives him a great view. It gives her a great position to get that powerful O. Try out this move to amp up your sex life for good.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/Magic-carpet.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "hesonbedshei", "content": "What guy doesn\u0027t want to see his girl do a squat? Even better, why not have her do a squat on top of you? Sure, you\u0027d love that. Well, this sex position is exactly that. The Squat Down involves your girl squatting down on to your member while she goes to town cowgirl style. Comfortable and low key, it\u0027s a sex position with a great view for him!\n\nHim: Lie on your back with knees slightly bent. Wrap your hands around your lover\u0027s waist and pull her closer to you as she rides you back and forth, up and down. Enjoy the view and the experience. \n\nHer: Sit down on top of your partner like you would in cowgirl style, with both legs on either side of his body. Place your feet up by his ears on either side. Brace yourself on his body and lean slightly back. Then move up and back, top to bottom until you both bubble over. \n\nWhy It Rocks: For him, it feels amazing with very little effort involved. For her, it allows for the best g-spot penetration with just a few strokes. It\u0027s a win-win!\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/He-is-on-the-Bed-She-is-Squatting-Above-1.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "edofbedsheis", "content": "You know those super sensual moments in your life where everything goes quiet and your focus narrows down to a single person? Well, this sex position is sure to please if so. The Edge of the Bed, On His Lap position gets you both to engage and shut off the world around you. Nothing else does it quite this way. So shut of your iPhone, tune into each other, and get one step closer to that orgasm you both crave. \n\nHim: Sit on the edge of your bed with your legs spread. Also, brace yourself on your bed. Hike your feet up onto your toes. You\u0027ll love this sexy position. \n\nHer: Climb on top of your man. Squat down on his junk and brace yourself on his thighs. Look him square in the eye and embrace this special moment. \n\nWhy It Rocks: The Edge of the Bed on His Lap sex position will get you both tuned into each other and closer to that special moment.\n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/Edge-Of-Bed-She-Is-On-His-Lap-1.jpg", "category": "Woman On Top", "isRevealed": "false"},{"title": "chanposakait", "content": "The Italian chandelier sex position has nothing to do with décor, of that we can assure you. But the Italian chandelier position is pretty opulent if you\u0027re prepared. The Italian chandelier style position is sexy, sensual, and is sure to give you both one heck of a good time. Pair it with other moves like the PileDriver to amp up the pleasure. And if you\u0027re just curious what this move looks like, then check out the Italian Chandelier position picture we\u0027ve posted for you. \n\nHim: Lay down flat on your back stable. Let her do all the work for you as you sit there, relaxing into the passion of the move. \n\nHer: The Italian chandelier sex position is all about her. Climb on top of your partner and position yourself in the opposite direction. Bend your knees and brace yourself with your hands on either side of his body. \n\nWhy It Rocks: The Italian chandelier position is a pretty lazy move for him, but for her, it involves a bit of work. Either way, it feels absolutely incredible for both of you. \n", "image": "https://www.sexualpositionsfree.com/wp-content/uploads/2018/06/The_Italian_Chandelier_Position-1.jpg", "category": "Woman On Top", "isRevealed": "false"}]}