Repository: pmidura/Make-It-Hot
Catalog: lib/l10n/app_*.arb
Languages: pl

source: Your progress
pl: Twój postęp

# favPositions
source: Favourite positions
pl: Ulubione pozycje

source: View positions!
pl: Wyświetl pozycje!

source: Can't decide?
pl: Nie możesz się zdecydować?

source: Surprise me!
pl: Zaskocz mnie!

source: Categories
pl: Kategorie

source: Man On Top
pl: Mężczyzna na górze

source: Woman On Top
pl: Kobieta na górze

source: Oral
pl: Seks oralny

source: Threesome
pl: Seks w trójkącie

source: Foursome
pl: Seks w czworokącie

source: Spooning
pl: Na łyżeczkę

source: Acrobatic
pl: Akrobatyczne

# kneeOrStand
source: Kneeling Or Standing
pl: Klęcząc lub stojąc

source: Anal
pl: Seks analny

source: Animated
pl: Animowane

# largPeople
source: Larger People
pl: Dla puszystych

# listOfFavPos
source: List of favourite positions
pl: Lista ulubionych pozycji

# noFavPosText
source: No favourite positions
pl: Brak ulubionych pozycji

source: Scratch to reveal!
pl: Zdrap, aby odsłonić!

# shallWeStartFun
source: Shall we start the fun?
pl: Zaczynamy zabawę?

# discoverNewPos
source: Discover new positions!
pl: Odkryj nowe pozycje!

# listOfDiscovPos
source: List of discovered positions
pl: Lista odkrytych pozycji

# noExposedPos
source: No exposed positions
pl: Brak odkrytych pozycji

# scratchScreenInfoText
source: You have already discovered all the positions in this category!
pl: Odkryłeś już wszystkie pozycje w tej kategorii!
